[
  {
    "title": "My husband remembers The Brownie Rule™️, even when I don’t",
    "text": "My husband and I made up The Brownie Rule™️ early on in our marriage (over 10 years ago). It’s been over 5 years since it’s been used. The rule is, when there is an odd number of brownies, I get the extra. \n\nWe got an order of Domino’s brownies with our dinner this week, and he did the divvying up of the brownies. He gave me my half and said, “There, we’ve followed the brownie rule!”\n\nI had totally forgotten, so he reminded me. He is always honest with me, and thinks the world of me. He makes me smile every day, is a great communicator, a fantastic parent, and so driven to take care of our family. \n\nHe has been by my side as my best friend since 2010, we’ve been together since 2011, and got married in 2013. I was 19, and we were so sure of each other, and everyone saw that he treated me so well, that there weren’t any actual objections to us getting married so young. When I wound up with schizoaffective disorder, I was just a shell of a person and was not the most pleasant person to be around. He was there by my side, encouraging me to keep going, taking care of our son and home, keeping up with my medical stuff, and doing whatever he could to keep us afloat when I was unable to work for a few years.  \n\nWe have our home, our son, and our wonderful family of blood relations and soul relations. We have a fun dog, a running vehicle, and a whole lot of love. He is the best thing that has ever happened to me. I just want to tell how much I love him to the world. ",
    "score": 407,
    "created_utc": 1746059709.0,
    "subreddit": "happy",
    "id": "1kbvyld"
  },
  {
    "title": "What’s the last small act of kindness someone did for you?",
    "text": "Kindness heals — both the giver and the receiver. Be the reason someone feels seen today.",
    "score": 7,
    "created_utc": 1746118296.0,
    "subreddit": "happy",
    "id": "1kcdkd1"
  },
  {
    "title": "Foster Mom Cancels Vacation After Realizing She Can’t Live Without Senior Dog",
    "text": "Tyson’s foster had a plane ticket in hand and a vacation on the horizon … but as she handed over this 9-year-old snugglebug to our team, her heart had other plans. Mere hours later, she called us back and said the tear-worthy words: “I can’t live without him.” So, in one of the sweetest plot twists we’ve ever heard, she canceled her trip and adopted Tyson instead! Now, he’s got a permanent boarding pass to her couch — and to her heart.",
    "score": 126,
    "created_utc": 1746058151.0,
    "subreddit": "happy",
    "id": "1kbvfxr"
  },
  {
    "title": "Finally on track with money after a long stint of unemployment",
    "text": "So in a prior post i talked about how i got a job offer that felt to good, can be found here [https://www.reddit.com/r/offmychest/comments/1k3rs6v/i\\_am\\_trying\\_as\\_hard\\_as\\_i\\_can/](https://www.reddit.com/r/offmychest/comments/1k3rs6v/i_am_trying_as_hard_as_i_can/)\n\nWell here we are about 2 weeks later and if managed to get myself on track, i paid my rent on time (without any loans from friends and family) and i paid my child support +the additional amount owed,. It is wild to me that in the past month, i have spent about 7,000, granted i had to pay rent twice in a row which does not help, but even after all this i still have a few hundred in my pocket which will be used to get me to next payday, then i can actually start to retain money, prob about 1500 a month ill be able to get my accounts healthy, get my utilities paid current, start making payments to my friends and family to get them the money they have loaned me over the past year back.\n\nIll finnaly be able to just...get food without needing to check my bank, or transfer $40 from savings to checking so i can buy food to last me another week. I still have a ways to go, but i can actually see a light at the end of the tunnel for the first time in years.",
    "score": 3,
    "created_utc": 1746117146.0,
    "subreddit": "happy",
    "id": "1kcd3i7"
  },
  {
    "title": "Reunited with my lost dog 8 years later, the day before my birthday!",
    "text": "When I was pregnant with my first child in 2017 my mom gave away my dog and wouldn't tell me who so I thought I would never see him again.\n\nThe day before my birthday I took my kids to the park and noticed a dog that looked similar to my current dog an Australian Shepherd.\n\nMy daughter said the other was a shiba inu so I looked closer and noticed it was a large yorkie without a doxxed tail.\n\nI thought of my old dog but it didn't click at first! Once I realized there probably aren't a lot of giant yorkies running around I took a closer look.\n\nIt was him! I gave him some snuggles and added his owner on instagram and took a picture (he was giving me a kiss). He is well groomed and well trained. I am so happy I got to see him again and he is happy/healthy.\n\nHe is 10 years old now!",
    "score": 456,
    "created_utc": 1746021723.0,
    "subreddit": "happy",
    "id": "1kbhaal"
  },
  {
    "title": "The sun was shining all day, I worked out and ate healthy — I just feel so happy right now.",
    "text": "",
    "score": 68,
    "created_utc": 1746048062.0,
    "subreddit": "happy",
    "id": "1kbrqxu"
  },
  {
    "title": "It’s the little gestures that make me happy",
    "text": "My boyfriend and I have been wanting to eat healthier and so every night we will make salads together to have when we are both at work so we have something healthy and filling. We had this flimsy containers that were starting to crack so we ended up getting matching salad containers that come with a fork mine being green and his being grey. Last week or so I lost the fork that came with mine and haven’t found it and so I’ve been using just plastic forks at the break room at my job. Tonight I was a bit emotionally happy idk I was just feeling really happy with him and how well our relationship has progressed in almost 10 months! So I was leaving his house and I grabbed my salad and I see his fork for his bowl on my bowl and I looked at home and he’s smiling and says “it’s your turn” and I couldn’t stop smiling and I started bawling putting my shoes on and he’s just smiling on the stairs. He just makes me so darn happy I can’t get enough of this guy and I never have been treated so respectfully and cared for and loved than this guy. I love him so much and I’m so happy to be with him!",
    "score": 22,
    "created_utc": 1746070621.0,
    "subreddit": "happy",
    "id": "1kbzdxe"
  },
  {
    "title": "Watching them bloom felt like a little mental health boost. Nature has its own quiet way of healing, doesn’t it? Sending some sunflower energy to anyone who needs it today",
    "text": "",
    "score": 1,
    "created_utc": 1746129091.0,
    "subreddit": "happy",
    "id": "1kchvxj"
  },
  {
    "title": "01/05/25 - Posting daily updates on what made me happy",
    "text": "- I went to breakfast with a good friend and we caught up and spoke about the week we've had. So great catching up with this guy, looking forward to our next one. \n- A close friend got her test results back and she is cancer free! Such a great outcome, plus the doctor said she is young! \n- My gorgeous wife came home so happy street buying some cool looking clothes, she turned back into her younger self and read so excited to she me!\n- Freebird, you know which part I'm talking about, that came on as I got the freeway, 60km to 110km right at the top of the build up. Best run on the freeway after that too. ",
    "score": 3,
    "created_utc": 1746100896.0,
    "subreddit": "happy",
    "id": "1kc6zi6"
  },
  {
    "title": "After 22 years, I finally learned how to ride a bike!",
    "text": "This may seem like a small achievement to some, but to me, it means the world. \n\nI grew up pretty poor and never learned how to ride a bike, but I’ve always wanted to. My dad was very good at it when he was younger, but unfortunately he had his bikes stolen before I was born. I always admired him for his skill, and wished I could be like him someday. \n\nWell, I’m 22 now and one of my relatives who no longer rides decided I could have their bike. It needed cleaned and a new chain,  and I did that. I’m overweight and my balance isn’t great, so for the first two times I tried learning with the help of my roommate I got very frustrated and just could not get it.\n\nBut today, I tried yet again, and of course i couldn’t get it no matter how hard I tried and I was getting so incredibly frustrated, I thought it must’ve been because I wasn’t talented and just could not get it.\n\nBut suddenly, right when I was about to quiet, a few young men in a nice grey sports car rolled up to the parking lot and rolled down the windows and shouted “YOU’RE DOING GREAT! YOU’VE GOT THIS!” And then drove off. And honestly, this helped so much, I think it was the last push I need - I immediately put my all into my next attempts and I DID IT! I fucking DID IT, guys! I’ve been wanting to do it for so long and I finally managed to ride it! A few more tries with my roommate pushing me, then I managed to do it myself several times!\n\nThe neighbors of my apartment complex who were outside at that point even cheered me on and gave me tips, and it was so awesome to be able to do something I’ve always wanted to do.\n\nI know this really is a small achievement, but I already feel myself wanting to get back on and do it again tomorrow. I have a feeling this will help me get out of my depressive episode and finally help me get some exercise. It’s a huge achievement for me and I’m so proud of myself for it.\n\nTo whoever those young men were in the grey car, thank you so much - you gave me the final push I really needed to finally be able to move forward.\n\nEvery time I ride now I think of my dad - thank you for everything and I just wish you were here to see me now. ",
    "score": 27,
    "created_utc": 1746055035.0,
    "subreddit": "happy",
    "id": "1kbucpk"
  },
  {
    "title": "A stranger helped me and it felt really nice",
    "text": "Yesterday, I went to the supermarket with my kid. Before that, we had gone to see his dad (his office is nearby) and I left everything with him (backpack with keys, his change of clothes, etc) before going to buy the stuff we needed. \n\nI got to the register and a lady behind me was looking kinda nervous with a sole bag of rice. I thought she was maybe going to ask me to go ahead of me, I had probably 10 or 15 things, not much, but still, I was going to let her go first, I was in no hurry. Then she asks \"Could you please save my spot? I just need eggs\" I assured her that would be no problem. My kid, being the goofy kind soul he is, started to march around her bag of rice that she left so that on one would take it either. She came back not a minute later, grateful and talking to my kid for a bit. \n\nOnce my things had been checked, I realized I had left my wallet in the backpack! I kinda panicked. I could use a QR code to pay, but I had not enough money in that account and my second account didnt' work with the QR code. I called my husband to ask him to pay, that I would send him the QR code, but the lady at the register was already giving me the stinkiest eye ever. \n\nAfter 3 minutes of waiting (I checked) and husband not being able to pay and also getting worried on the other end of the line, I told the exasperated woman behind the register to just cancel the whole transaction and I would be back within 10 minutes. It is then that the lady behind me said \"Hey, I can pay it for you and then you can transfer the money. That okay?\" I was like \"Yes! Thank you so much! Give me your number, I'll do it right now. Thank you again!\" She was all smiles and told me it was no problem. She paid my bill, paid hers and then I transferred the money to her account. \n\nIt was such a nice moment for me. It left me smiling for the rest of the night. ",
    "score": 39,
    "created_utc": 1746030255.0,
    "subreddit": "happy",
    "id": "1kbknpe"
  },
  {
    "title": "I walked for 30 minutes straight for the first time since forever without feeling like i'm about to die.",
    "text": "I've been faltering on my diet and had gained all the weight lost and some more, but I am hoping to get back on track. This is me testing if doing it for vanity and validation can keep me mentally motivated to stick to my journey :)",
    "score": 247,
    "created_utc": 1745983379.0,
    "subreddit": "happy",
    "id": "1kb6uh7"
  },
  {
    "title": "How my now Fiancé healed me of my baggage with a kiss.",
    "text": "I just wanted to come on here and document one of my most healing moments l've ever experienced-even if it happened over a year ago now, I still remember it like it was yesterday!\n\nFor context, I used to have trauma relating to physical touch from my first relationship (among other things, but that's not relevant for this story), where one of the results was in a fear of kissing.\n\nWith that being said, here's my story:\n\nAfter taking years to heal from my prior abusive relationship, I (22F) finally felt ready to enter back into the dating scene. After searching (for surprisingly not a long time), I matched with my Fiance (27M), and we started going out.\n\nI was very much a slow burn, and I warned him as much. Once we were a few dates in, he asked if he could kiss me for the first time. Of course, with me being a slow burn and having a reluctance towards kissing, I politely turned him down. But I also made sure to reassure him that I was definitely interested in him, just that I needed more time.\n\nNow, after a few more dates, I was really starting to fall for this guy. After a particularly lovely night where he took me to a concert and the night was filled with laughter and conversation, he asked once more if he could kiss me, right as I was leaving his car.\n\nI looked at him, and just felt so in awe of him. I thought, \"Man, I'm really starting to like this guy. I think he's earned it- he deserves at least one wholesome peck.\" More importantly, I wanted to give him a kiss.\n\nIn the abusive relationship that I was in, I always felt forced, manipulated, or bargained into giving physical affection- particularly with kisses. The first kiss I ever shared with my ex gave me the worst gut feeling I have ever felt in my life. I truly believe that feeling was from my guardian angel, and that I was being warned about the relationship I was entering.\n\nAnyways, back to this newfound healthy love!\n\nWe leaned in and shared the most wonderful kiss. I cannot stress this enough- it felt unreal. It couldn't have lasted for more than half a second, and yet time genuinely seemed to stop for me. I experienced the most intense feel-good butterflies l've ever felt. It seemed just like the movies and stories l've read; sparks seemed to fly around us in that moment.\n\nIt was such a beautiful, healing moment for me. To go from such horrible, gut-wrenching fear and trauma, to feeling over the moon in happiness is something I'll never forget.",
    "score": 62,
    "created_utc": 1746002225.0,
    "subreddit": "happy",
    "id": "1kbbl8v"
  },
  {
    "title": "I finally have pants after only being able to wear pajama bottoms for almost a year",
    "text": "I gained a lot of weight after graduating high school and stopped fitting into most of my pants. After almost a year of having almost no actual pants left to wear and just dealing with awkward-fitting pajamas, I went thrifting, picked up 5 pairs of pants, and they all fit amazingly. I have pants! I like dressing nicely, so I’ve felt so insecure not having any clothes to wear apart from one ill-fitting pair of slacks and two pairs of sweatpants that are way too hot for my climate that I just gave up on the way I dressed and have largely stopped going outside or visiting people because I don’t have enough clothes to pack for more than a day or two at a time. This is huge for me. I no longer have to cycle between sweatpants that make me heatsick and a frumpy, too-short pair of slacks. I. Have. Pants! And now if I decide to lose weight, it’ll be out of choice, and not out of absolute necessity of needing to be able to fit into clothes that won’t make me heatsick when I go outside.",
    "score": 88,
    "created_utc": 1745977907.0,
    "subreddit": "happy",
    "id": "1kb53px"
  },
  {
    "title": "We just adore this and it put a smile on our face 😊 - Young Irish farmer's genius hack to keep calves entertained day and night",
    "text": "The best way to keep happy calves is by providing them with hoppy entertainment, a young farmer says. Irish man and farmer Philip Stewart, 28, has come up with some creative ideas to keep his farm animals in high spirits.\n\nHis calves love to play with massive red space hoppers- which are usually used by children to bounce up and down on. The third generation farmer says toys that keep his animals occupied are paramount to their happiness.\n\nHe also fills small holed balls with hay so that the young cows have fun while feeding. The farmer, who has a Youtube channel documenting the antics of his family’s 400-acre farm, said: “Happy calves need enrichment, and the Temu space hopper - usually a children’s toy - is keeping the bulls entertained in the barn day and night.”\n\nAfter completing his farming qualifications in 2016, Philip runs a farm with around 250 dairy beef calves. He wanted to put his own stamp on the family business - and one of his ideas was looking at different ways to acquire bulk products needed for its everyday running.\n\nThe farmer buys many supplies from online shopping platform Temu - including the space hoppers and hay balls. He also purchased products from the site that he found hard to access in the Irish midlands, such as a vaccine gun, 20 syringes and several bottles.\n\nPhilip said: “We use a large bag of syringes and bottles every week for multi-mineral shots and vaccines. But the local co-op usually sells vaccine consumables in batches of five or ten.\n\n\"We just need consumable quantities that work for our commercial scale – Temu had them and we got them fast. And when our dosing gun broke, we had spares ready to go. It was a lifesaver.\n\n“Our friends and fellow farmers were sceptical at first, and now our friends are asking where we got everything.”",
    "score": 10,
    "created_utc": 1746012681.0,
    "subreddit": "happy",
    "id": "1kbe5ej"
  },
  {
    "title": "A stranger paid for our meal like a generous ninja",
    "text": "My family was on vacation this weekend in Palm Springs and we went out to dinner. The gentleman at the adjacent table noticed my husband's sportswear and said he used to live in our state, and we talked football for a while, then he and his son left and we said goodbye.\n\nWhen we asked for the check for our meal 10 minutes later, we were told, \"It's been taken care of, tip and all.\" \n\nTo that sweet man, thank you for that! It seems unfair to exchange pleasant conversation for a free meal, but we will pay it forward. \n\nGo Vikes! (Without Aaron Rodgers!)",
    "score": 79,
    "created_utc": 1745967960.0,
    "subreddit": "happy",
    "id": "1kb1qcq"
  },
  {
    "title": "30/04/25 - Posting daily updates on what made me happy",
    "text": "* Got to have a sleep in and watch my beautiful wife get ready in the morning. It's a great way to start the day!\n* I took my daughter to vote for the first time, she was nervous and excited about casting her vote, I think she did really well.\n* I got approval from a client to go live with a website, this is great as it is leading to more work and to ongoing monthly payments. Yay!\n* I was working out at the gym and my good mate I hadn't seen for at least 4 months comes walking in. It was great catching up with him, he is a strong lad and 20 years my junior, we get a long great, even though there is a big age gap. ",
    "score": 6,
    "created_utc": 1746015462.0,
    "subreddit": "happy",
    "id": "1kbf0a3"
  },
  {
    "title": "Wanted to share how a simple incident answered the most difficult question I've had my entire life.",
    "text": "Just realized what I want in life\n\nHi everyone. I am 23 M, been single all my life due to poor life choices and an unhealthy family setting but that's in the past. I've always run for stuff like it would complete me but never really knew what I actually wanted in life. \n\nTried therapy and everything and the biggest question ever lingered - What did I truly want from life? \n\nThe answer was seemed complex to me, maybe money, maybe fame, maybe attention and I ran in search of it - read books, watched videos on how to be a rizzler and some weird and embarrassing stuff then I met someone. We're not a thing atm but it made me realize what I wanted in life. \n\nThe biggest question of my life was finally answered and it was something so simple I dismissed it casually but it was Love. \n\nNever got the love from my family that I needed nor from anyone else but this girl made me realize is that I do not crave superficial stuff but love and affection and someone to call my own. The post may seem cringe to many but I'm smiling while laying in bed with this thought in bed and happy that I finally found what I lacked in life. \n\nTLDR; Guy troubled entire life, doesn't know what he wants realized he needs love.",
    "score": 81,
    "created_utc": 1745954268.0,
    "subreddit": "happy",
    "id": "1kawdl3"
  },
  {
    "title": "My weight loss was plan is going great! I feel a lot better and stable with how things are going currently! (Minus my thighs)",
    "text": "I’m going to the gym, eating less, eating healthier, watching my diet. I also am taking medication which *does* feel like cheating societally but my situation is a bit different and that’s between my care team and I 😌. Feels good to say that. I feel better. Although my legs are feeling the burn after the goblin squats (I was only using 5 lbs and still struggled!) I’ve been eating more protein, fiber, vegatables, and drinking a lot more water and it’s really helped! I’m so happy! Just wanted to share. I’m also working on my low self-confidence and separating other people’s views of me from my self-worth and that’s been going great too! I feel a lot more confident, which makes it easier to do this weight loss thing. Thank you for reading ✊. ",
    "score": 13,
    "created_utc": 1745984303.0,
    "subreddit": "happy",
    "id": "1kb74dx"
  },
  {
    "title": "Finally completed my full Transformers One lineup—all from Blokees! Couldn't be happier.",
    "text": "",
    "score": 5,
    "created_utc": 1745991881.0,
    "subreddit": "happy",
    "id": "1kb96hu"
  },
  {
    "title": "Saw this story about the human chain that formed to help move thousands of books from old store to new store",
    "text": "",
    "score": 101,
    "created_utc": 1745927069.0,
    "subreddit": "happy",
    "id": "1kalvf0"
  },
  {
    "title": "Tempering chocolate decided to kick my butt but this is the best one out of the lot",
    "text": "It was really hot in here so it was just *not* tempering, that shine though!",
    "score": 28,
    "created_utc": 1745918638.0,
    "subreddit": "happy",
    "id": "1kajptb"
  },
  {
    "title": "Don't you just feel happy knowing people are still kind",
    "text": "I just went on this subreddit and saw a lot of people who felt depressed and so many strangers were ready to be supportive and welcoming ☺️ 😁 It gives me hope that people are still kind ",
    "score": 48,
    "created_utc": 1745900077.0,
    "subreddit": "happy",
    "id": "1kaf9xa"
  },
  {
    "title": "asked my cat to show me blue cars if he was watching over me",
    "text": "",
    "score": 72,
    "created_utc": 1745887076.0,
    "subreddit": "happy",
    "id": "1kab80m"
  },
  {
    "title": "29/04/25 - Posting daily updates on what made me happy",
    "text": "* Golden Shift, first one ever! zero calls for the whole 24 hours. never happens and wow!\n* Had a nice chat on the way home with my wife while she got ready for her work. We cross over, so when I come home, she's starting work. We make time on the drive home to catch up.\n* My daughter cut bangs into her hair and it looks really good, she is growing up so much and becoming her own woman. It is so good to see. \n* My dog hasn't left my side since I've been home. I think he missed me.",
    "score": 3,
    "created_utc": 1745926958.0,
    "subreddit": "happy",
    "id": "1kalu72"
  },
  {
    "title": "An encounter with nature, I did this oil painting while trying to learn more about how colors change with the seasons, and here I try to represent the beginning of the cold, I hope you have a good week! :)",
    "text": "",
    "score": 176,
    "created_utc": 1745846054.0,
    "subreddit": "happy",
    "id": "1k9v8xz"
  },
  {
    "title": "Hooray!! I'm not struggling alone anymore!!",
    "text": "After almost five years of unemployment, my fiance has finally managed to get hired! And moreover it's a job that they'll love, with great people and work that they are interested in. I no longer have to stress about food or bills or oil. I'm both elated and relieved! And super proud of them!\n\nI won't have to consider subsidized housing or feeling so worried all the time. It's just...something to be thankful for.",
    "score": 55,
    "created_utc": 1745859020.0,
    "subreddit": "happy",
    "id": "1ka0cim"
  },
  {
    "title": "I finally have a Green Thumb!! I love my peace lily ❤️",
    "text": "Since I was younger any house plant given to me has unfortunately succumbed to my house, and inadvertent black thumb. But since March I've been able to take care of this beautiful peace lily. I have been trimming back what has been necessary and not over watering. I've been doing my research this time and trying my best and it's been working. It's making me want to take in another beautiful lily. \nBy the way my husband and I named it \"Yarp\" the humor has allowed for my girls to notice when it needs water. I hope that you all are given a great day seeing my lovely lily. ",
    "score": 62,
    "created_utc": 1745850803.0,
    "subreddit": "happy",
    "id": "1k9x0nl"
  },
  {
    "title": "I just graduated from am intensive jewelry design course last week! I'm 36, starting over and finally living my dream in the woods, making art, and I'm so excited for the future!",
    "text": "",
    "score": 767,
    "created_utc": 1745771853.0,
    "subreddit": "happy",
    "id": "1k987bh"
  },
  {
    "title": "28/04/25 - Posting daily updates on what made me happy",
    "text": "* Aldi finally had the choc peppermint crowns in stock! On shift we split everything 4 ways. So for a Crown it costs us 93c each... How do they do it? ninety three cents! Choc Peppermint! So good. real dairy. \n* I made homemade burgers and another team mate made home made wedges. It was so good. Great dinner, great dessert, 93c.... Whole dinner was $9 each. including the Crowns!\n* So far, no calls, nada, nothing. I have been able to get some tasks out of the way. Another team mate worked through some tests, It was a nice time to focus on other things.\n* My wife called me to see how it was going. It is always great to hear from her and her voice makes me so happy.",
    "score": 3,
    "created_utc": 1745837522.0,
    "subreddit": "happy",
    "id": "1k9slo2"
  },
  {
    "title": "Started working out again and hit my furthest run as of yet!",
    "text": "2 miles 😎😎 It took me 44:29 minutes:seconds so it's not necessarily the fastest, but damn do I feel good. ",
    "score": 42,
    "created_utc": 1745778892.0,
    "subreddit": "happy",
    "id": "1k9azry"
  },
  {
    "title": "I just renewed my lease at the same price!",
    "text": "This might seem trivial to some, but I’ve been living solo for 8 years now. After 7 years living about 40 minutes northwest of DC, I moved closer to DC last March (paying a hefty increase in rent to do so). I was nervous, and to be honest, kind of dreading the renewal. How much would my apartment complex increase my rent by? I just signed a 13-month renewal lease for the exact same monthly rent price! The previous complex I lived in ALWAYS increased my rent, every single time I re-signed. I’m so grateful to have found this complex last year (that’s better in multiple ways) and am happy to be calling it home for another year at the same price!",
    "score": 46,
    "created_utc": 1745771152.0,
    "subreddit": "happy",
    "id": "1k97xsa"
  },
  {
    "title": "Found out we're having a boy, bathtub at the perfect temperature and a nice glass of whiskey hitting just right after dinner",
    "text": "Life is good.\n\n(Came into this wanting a daughter, and still do for our second, but any notion of preference melted away as soon as I found out about our boy)",
    "score": 31,
    "created_utc": 1745740844.0,
    "subreddit": "happy",
    "id": "1k8ys1z"
  },
  {
    "title": "I GOT AN A ON MY COLLEGE STATISTICS EXAM!!!",
    "text": "",
    "score": 222,
    "created_utc": 1745695995.0,
    "subreddit": "happy",
    "id": "1k8l641"
  },
  {
    "title": "I got into my Colleges Honors Program!!!",
    "text": "A while ago I threw the idea around with applying to the honors program in my collage. I didn’t think much of it but then I thought it couldn’t hurt. After I applied my wanting to be in the program grew really strong! I talked to my friend about it and they weren’t very supportive about it. She told me that it’s really hard to get in and to get in and to get a scholarship is even harder. It didn’t seem very supportive and I felt really down. But just the other day I learned and I got it! And plus I got a scholarship!! So suck it old friend! I just wish she was more supportive about it and believed in me more. It really hurt that she talked to me that way. Ig I’m mainly venting but I’m super pumped I got in and got a scholarship. It’s making me super happy and I wanted to share!",
    "score": 37,
    "created_utc": 1745727896.0,
    "subreddit": "happy",
    "id": "1k8vm1j"
  },
  {
    "title": "27/04/25 - Posting daily updates on what made me happy",
    "text": "- Got a night in bed and a call came in just after our relieving shift came in. So we got a bit of an early mark.\n- My son won his soccer match and was super proud of him and his team. 6-2. \n- I walked my very excited dog, he saw my daughter and her friends as we were leaving the house and he got the zoomies. He has been very cuddly all day too.\n- I received a really nice message from a friend today letting me know how much I've helped them over the past month. It was unexpected and really lovely. There is real friendship there and I really love having close friends and makeing them feel happy and loved. ",
    "score": 6,
    "created_utc": 1745753406.0,
    "subreddit": "happy",
    "id": "1k91tsz"
  },
  {
    "title": "365 days free of smoking. I never thought I could do it, but here we are!!Sharing a happy face",
    "text": "",
    "score": 1284,
    "created_utc": 1745647828.0,
    "subreddit": "happy",
    "id": "1k867le"
  },
  {
    "title": "Today I deadlifted 100kgs for the first time in my life, have been consistent to gym for 50 days now, attempted deadlift for the first time today.",
    "text": "Today I deadlifted 100kgs for the first time in my life.\n\nThis made me happy, I impressed myself after a long time. That's it :) \n\nFelt like sharing here, it may not be that impressive to you when you know my bw is 85kg and I am 6'1.  But nevertheless a W is a W. ",
    "score": 96,
    "created_utc": 1745697592.0,
    "subreddit": "happy",
    "id": "1k8lr6b"
  },
  {
    "title": "We adopted a new rescue pup :)! She is the sweetest.",
    "text": "Her name is Winnie, short for Winndixie. She is a rescue, and was clearly treated very poorly by state of her– matted fur, very underweight, anxious and doesn’t like to be alone, untrained.\nShe is very happy now, and so silly! She follows us around wherever we go. I’m so glad she’s already so comfortable with us, and I want to give her the best life that I am able.\nWe got her because I am struggling with my mental health, and she is already helping me take better care of myself as I take care of her.",
    "score": 154,
    "created_utc": 1745656374.0,
    "subreddit": "happy",
    "id": "1k889zn"
  },
  {
    "title": "The best groom wedding speech of all time? Does this give you goosebumps? So incredible.",
    "text": "https://youtu.be/27WufdasQYs?si=PI_Jg15k9uElLKDD\n\nSinger is from a relatively famous old band called McFly. I love this - hope others enjoy it. ",
    "score": 4,
    "created_utc": 1745716204.0,
    "subreddit": "happy",
    "id": "1k8s5rx"
  },
  {
    "title": "Experienced a really special moment yesterday. People can be awesome sometimes.",
    "text": "My 80 year old grandmother got her degree yesterday at BYU, along with my mother who got her Phd. She was the last to \"walk\", even though she was in a wheelchair that was pushed by my mother. It was the last thing on my Gmas bucket list before she died, since she was only one class away from graduating.\n\nAt the beginning they had asked the audience to hold their applause so that everyone could hear the names that were being called. But when my grandmother had her name called everyone in the stadium clapped and cheered for her. At first I thought it was just because she was last but it became clear that everyone was cheering for her. Me and my sister were sitting together and we just looked at each other with tears in our eyes. Just a really special moment.",
    "score": 168,
    "created_utc": 1745639664.0,
    "subreddit": "happy",
    "id": "1k8416b"
  },
  {
    "title": "ONE YEAR ALCOHOL FREE ❣️ I haven't felt this good since I was 17, and also living alone is a magical privilege.",
    "text": "In addition to feeling AMAZING, like increasingly and exponentially better all the time, I also want to share this picture...this is such a beautiful representation of what living alone means to me.\n\nThis is a publix bakery red velvet cake. I have eaten off of it three times already. I can take it out of the fridge, take bites until I'm done, and put it right back in 🥹 FREEDOM.\n\nAnd yeah, if you're considering quitting the boozey life - I cannot recommend it enough. By FAR the best decision I have ever made.",
    "score": 868,
    "created_utc": 1745596178.0,
    "subreddit": "happy",
    "id": "1k7oa39"
  },
  {
    "title": "We celebrated her birthday and I'm ugly crying now",
    "text": "She’s fast asleep right now. We went out to celebrate her birthday the way she wanted - with lots of seafood. I’m looking at her while she’s sleeping and I can’t help but think how lucky I am to have her. I want to be with her for as long as I live. I hope we live long enough to fulfill our dreams together. Happy birthday my lovey! Sleep tight there.",
    "score": 159,
    "created_utc": 1745598767.0,
    "subreddit": "happy",
    "id": "1k7pbvg"
  },
  {
    "title": "26/04/25 - Posting daily updates on what made me happy",
    "text": "* Back at working in the best job in the world. Had an easy day (so far, still have the 11:00pm - 7:00am to go) with only a few calls.\n* The Station Officer's wife made ANZAC biscuits, so yummy, we smashed them!\n* I took a selfie while in the back of the truck while waiting for the guys to get their lunch and I got a few compliments from my mates in chat.\n* While doing our cook up, one of my crew was watching a cooking video and the host was making really funny and suggestive moan noises that had us laughing almost uncontrollably.\n* A friend of mine let me know she got 3rd in a singing audition, she was very excited and proud and I am proud of her and happy for her too.",
    "score": 3,
    "created_utc": 1745672014.0,
    "subreddit": "happy",
    "id": "1k8c9oj"
  },
  {
    "title": "04/25/25 Thankful for today! and I want this to be remembered",
    "text": "This is my first post in reddit and I want it to be something meaningful? I think? I mean I am just so thankful for this day and I want to look back on this post someday. Sooo many things happened today and I am very very very thankful. Thank you so so so much! I just want to feel this kind of happiness in the future when I go back here. 🫶🏼",
    "score": 24,
    "created_utc": 1745594821.0,
    "subreddit": "happy",
    "id": "1k7nqlx"
  },
  {
    "title": "TODAY IS MY BIRTHDAY AND I’VE NEVER FELT MORE HAPPIER!",
    "text": "Hi all!! It's my birthday today and l've officially hit 2 decades (20). I usually feel massive birthday blues in the week approaching my birthday but today I FEEL SO HAPPY. So far, 5 people have wished me happy birthday today and if this was high school me, i'd probably freak and start crying but I feel so joyful rn that I don't even care if anyone forgets its my birthday today. I bought a chocolate cake and a I will be ordering thai food later. I can't wait to eat it all!! Thats all I wanted to say :)",
    "score": 194,
    "created_utc": 1745526353.0,
    "subreddit": "happy",
    "id": "1k72gqd"
  },
  {
    "title": "Reddit has helped my depression so many times just by existing.",
    "text": "My loneliness can get the best of me but that feeling when I post and then start to have dialogue with another Redditor makes me feel so alive and human in a way that makes my heart leap. I feel seen and connected. I’m so thankful for this massive community of humans connecting with humans in ways that matter to one another about topics we enjoy. There’s really nothing like Reddit. And I’m thankful to the kind souls who reply to comments and say one things or write great advice or encourage you when you’re down. There are a lot of beautiful humans in the world and Reddit lets me find some of them—often at times I’ve needed it the most. ",
    "score": 44,
    "created_utc": 1745553888.0,
    "subreddit": "happy",
    "id": "1k7bxnf"
  },
  {
    "title": "25/04/25 - Posting daily updates on what made me happy",
    "text": "- there was such a large turnout to the dawn service this morning to respect our fallen heroes on ANZAC Day. I'm a very proud Australian and I'm so happy that our local community, young and old, came to show their respects. Lest We Forget.\n- I had a breakfast with my old firefighting crew after the dawn service. It was ice catching up with them and seeing what they're up to.\n- My gorgeous wife and I went out to grab a cheeky acai on a cheeky acai date. It was nice spending time with her on a nice sunny day. A couple sat next to us and we had a little chat about their speciality made ANZAC biscuit/ custard creations. ",
    "score": 14,
    "created_utc": 1745570689.0,
    "subreddit": "happy",
    "id": "1k7g45f"
  },
  {
    "title": "24/04/25 - Posting daily updates on what made me happy",
    "text": "- Started the day by having a nice breakfast overlooking the river with my beautiful wife and a good friend. We had a great catch up and spoke about his next plans. It was a great start to the day.\n- We had a long drive home by it was really nice and easy going. A little traffic, but really nice drivers too.\n- came home to a very excited puppy. He hasn't left my side since I got home! I'm currently watching Jurassic World over the top of his head! I love this guy so much!! ",
    "score": 111,
    "created_utc": 1745491619.0,
    "subreddit": "happy",
    "id": "1k6p4wu"
  },
  {
    "title": "I'm so happy I finally made the call to resign my job",
    "text": "The leaders were absent, living in their own bubble, and I've had too much work to do for too long. This was due to many new employees that were replacing the good colleagues I once had. The good work environment we once had was gone. \n\nAfter I resigned I'm so, so relieved. I feel physically better, my tension in neck and shoulders are almost gone, and I'm mentally much more at ease.\n\nMy new job pays less, but enough. Health and family time is more important. Many of my old colleagues that I loved working with is in the same, new company where I'm starting. ",
    "score": 91,
    "created_utc": 1745488862.0,
    "subreddit": "happy",
    "id": "1k6ofyy"
  },
  {
    "title": "Just me enjoying a rainy day in a small town in Brazil. Even with the renovation going on, I think it still has its charm.",
    "text": "",
    "score": 22,
    "created_utc": 1745508744.0,
    "subreddit": "happy",
    "id": "1k6v693"
  },
  {
    "title": "It may only be my 19th Cake Day on Reddit, but happy that I’ve been around to see all the good things in this group:)",
    "text": "I’m getting old. ",
    "score": 90,
    "created_utc": 1745461509.0,
    "subreddit": "happy",
    "id": "1k6ha1x"
  },
  {
    "title": "It doesn’t cost anything to just be friendly.",
    "text": "I had a really long day and almost went home with a really bad stomach ache and couldn’t focus on work stuff. I had to get a stamp to mail a prescription to Chewy for my dog, but I really didn’t wanna go & wanted to rot on the couch. But the employee at USPS was like oh I love Chewy after he saw where I was mailing it too and he showed me a picture of his cute kitty lol & then we started talking about pets and it just put me in a better mood. I got in my car and just smiled the way home after being in such a depressed mood. It’s the little things. ",
    "score": 77,
    "created_utc": 1745448244.0,
    "subreddit": "happy",
    "id": "1k6cp7o"
  },
  {
    "title": "Hollow to happy - I once wished for overwhelming days like this",
    "text": "Wanted to take a moment to appreciate my happy annoyance and overstimulation.\n\nI had a really *really* long and tiring day today, filled with cooking for fun for me and my lil cousin (stuff that many people in the family stole bites from and appreciated!), getting exasperated with doing technical stuff like filling in attendance and marksheets for SO MANY students for my mother, finishing my remote work and talking to clients, going to an exercise class, being irritated but spending time selecting pictures with care and sending my friend fashion inspo tips and reels, so on, so on.\n\nAnd I sat down, sighing like a character does in movies, who finally gets rest after a whole day of chaos. I saw the time at 3 pm, realised only less than half the day had passed, and it is just the afternoon. I had an epiphany - you do get what you prayed for.\n\nFrom days that went by too fast and were too short because I'd either wake up late due to depression and anxiety and sleep through my troubles, or days where I'd simply finish them by watching the same five shows under my blanket with no outside interaction. Days when men I dated or friends who were too busy caused me anxiety or heartbreak, or disgust. Days back, when I attached self-worth to the little downvotes on random Reddit comments. None of this matters tbh now.\n\nNow, (again), I finally have people to fuss over, work to do, so many plans that I have the privilege to cancel, unread messages to return in an overflowing inbox of relationships I've cultivated with love and happy migraines to get. This is what heaven feels like and damn it took years to get. I have no plans of letting it go. Ever.",
    "score": 9,
    "created_utc": 1745487655.0,
    "subreddit": "happy",
    "id": "1k6o5ps"
  },
  {
    "title": "I Found a Hibiscus Flower After Years of Drawing Them",
    "text": "So happy ",
    "score": 77,
    "created_utc": 1745440574.0,
    "subreddit": "happy",
    "id": "1k69ofo"
  },
  {
    "title": "I had my Graduation Commencement Ceremony today & thankfully my shoe decided to break apart afterwards. I am delighted 🙏🏼",
    "text": "",
    "score": 139,
    "created_utc": 1745422355.0,
    "subreddit": "happy",
    "id": "1k624l7"
  },
  {
    "title": "A small shoutout to a stranger who came into my life from nowhere and helped me feel like me again",
    "text": "Just a bit of context, I’ve struggled with my weight, bloating, and just feeling *off* for years. I’d try strict diets, detoxes, and crazy workouts, and every time I ended up tired, hungry, and frustrated. I spent hours and hours online just to find some solutions, but they never worked, or, probably, I overdid them.\n\nHowever, one day, just scrolling through Instagram and I found Tanvi Parikh and her page.  \nShe is a fitness and mindset coach, but her approach was different, no guilt, no extremes, just small, realistic changes. She helped me understand my body, build better habits, and finally ditch the all-or-nothing mindset.\n\nFor the first time in ages, I feel like *me* again.  \nI have more energy. I’m not bloated all the time. I actually enjoy moving my body. And I don’t hate what I see in the mirror anymore.\n\nIt might seem like a small thing, but it’s brought me so much joy.  \n  \nIf you are in the same boat, do not give up; better and happier days are coming.\n\nThank you, Tanvi Parikh, you are a lifesaver!",
    "score": 74,
    "created_utc": 1745435064.0,
    "subreddit": "happy",
    "id": "1k67fk0"
  },
  {
    "title": "Depression cleaning funk before and after🩷",
    "text": "",
    "score": 822,
    "created_utc": 1745364059.0,
    "subreddit": "happy",
    "id": "1k5knjk"
  },
  {
    "title": "It just feels like a happy day to be able to run",
    "text": "",
    "score": 29,
    "created_utc": 1745417601.0,
    "subreddit": "happy",
    "id": "1k607g4"
  },
  {
    "title": "23/04/25 - Posting daily updates on what made me happy",
    "text": "* I started the day by sitting on the back porch watching and listening to the rain while I was sipping a great tasting espresso coffee\n* My father in-law made pancakes for everyone and we all sat around eating pancakes and chatting about our plans for the day.\n* We all went out to lunch at the holiday park my daughter is going to (in a few days)  with her friends. This is her first holiday with friends and it is a big step and I am really happy she organised it.\n* I wanted a milkshake. I got a milkshake. It was everything I wanted it to be. Chocolate, milky, frothy goodness. Man, I love a good milkshake.",
    "score": 12,
    "created_utc": 1745403798.0,
    "subreddit": "happy",
    "id": "1k5vpus"
  },
  {
    "title": "I am happy today! I figured I would let you guys know…",
    "text": "",
    "score": 53,
    "created_utc": 1745358387.0,
    "subreddit": "happy",
    "id": "1k5ijjj"
  },
  {
    "title": "just a glimpse into the world i find myself in every day due to my joy",
    "text": "",
    "score": 137,
    "created_utc": 1745338798.0,
    "subreddit": "happy",
    "id": "1k5afkk"
  },
  {
    "title": "When you meet new friends at the pet store!",
    "text": "",
    "score": 141,
    "created_utc": 1745330593.0,
    "subreddit": "happy",
    "id": "1k573cv"
  },
  {
    "title": "<The Gap Between> by Pomnyun Sunim, thank you bros i wish you would be happy today",
    "text": "There is always a gap between  \nwho you want to be and who you are.  \nThe bigger the gap,  \nthe harder you will be on yourself.  \nYou are nothing special  \nbut are like the grass along the roadside.  \nYou will find peace when you realize  \nyou are just one among all the beings in the world.",
    "score": 5,
    "created_utc": 1745392425.0,
    "subreddit": "happy",
    "id": "1k5t2zg"
  },
  {
    "title": "I'm currently about 13weeks into growing a baby with this man. And the cuddles are ESSENTIAL to my survival.",
    "text": "(By the vibes from this particular cuddle session I think it's essential for him too)",
    "score": 550,
    "created_utc": 1745290252.0,
    "subreddit": "happy",
    "id": "1k4vzx0"
  },
  {
    "title": "No little kitty better never try and break his heart. 😏🐾",
    "text": "",
    "score": 18,
    "created_utc": 1745331767.0,
    "subreddit": "happy",
    "id": "1k57k24"
  },
  {
    "title": "I’m so happy",
    "text": "I just recently sold my Xbox and ps5 bc I was playing on it 24/7 and I was getting unhealthy but after I sold it I got a bearded dragon and have been going to the gym everyday and I’m unbelievably happy ",
    "score": 5,
    "created_utc": 1745348094.0,
    "subreddit": "happy",
    "id": "1k5ebt6"
  },
  {
    "title": "One of the moments when I knew I found \"the one\"",
    "text": "About a year ago, me and my girlfriend visited her parents during easter. Everything was going well until the last day, I accidently clogged the toilet.\n\nI tried to fix it but couldn't. Sitting there not knowing what to do, I realised that the battle was lost, so I discreetly called for my girlfriend.\n\nShe came in to the bathroom, I looked her dead in the eyes and said:\n\n\"What wasn't supposed to happen, happened\" while pointing my finger at the toilet.\n\nShe looked at it, started to laugh and said:\n\n\"Finally it wasn't me who did it\".",
    "score": 147,
    "created_utc": 1745276019.0,
    "subreddit": "happy",
    "id": "1k4r5mk"
  },
  {
    "title": "22/04/25 - posting daily updates on what made me happy",
    "text": "* Bought a new (used) car today for a really good price. It's got a big big sunroof, electric this, powered that and has heaps of boot space, my ute didn't have any boot space so this car will come in handy!\n* Played Mahjong for the first time and really enjoyed it, I like how it is a number of different games depending on the initial tile. Had a great time, learning curve wasn't as long as I thought and we just went with it.\n* My mate who we haven't seen in about a year came over with treats! He used to stay with us when he was training with the police and  he would always give my son a pack of tim tams as payment for taking his room when he came over. So he said that he is now 2 weeks in advance and gave my sone two packs of tim tams and a bunch of other treats for the family. We caught up and loosely planned to catch up again tomorrow.",
    "score": 11,
    "created_utc": 1745322187.0,
    "subreddit": "happy",
    "id": "1k547as"
  },
  {
    "title": "Tibetan girl with her goats. Pure happiness",
    "text": "",
    "score": 201,
    "created_utc": 1745238987.0,
    "subreddit": "happy",
    "id": "1k4cfwo"
  },
  {
    "title": "I'm finally an adult! I'm so happy 🥳🥳🥳🥳🥳",
    "text": "Late post but I think I look pretty in this. I love the purple and pink combo 💜🩷. I love the background, nature is so peaceful. And I love how my friends and family attended. Love them 🥰",
    "score": 121,
    "created_utc": 1745248164.0,
    "subreddit": "happy",
    "id": "1k4fvvo"
  },
  {
    "title": "I went to the shop and felt happy I could buy anything I wanted. When I left the shop I saw a swan and felt happy again.",
    "text": "Every day is a bliss. \n\nThere are so many beautiful things around us, we just have to notice them and enjoy life to the fullest.",
    "score": 26,
    "created_utc": 1745248916.0,
    "subreddit": "happy",
    "id": "1k4g6w4"
  },
  {
    "title": "21/04/25 - Posting daily updates on what made me happy",
    "text": "- Road trip! We took the family for a drive down the coast. My daughter was excited about driving us a lot of the way. She did such a great job. Lots of traffic and she really was a great driver.\n- We stopped for lunch and saw so many cute puppies, so many. It was so great seeing everyone with their pups walking around a country town. \n- We played card games with the family and my in-laws, lots of laughs were had! I really enjoyed myself. We all did. So much fun. ",
    "score": 5,
    "created_utc": 1745274861.0,
    "subreddit": "happy",
    "id": "1k4qqe6"
  },
  {
    "title": "I was raised by these three amazing women and I’m so happy every time we get to spend the holidays together",
    "text": "(Grandma, aunt and mum, plus our girl dog Comet who is part of the next generation of the family ) ",
    "score": 1101,
    "created_utc": 1745154634.0,
    "subreddit": "happy",
    "id": "1k3m7uh"
  },
  {
    "title": "I feel happy in this world as I can be in the right body and feel comfortable with myself without having to conform to others.",
    "text": "",
    "score": 7,
    "created_utc": 1745255380.0,
    "subreddit": "happy",
    "id": "1k4iqac"
  },
  {
    "title": "I saw a rare bass once and fell in love, so my partner tracked one down and drove half a day to get it for me!",
    "text": "We're in the UK where driving half a day on your day off is considered a LOT of driving! \n\nI'm an ex-gigging guitarist who got super burned out and hasn't done anything musical in a while. I recently got into bass and it's rekindled a passion so I've been playing a cheapo bass a lot! Last year I'd seen a band use a Daisy Rock bass and I fell in love with how unique it was. They're no longer manufactured and the bass counterparts were always rarer than the guitars, but my partner managed to find one and go get it for me! It was meant to be a birthday present but he couldn't resist giving me it early. Feeling very special and loved, and having lots of fun! ",
    "score": 322,
    "created_utc": 1745166446.0,
    "subreddit": "happy",
    "id": "1k3qdsg"
  },
  {
    "title": "Finally cut my hair after years of growth",
    "text": "!!!Here are my before and after pics!!!I was so terrified!! but I’m so happy I did it! Feels good! I just had keep reminding my self that hair will always grow back! ",
    "score": 75,
    "created_utc": 1745192321.0,
    "subreddit": "happy",
    "id": "1k3zolc"
  },
  {
    "title": "I'm so happy my quails hatched on Easter Sunday!",
    "text": "I made a live stream so people can watch my chicks and soak up the cuteness. Quail chicks are definitely a source of guaranteed happiness!\nhttps://www.youtube.com/live/VUxgUKM3OQI?feature=shared",
    "score": 49,
    "created_utc": 1745181717.0,
    "subreddit": "happy",
    "id": "1k3w0jn"
  },
  {
    "title": "I got called cute today and it's made my day!!",
    "text": "I've just got home from work a few hours ago and when I went to check my phone, I noticed i got a message on reddit and when I looked at the message it was from a guy and he told me I looked cute! (I'm guessing he saw a pic of me) It's really made my day! It's the fact he took the time to go on my profile and feel the need to DM me that which makes it feel special ☺️ I'm a guy also, so it's nice to get a compliment from another guy 🥹\n\nThat's all I wanted to share :)",
    "score": 33,
    "created_utc": 1745175250.0,
    "subreddit": "happy",
    "id": "1k3tp3w"
  },
  {
    "title": "Built a knock off lego camera I got for Easter and had a lot of fun working on it",
    "text": "",
    "score": 26,
    "created_utc": 1745167381.0,
    "subreddit": "happy",
    "id": "1k3qq7s"
  },
  {
    "title": "I’m not a happy person, but I find moments of joy in realistic painting—especially near the end, when a spark of happiness hits me.",
    "text": "",
    "score": 93,
    "created_utc": 1745100946.0,
    "subreddit": "happy",
    "id": "1k37swl"
  },
  {
    "title": "I think I am finally happy, I just experienced such a sudden but impactful change in my life",
    "text": "I wouldn't say I felt unhappy, but for a long time I felt a lack of motivation and a lack of meaning in life, like I was an incomplete person who did well enough but knew there was room for improvement. I decided recently to do something about it and just wanted to see if there was anyone who had similar feelings about life who could be with me on my journey, like a close accountability partner, I tend to do better when I have someone like that I can confide in. I made a simple post just talking about the kind of person I am like my faults, and what I desire in someone. I was expecting harsh criticism, sly remarks, and I did certainly get it from people, since the idea of anyone wanting a feeling of love in their life seems to tick people off and make them say the worst online, but to my absolute surprise someone came to me and offered. I mean it has not been that long at all but just the gesture made me feel special, and she has already been so much more comfortable for me to talk to than a lot of other people, I genuinely feel like I can relax around her and we can just enjoy talking and getting to know eachother, it is a truly amazing feeling. I want to be a better person just because she is in my life now, and just the thought of her throughout my day makes me make better choices, I just am really satisfied with life right now. Just meeting the right person flipped a switch in me to want to change. I am truly grateful to her and while I feel like I don't know the right things to say (most of the time) or I am awkward, I feel like she doesn't have a problem with that and understands. I fear I scare people away because of how attached I can feel, but I feel like it is mutual this time around. I don't know a lot about her yet but I think that feeling of walking into the unknown is exciting, putting my trust into someone and not doubting at all, and I want to get to know more about her day by day like uncovering a mystery. I think this may be the most i've ever been effected by a person in such a short amount of time, it's exhilarating for me. Words fail to express the happiness I feel right now, how content I am with the way things are. Anyways.. Just needed that off my chest, I obviously cannot send a 40 page document to her describing every facit of emotion I am feeling, but I figured others may benefit from this and it may be a motivation to them to brighten their day \\^-\\^",
    "score": 23,
    "created_utc": 1745127382.0,
    "subreddit": "happy",
    "id": "1k3fkiv"
  },
  {
    "title": "20/04/25 - Posting daily updates on what made me happy",
    "text": "- it's Easter, chocolate eggs for breakfast! \n- My daughter and I went to a nice drive, we went and got acai. The guys know her order and asked her if when she gets her licence will she still come back! Of course. They play loud dance music and we always have a good time there. \n- My beautiful wife and I were watching Chicago Fire as we started watching it as a joke and then we got hooked and invested. Anyway, two episodes in a row where someone dies and then the next someone gets trapped. I had a good friend and fellow firefighter die by a building collapse and it hit really hard. Watching this brought up memories, my wife, without hesitation asks is we should stop the show, skip it, just looking out for me. I love her so much. Little acts like that make me so happy and lucky. ",
    "score": 6,
    "created_utc": 1745146333.0,
    "subreddit": "happy",
    "id": "1k3jxyz"
  },
  {
    "title": "I am happy that the company sent me new bottles. I ordered some hair products online. When I opened the package, the pumps didn't fit the bottles. I called the company to request new pumps. They are sending me new bottles of the products instead.",
    "text": "",
    "score": 11,
    "created_utc": 1745133343.0,
    "subreddit": "happy",
    "id": "1k3h18f"
  },
  {
    "title": "19/04/25 - Posting daily updates on what made me happy",
    "text": "- My mother outlaw ordered some stuff from near us (she lives a 5h drive away and we are seeing them in a few days) and my wife and I picked it up, it was a beautiful day and we just chatted the whole trip. \n- We then turned that into a lunch trip and we kept chatting through lunch, like we have still got so much to talk about, even after an these years\n- Web then bought some new bedding. That ended up being discounted by 60% which was great! My wife is happy, I'm am happy!\n- I finished off the website I've been working on for a long long time. I just knuckled down and got it done. This got me back. I'm going to do a lot more of this.",
    "score": 13,
    "created_utc": 1745098044.0,
    "subreddit": "happy",
    "id": "1k36ss4"
  },
  {
    "title": "Guess what?! I GOT ACCEPTED INTO GRAD SCHOOL!!!",
    "text": "",
    "score": 846,
    "created_utc": 1745013922.0,
    "subreddit": "happy",
    "id": "1k2gz4m"
  },
  {
    "title": "After a 5 year wait, I finally went to the new Universal park today!",
    "text": "As an Orlando resident, I have closely and excitedly been watching the progress of this park since they put the stake in the ground to begin construction in 2019. \nAs an even bigger Nintendo nerd, I can say that I teared up when I stepped foot into Nintendo Land and heard Gusty Garden Galaxy playing. I face-timed my friends in nearly a panic to show them how far my jaw was on the ground. \nI can’t describe how grateful I am. Today was such a special day, and the best part is I have another amazing opportunity to go again tomorrow, I missed out on a few rides today and I’m gonna try and knock them off my list tomorrow.\n",
    "score": 86,
    "created_utc": 1745033329.0,
    "subreddit": "happy",
    "id": "1k2n51v"
  },
  {
    "title": "18/04/25 - Posting daily updates on what made me happy",
    "text": "- I had a juicy pump in my legs after hitting the gym. I haven't been able to train legs too often due to knees playing up, but since I have had this knee lubricant injected in there, in have been able get back at it. \n- A friend opened up about what was bothering them, I was able to help a bit, it was nice that they would trust me with helping them\n- My daughter organised to have some friends come over for dinner, I ended up making dinner for 8 and it was so good. I love s full house of happy people, my daughter's friends are all really nice and talked to my wife and me as well, which is something I really appreciate. \n- I belly laughed while watching Austin Powers, Goldmember, I haven't seen that movie in so long and it is funny how many references I still mole from it.",
    "score": 17,
    "created_utc": 1745008563.0,
    "subreddit": "happy",
    "id": "1k2eyqx"
  },
  {
    "title": "I experienced a random act of kindness today at McDonald’s ☺️😎",
    "text": " \nSo, cool thing happened after I got off of work today. I went through the drive thru of McDonald’s to get something to eat and I noticed that the car in front of me didn’t stop to order something at the intercom, he just skipped it and went to the paying window. I thought it was odd but decided to just forget about it. I ordered my food through the intercom and when I got to the paying window it turns out the person in the car in front of me paid for my food. I really didn’t expect that to happen, I told the employee that I would still like to pay for my food because it just felt wrong not to. The employee talked to the manager to see what they would do and said that If I wanted to I could pay for the person behind me in line. I agreed to it. As I got to the window to receive my food I noticed in my side mirror the people behind me thanking me, I waved back at them. It was a nice experience but I only wish that I got to say thank you to the individual who paid for my order. ☺️",
    "score": 115,
    "created_utc": 1744926758.0,
    "subreddit": "happy",
    "id": "1k1osas"
  },
  {
    "title": "I remember losing so many footballs as a kid by kicking them into neighbours gardens and they were never returned. I hope I made a little boy/girls day today.",
    "text": "",
    "score": 44,
    "created_utc": 1744906211.0,
    "subreddit": "happy",
    "id": "1k1gm6d"
  },
  {
    "title": "Two things that made me happy today , free massage chair access and ability to eat more food",
    "text": "1. I have free access to this massage chair at office and I get paid well at this tech job.\n\n2. GPT told me that I can eat 900 more calories if i workout, I am a huge foodie, this means a lot to me.",
    "score": 31,
    "created_utc": 1744902228.0,
    "subreddit": "happy",
    "id": "1k1f0gb"
  },
  {
    "title": "It’s a have fun and enjoy the beauty type of day",
    "text": "",
    "score": 34,
    "created_utc": 1744895696.0,
    "subreddit": "happy",
    "id": "1k1ci1h"
  },
  {
    "title": "Sharing some positive mental changes I’ve been making against my ocd.",
    "text": "\nA lot of positive stuff has happened lately. I’m settling into my new job that has a more fixed schedule, I’m learning to avoid the compulsions of changing my name, gender and pronouns all the time and just focusing on what feels authentic to me. I’m settling on the best options possible for me, not the perfect one. I’m settling on a fursona for the first time in 8 years and not compulsively making another one because the one I made isn’t “perfect”. I’m settling with this account and not compulsively making another one because it isn’t “perfect”. Im learning to accept that I’m mostly attracted to men and not forcing myself to like women. I’m learning to avoid the urge to compulsively purge my discord servers and join them again one week after I leave. I’m following a healthy diet and getting in exercise. I’m finding hobbies that bring fulfillment and slowly getting over asking for assurance from AI and the internet. Most importantly I feel motivated to better myself. And I’m going up in my Luvox dose. ",
    "score": 14,
    "created_utc": 1744909624.0,
    "subreddit": "happy",
    "id": "1k1i082"
  },
  {
    "title": "TODAY IS MY FIRST CAKE DAY IVE CELEBRATED ON REDDIT !! 🍰🍰",
    "text": "Which is ironically 4 days before my actual bday !! 🎂🧁🧁🍰\n\nWOOO🥳🥳🥳 ",
    "score": 99,
    "created_utc": 1744860212.0,
    "subreddit": "happy",
    "id": "1k1380q"
  },
  {
    "title": "17/04/25 - Posting daily updates on what made me happy",
    "text": "* I went to the doctors in the morning to get my blood pressure checked and  it is going down which is great! I let my wife know and we decided to have one blowout day today and focus on healthy eating from tomorrow onwards, since we're both on board, it is going to make it easier.\n* Now the blow out day!! We went to the Royal Easter Show with the family. man it was so much fun, we did so much, I really liked the Poultry, the chickens, ducks and geese were so cool. I patted a few giant geese on their heads and necks. I also scratched a few chickens.\n* One of the geese honked at my daughter really loud and she screamed, we all laughed. So much fun.\n* We saw sheep with massive bollocks! MASSIVE!! The whole crowd was commenting on them and it made me giggle.\n* My son played the duck shooting game and got 4 out of 4 twice. What a crack shot! He was really happy with that, so was I. It was very impressive. \n* My daughter and her boyfriend went on some crazy rides and screamed the whole time, so funny!\n* We bought a bunch of show bags and left before the crowds got busy on the way out. Was just a really fun day in general, I love days like this! ",
    "score": 13,
    "created_utc": 1744891475.0,
    "subreddit": "happy",
    "id": "1k1b3d4"
  },
  {
    "title": "I found my first ever four-leaf clover while travelling to Taiwan!",
    "text": "",
    "score": 658,
    "created_utc": 1744803708.0,
    "subreddit": "happy",
    "id": "1k0ib10"
  },
  {
    "title": "Got in touch with old friends today, can't stop smiling!",
    "text": "Today, after searching for 43 years, I finally got in touch with the best friend of my youth, Patti, and she and I talked for over an hour! It was like we never lost track of each other.\n\nThen I called our old teacher to get another classmate, John's, number, so I could tell the classmate I'd found Patti. I hadn't spoken to my teacher in seven or eight years, so that was really cool, too. And I left John a voicemail and will, knowing him, get a call within the next few hours. :)\n\nJohn and I have searched high and low for Patti. This is just a WONDERFUL day!",
    "score": 62,
    "created_utc": 1744830480.0,
    "subreddit": "happy",
    "id": "1k0smf7"
  },
  {
    "title": "What started as a hole in the wall had evolved into a continuous project. Each photo is from a new day I really hope this stays 😂",
    "text": "",
    "score": 306,
    "created_utc": 1744770051.0,
    "subreddit": "happy",
    "id": "1k09nlc"
  },
  {
    "title": "Finally cleaned up my email inbox today and it feels so good.",
    "text": "",
    "score": 20,
    "created_utc": 1744822899.0,
    "subreddit": "happy",
    "id": "1k0ph3w"
  },
  {
    "title": "My story got narrated by a YouTube podcast!",
    "text": "I'm into the supernatural/creepy, and I listen to podcasts about ghosts and cryptids all the time. A few weeks ago I decided to write out a story about a strange encounter I had, and someone liked it so much they narrated it on their podcast! Not only did I get my story narrated, but I found a new channel to listen to. Win/win ",
    "score": 11,
    "created_utc": 1744833411.0,
    "subreddit": "happy",
    "id": "1k0tskz"
  }
]