[
  {
    "title": "Our most-broken and least-understood rules is \"helpers may not invite private contact as a first resort\", so we've made a new wiki to explain it",
    "text": "We understand that most people who reply immediately to an OP with an invitation to talk privately  mean only to help, but this type of response usually leads to either disappointment or disaster.  it usually works out quite differently here than when you say \"PM me anytime\" in a casual social context.  \n\nWe have huge admiration and appreciation for the goodwill and good citizenship of so many of you who support others here and flag inappropriate content - even more so because we know that so many of you are struggling yourselves.  We're hard at work behind the scenes on more information and resources to make it easier to give and get quality help here - this is just a small start.  \n\nOur new wiki page explains in detail why it's much better to respond in public comments, at least until you've gotten to know someone.  It will be maintained at /r/depression/wiki/private_contact, and the full text of the current version is below.\n\n*****\n\n###Summary###\n\n**Anyone who, while acting as a helper, invites or accepts private contact (I.e. PMs, chat, or any kind of offsite communication) early in the conversion is showing either bad intentions or bad judgement.  Either way, it's unwise to trust them.** \n\n\n\"PM me anytime\" seems like a kind and generous offer. And it might be perfectly well-meaning, but, unless and until a solid rapport has been established, it's just not a wise idea.  Here are some points to consider before you offer or accept an invitation to communicate privately.\n\n* **By posting supportive replies publicly, you'll help more people than just the OP. If your responses are of good quality, you'll educate and inspire other helpers.** [The 1-9-90 rule](https://en.wikipedia.org/wiki/1%25_rule_(Internet_culture\\)) applies here as much as it does anywhere else on the internet.  \n\n* People who are struggling with serious mental-health issues often (justifiably) have a low tolerance for disappointment and a high-level of ever-changing emotional need. **Unless the helper is able to make a 100% commitment to be there for them in every way, for as long as necessary, offering a personal inbox as a resource is likely to do more harm than good.** This is why mental-health crisis-line responders usually don't give their names and callers aren't allowed to request specific responders.  It's much healthier and safer for the callers to develop a relationship with the agency as a whole.  Analogously, it's much safer and healthier for our OPs to develop a relationship with the community as a whole.  Even trained responders are generally not allowed to work high-intensity situations alone.  It's partly about availability, but it's mostly about wider perspective and preventing compassion fatigue. \n\n* **If a helper gets in over their head with someone whose mental-health issues (including suicidality, which is often comorbid with depression) escalate, in a PM conversation it's much harder for others, including the /r/depression and /r/SuicideWatch moderators to help**.  (Contrary to common assumptions, moderators can't see or police PMs.)  \n\n* In our observation over many years, the people who say \"PM me\" the most are consistently the ones with the least understanding of mental-health issues and mental-health support. We all have gaps in our knowledge and in our ability to communicate effectively.  Community input mitigates these limitations. **There's no reason why someone who's truly here to help would want to hide their responses from community scrutiny**.  If helpers are concerned about their own privacy, keep in mind that self-disclosure, when used supportively, is more about the feelings than the details, and that we have no problem here with the use of alt/throwaway accounts, and have no restrictions on account age or karma.  \n\n*  We all know the internet is used by some people to exploit or abuse others.  These people *do* want to hide their deceptive and manipulative responses from everyone except their victims. There are many of them who specifically target those who are vulnerable because of mental-health issues. **If a helper invites an OP to talk privately and gives them a good, supportive experience, they've primed that person to be more vulnerable to abusers.** This sort of cognitive priming tends to be particularly effective when someone's in a state of mental-health crisis, when people rely more on heuristics than critical reasoning.\n\n* If OPs want to talk privately, posting on a wide-open anonymous forum like reddit might not be the best option. Although we don't recommend it, we do allow OPs to request private contact when asking for support. If you want to do this, please keep your expectations realistic, and to have a careful look at the history of anyone who offers to PM before opening up to them.",
    "score": 2366,
    "created_utc": 1572360722.0,
    "subreddit": "depression",
    "id": "doqwow"
  },
  {
    "title": "Regular check-in post, with essential information about our rules and resources",
    "text": "Welcome to /r/depression's check-in post - a place to take a moment and share what is going on and how you are doing. If you're having a tough time but prefer not to make your own post, or have an accomplishment you want to talk about (these aren't allowed standalone posts in the sub as they violate the \"role model\" rule),  this is a place you can share.\n\n-----\n\nOur subreddit rules are very different from most of the rest of reddit!  Since all of them exist for important reasons, we ask everyone here to read and follow them. Please click 'report' on any harmful content you see here - we always want to know and deal as soon as we can.\n\nWe also have several resource wikis for help with finding and giving support:\n\nhttps://www.reddit.com/r/depression/wiki/what_is_depression provides guidance about what is and isn't a depressive disorder, guidance on the complex nature of the illnesses that are usually grouped under the \"depression\" label, and redirect information for common off-topic issues.\n\nhttps://www.reddit.com/r/depression/wiki/giving_help offers information on the nature and value of peer support for mental-health issues in general, and lots of guidance for learning what is -- and isn't -- usually helpful in giving peer support.\n\nYSK that the types of rule violations that we most frequently see here are:\n\n- People breaking the private contact rule. You should never trust anyone who tries to get you into a private conversation in response to a post here. See https://www.reddit.com/r/depression/wiki/private_contact\n\n- \"I'm here to help\" posts. This shows that you don't understand the most basic principles of peer support, especially selectivity. The \"giving help\" wiki explains more about this.\n\n- Role modelling, i.e. \"achievement\" or \"advice\" posts. This is an expert-free zone -- that's what peer support means (rule 5). We know that \"internet culture\" celebrate not just bragging about your achievements but bragging about your good intentions. Nothing like that is ever acceptable here.\n\n- Content that's more about 'making a statement' or casually polling the sub than seeking personal support  (rules 1, 2 and 10).\n\n- Off-topic posts about difficult situations or circumstances, including interpersonal issues. Grief, sadness, anger, loneliness and other difficult emotions are not mental illnesses. The \"what is depression\" wiki has suggestions for other places to post about these issues, which are 100% valid and serious but inappropriate here.",
    "score": 26,
    "created_utc": 1744611968.0,
    "subreddit": "depression",
    "id": "1jys8x9"
  },
  {
    "title": "Seeing someone on here say “I wish I had cancer” and reacting to it as a cancer survivor",
    "text": "I can’t remember if it was this sub or another but it was a person saying they wish they had cancer, and it upset a lot of people (understandably). \nBut as a cancer survivor I wanted to say I kind of get it. When I was diagnosed it kinda made sense, it felt like all of a sudden I was “allowed” to feel the way I feel whereas before I was just someone who was failing in life (I was 22 at the time) probably depressed, CPTSD and undiagnosed autistic (which I didn’t know at the time). So if anyone ever feels like that I just wanted to say I get you. And coming from a not so warm family I needed the cancer as an “excuse” to care about my mental health. And the craziest thing is the psychological issues I dealt with before, during and after cancer were SO much worse than the cancer itself for me. When I had cancer I felt like I finally had a diagnosis that “lived up” to how I actually felt inside. ",
    "score": 129,
    "created_utc": 1746089606.0,
    "subreddit": "depression",
    "id": "1kc433r"
  },
  {
    "title": "My friends wish I kill myself",
    "text": "I'm a 14M and I have been depressed for a while now. I have started drinking recently and heavily. My friends found out and now hate me, I opened myself up completely. I told them I have nothing I live for and don't honestly care if I end up an astronaut or homeless. Because none of it would make me happy. I told them I have been feeling shit for over a year now and I have only been getting worse. I told them the alcohol is a last resort, and I do it instead of suicide. I have told them how I have been planning to kill myself and how, with carbon monoxide poisoning. They just told me they hate me and they wish I would kill myself. I have been hurt really really bad by there comment. Like at the time I'm at my lowest, they dont even sympathize instead just putting another hole in the sinking ship. Man I just need a hug but I don't have no one. And this shit cuts deep to Because one of them has been a friend since kindergarten. I also brought up if they really think that a day later and they said yes again. I might end it at my so called friends birthday. Like just why man, I now feel worse than ever.",
    "score": 101,
    "created_utc": 1746085460.0,
    "subreddit": "depression",
    "id": "1kc363u"
  },
  {
    "title": "I want to kill myself really bad",
    "text": "I am a 17 year old, was doing fine on school, but lately things aren't going so good, my close ones are at the edge of collapsing because of, i don't feel that i have a reason, nor a porpuse, nor anything that makes me want to live, i want to die, and i want to die today, can someone have mercy on me and just give me a way to kill myself in a painless and quick way? Or like a way to get access and the courage to shoot myself or something, the world is grim, i don't see it getting any better, so please, have mercy on me, i had suicidal thiughs since probably 8 or 9 years old, and these it has been getting worse, please, just tell me how to kill myself, i don't need to be saved, i just don't want to live",
    "score": 25,
    "created_utc": 1746103909.0,
    "subreddit": "depression",
    "id": "1kc7yaf"
  },
  {
    "title": "What the actual f*ck?",
    "text": "How am I supposed to keep doing this until I die with absolutely zero hope regarding future? Everyday I feel more and more dissociated from the real world. I can't have a house, a car, a holiday or enough expendable money to try anything that actually feels interesting. Everyday is harder then the previous one and I started genuinely fantasizing about destruction of the world order. I am ready to die if I can take that top %10 (successors included) with me. I don't want to think this way, I want to give a fair shot for the next 10-15 years but I just can't. I can't gaslight myself into thinking everything is going to be OK.\n\nAnyone feels this way? What did you do to get over it?\n\nEdit: I am 22M and recently graduated from CS from a good university. Not that it worths a thing thanks to AI.",
    "score": 29,
    "created_utc": 1746100319.0,
    "subreddit": "depression",
    "id": "1kc6t5p"
  },
  {
    "title": "My mind abuses me 24/7",
    "text": "I can‘t get a break. It keeps replaying moments of past abuse that lasted for years and traumatic events. The entire day. Every day. I can‘t escape my mind. There is no solution. I can‘t take this agony anymore. It‘s literal psychological torture although there‘s no one to blame but me. Even scared of dying and death so I basically live in pre-hell, stuck, suffering and having to pretend not to. Can‘t even punish myself or anyone else. There‘s nothing I can do but suffer suffer suffer ",
    "score": 16,
    "created_utc": 1746108875.0,
    "subreddit": "depression",
    "id": "1kc9s1a"
  },
  {
    "title": "I’m in the biggest battle with my brain rn",
    "text": "I’m trying so hard to stay positive…I write myself positive lists, I stay on autopilot and somewhat productive by setting alarms for myself the previous night. I’m tired of pretending I’m ok with the way I look. I’m tired of trying to convince myself my height is ok. I’m tired of seeing that my face is still ugly even though I had a rhinoplasty. I’m tired of trying to take care of my hair. I’m tired of not having money. I’m tired of not having time for my dreams and LITERALLY NONE OF THEM EVER FUCKING COMING TRUE. My dad who has stage 4 esophageal cancer gratefully got into remission with my and others help. But he still treats me horribly. I’m so fucking tired of pretending to myself that I’m ok or that I want to live. I’m tired of trying to get everyone else to be healthy and care for their mental health but not the other way around. I have a gun and I just want to end it all. Everyone around me only pretends to care about me just so I don’t kill myself and all of my friends fucking abandoned me. FUCK MY LIFE AND FUCK THIS PIECE OF SHIT WORLD",
    "score": 5,
    "created_utc": 1746125459.0,
    "subreddit": "depression",
    "id": "1kcggkx"
  },
  {
    "title": "I'm sick of this life",
    "text": "I'm going crazy sitting around trying to find jobs. I feel like crying because I don't know what to do with my life. I want to be productive but I'm not getting any jobs and I'm losing my confidence, comparing myself to those who have careers and salaries.\n\nI'm unable to save, buy what I want as in food, visit my partner because I'm unable to afford the expenses.\n\nThis is driving me crazy. I feel useless. I'm feeling like an imposter too. I'm anxious to take up jobs because I feel like a loser. I'm not getting any either.\n\nI'm trying to do something in my field like writing a book or designing lessons, but I'm not having any motivation beyond a couple of hours. I don't have anything to look forward to or work towards as a task.\n\nI might lose my sanity just by applying for jobs, browsing for any openings etc etc and sitting around at home. \n\nI've got no friends, not that I need any. I can't even get myself to watch YouTube or a movie because I feel guilty of just sitting around doing nothing.\n\nI attend interviews, no response. Apply for jobs, no response. I'm getting old and there's age limit too in some applications. My life is so messed up. I don't even know how I'm going to plan my wedding with no financial means. I'm late for everything in life. Late degree, pending career. Marriage etc etc. \n\nI feel like ending everything because I feel so lost and my head is exploding from all the pent-up emotions within. I'm too much of a coward and picky to take any such decision.",
    "score": 10,
    "created_utc": 1746112517.0,
    "subreddit": "depression",
    "id": "1kcb7wo"
  },
  {
    "title": "Why's it so hard for people to accept this Is me now",
    "text": "I used to be so active , worked out, good shape, nice job, did nice things for people, would spend most my time out of my house. Now ive been pretty depressed for about 3 years. I look like a skeleton, I barely eat , I don't leave my room, I barely speak up about anything ever. People seem to not have noticed I changed? Why do they still expect me to act as I used to. There's just no appreciation for me even trying it feels like , I'm just useless now because I' not who I used to be ",
    "score": 5,
    "created_utc": 1746123884.0,
    "subreddit": "depression",
    "id": "1kcftv1"
  },
  {
    "title": "I fucking give up",
    "text": "Did you know broken heart syndrome is a real thing? Don’t believe me look it up. That’s what I’m currently going through and it’s rough… I don’t know how much more of this I can take before I cave in. The craving for my old self is here I just want to put a line right up my nose and call it a day… I just wanna give up … I feel like I’m fighting a battle I can’t win… it hurts more than words can describe I don’t wish this pain on my worst enemy. ",
    "score": 9,
    "created_utc": 1746113884.0,
    "subreddit": "depression",
    "id": "1kcbryx"
  },
  {
    "title": "I've become so jaded in my 40's. Everything just seems like a ridiculous waste of time. Can't get excited about anything.",
    "text": "Things seemed magical in my 20's but now I know the secret sauce and it's basically the same shit over and over. Wtf cares if the Bears make the playoffs? Who cares what Taylor Swift said? What's the point of anything? Every once in a while something interesting will happen but then the other 99 percent is just;boring ass life. 😂",
    "score": 226,
    "created_utc": 1746048020.0,
    "subreddit": "depression",
    "id": "1kbrqch"
  },
  {
    "title": "I wish I had the courage to take my life",
    "text": "I quit my job with no plan. I'm screwed. I feel so weak and empty headed. Just showering and brushing my teeth feels like too much. Help. Make it stop.",
    "score": 3,
    "created_utc": 1746128813.0,
    "subreddit": "depression",
    "id": "1kchrzg"
  },
  {
    "title": "Hopeless",
    "text": "Im lost, i feel anxious, no motivation, empty, drained, disconnected from everything and everyone, im 22 and these last 4 years ive been working i havent really achieved anything, i still havent saved up for drivers licence, living paycheck to paycheck, still live in a shitty old house, i feel so used and exploited by the evil system that doesnt care about anyone, only for money, i am hopeless.",
    "score": 5,
    "created_utc": 1746114692.0,
    "subreddit": "depression",
    "id": "1kcc3nn"
  },
  {
    "title": "I've decided by the time I'm 35 and still single I'm going to kill myself.",
    "text": "Not telling any \"friends\" or family. And the internet isn't a good place to go for comfort. So motivate tf outve me to do it. Fuck me stupid piece of shit deserves to die. ",
    "score": 57,
    "created_utc": 1746069852.0,
    "subreddit": "depression",
    "id": "1kbz63u"
  },
  {
    "title": "what's the point if I'm going to be alone forever?",
    "text": "no one has ever liked me and i don't even feel like getting friends at this point.",
    "score": 3,
    "created_utc": 1746126803.0,
    "subreddit": "depression",
    "id": "1kcgzqk"
  },
  {
    "title": "What's the side effects of your pills?",
    "text": "Hi! I'm new here so hello everyone!\nIdk if that's the right sub for that but i don't know who to ask that question since no one in my circle takes antidepressants so i thought i'd ask here. \nSo i've been on Sertralin for a few months and i wanted to know what the side effects that often occur are? \n\nPersonnally i feel very tired (i couldn't get out of day today because i felt dizzy and has huge vertigo). It's very new to me as i haven't been taking meds before. It's also annoying because i feel like i can't get up to my loved ones' expectations. The medication also made me  feel so desperate i SHed (i've never done that before). It also gives me muscle twiches that can lead to pretty bad muscle pain, often in my lower back. I also lost a lot of interest in food and feeding myself. \nOn the sexual side, i feel like it's almost impossible to get orgasms now. It's pretty bad for me as sex was one if the last thing that made me feel a bit of relief. \n\nIf somebody is willing to share what their side effects are or tell me if all of that is normal i would really appreciate it <3 thanks in advance and good luck with yall's recovery ",
    "score": 5,
    "created_utc": 1746116428.0,
    "subreddit": "depression",
    "id": "1kcct1w"
  },
  {
    "title": "I don't know what to feel anymore",
    "text": "I am a terrible person who doesn't deserve to say they're depressed. I have two sisters who I bullied since we were little, now one avoids me and one hates me. My father is at best annoying and at worst abusive. My mother doesn't really do much except watch the news since she's so fed up with me and my sisters. I have sexual thoughts about my friends. I'm obsessive. I guess I'm smartish but I never challenge myself, like I should be working on homework but instead I'm typing this. Everyone around me seems so talented and kind, while I'm a fake, mean, and idiotic person. I would end myself if I weren't scared of dying. I used to think I was empathetic but I just feel numb now. If any of my friends knew this about me they would leave. Oh and I have thought about murder. I don't deserve your attention, but am I right? Do I deserve to be happy?",
    "score": 4,
    "created_utc": 1746120549.0,
    "subreddit": "depression",
    "id": "1kceh3s"
  },
  {
    "title": "How do I stop thinking about doing it?",
    "text": "I don’t like being sober. I hate having to think. I’ve always been relatively smart (or at least I used to be), and I don’t enjoy living life. Even when I was very young, it always felt like a letdown. I’ve had hobbies or hyper-fixations, and sometimes they cycle back around, but they always end up feeling ultimately pointless. Most of them come from an underlying need — socialization, energy release, boredom — not real passion.\n\nI don’t even know how to change it. I’ve started studying for a new degree — it's easy and fairly interesting — but I still can’t stay afloat. My parents want what’s best for me, but to them that means financial security. What I’m really searching for is some kind of fulfilment — or at least advice better than: *“You’ve got loads of time to figure it out.”* Because at this rate, no, I don’t.\n\nI’ve got okay friends, lovely past relationships, a great family who love me (and can help financially if I ever truly need it), and I’ve had numerous hobbies I was decent at. But life just feels so pointless. More and more, it seems like the best options are either to win the lottery and get high on a beach every day until I don’t feel anything anymore — or kill myself. My friends and family are really the only thing stopping me. I could never inflict that pain on them, without them fully understanding why. It's almost as if I want to be euthanised and I want them to accept it and love me anyways.\n\nI have a deep fear of being egocentric, and I feel guilty for wanting more out of life than just a job, a family, and a mortgage. I even feel guilty for posting this. I’ve never talked about this stuff in-depth with anyone before. Most people seem like they’re just waiting for their turn to speak. I guess the silver lining is I’m seeing a psychiatrist soon — someone who will at least be paid to listen, rather than pretend to care before switching back to talking about how shitty their back feels or what they saw on the way to work. Sorry if there's any grammatical errors or stuff doesn't make sense.\n\nEdit: 24 M\\* This also sounds a lot like a career issue but, the only time I ever feel I'm happy is when I'm warm, cosy, high, falling in and out of sleep.",
    "score": 4,
    "created_utc": 1746116112.0,
    "subreddit": "depression",
    "id": "1kccohw"
  },
  {
    "title": "Is the purpose of arranged marriage is only to have kids?",
    "text": "I really wanted to get married. But I don't want to have kids. There are so many options to have kids. We can adopt too right? I'm scared of my life. I want a partner to roam, share feelings, etc... but don't want to have kids. I'm stressed for my life. I'm having these negative thoughts and shivering, random panics. I really don't want to face all these stuff. Need to keep full stop for God's sake. I'm tired. I tried telling my parents about my wish. They are against me. I'm feeling stressed always with these negative thoughts etc. What should I do? I'm scared.",
    "score": 6,
    "created_utc": 1746109374.0,
    "subreddit": "depression",
    "id": "1kc9yzv"
  },
  {
    "title": "Lonely",
    "text": "Anyone here with no friends at all? I haven’t went out with a friend since the day I turned 18 now I’m 21. I’m not a weird person I’m just pretty antisocial and lonely. ",
    "score": 4,
    "created_utc": 1746114487.0,
    "subreddit": "depression",
    "id": "1kcc0qe"
  },
  {
    "title": "I’m broken",
    "text": "My brain doesn't work like everyone else's. I'm too mentally ill. Can't work. Can't afford therapy. Can't help myself. Been passively suicidal for a decade. I  want to die every day. I don't know what to do other than die. ",
    "score": 7,
    "created_utc": 1746109926.0,
    "subreddit": "depression",
    "id": "1kca6my"
  },
  {
    "title": "“Guy” “Friend”",
    "text": "I (25F) hooked up with my guy best friend and I’ve told him multiple times that I only see him as a friend, but somehow he’s always convinced me to hook up with him. I want to just cut him off and not speak to him and I feel like I have a right to do that. He’s been shit posting about me on Facebook and I’m not sure what I did, I really don’t care and just don’t want to speak to him. But he’s my only friend and it makes me sad. But at the same time I know a try guy friend would not try to hook up with you and then ghost you after. I honestly think it’s fucked up because he’s close with my family and everything and I ended up telling my family and they told me to cut him off. He messaged me and I’m not going to reply. I know it takes two to tango but he knew what he was doing and it make me sick. How do I handle this without getting sad or lonely?",
    "score": 3,
    "created_utc": 1746117376.0,
    "subreddit": "depression",
    "id": "1kcd6wc"
  },
  {
    "title": "I don’t want to do it anymore",
    "text": "I suffer from anxiety since I’m a teenager due a traumatic childhood and became expert with hiding my emotions.\nWhen I became 23 it started to get worse and started to take antidepressants .\nI’m seeing therapist since I’m 13 , when I was 24 I started to use drugs heavily, I tried any drug available in my country besides opioids till I crashed really hard.after that I went to a farm for people with depression to help to them to build a routine ,finished there and started to use drugs more than before till I went to rehab. I’m one year after rehab I’m 27 today and started collage this year. I finished the first semester while suffering all the time feeling so lonely and stressed and now I can’t do anything, I have gaps in all of the courses , I can barley eat,  can’t get out of bed just crying most of the days alone .\nI don’t want to do it anymore the only reason I’m alive is because my family cares so much about me and I can’t hurt them like that but I really losing the desire to live as time pass. I feel like a complete failure and nobody can see it.\nI look like an impressive man , I’m tall and good looking , smart and funny but it doesn’t worth shit if most of the time I’m just feeling pain .\nI’m so sick of it the only reason I’m not doing drugs anymore is because they’re not working . I just want someone or something to take my pain away I don’t want to live anymore ",
    "score": 10,
    "created_utc": 1746099273.0,
    "subreddit": "depression",
    "id": "1kc6i4r"
  },
  {
    "title": "Worst depression/anxiety of my life",
    "text": "I left school cause my family forced me to come home after I wasn’t sleeping or eating. I am almost finished a MSC and have no motivation to finish. I feel incompetent, stupid, and broken. I will eventually run out of money. It feels like my friends dont care anymore, when I know they do. I think about suicide every day. I feel shaky, I feel weak, I feel like giving up. The only thing keeping me going is what little faith I have left in me in God, and the song Glory by our last night. Yes even those with faith in something more feel like giving up. I just dont know what to do. Everyone tells me just wait it just get yourself better but those are not answers. I just want to die. ",
    "score": 4,
    "created_utc": 1746116196.0,
    "subreddit": "depression",
    "id": "1kccpon"
  },
  {
    "title": "i’ve lost the passion for everything.",
    "text": "i used to love art. i can’t do it anymore. i loved music, now it feels meaningless. i love my cat, my mom. but i find no joy in life. no purpose for my future, no reason to exist. i can’t get into college because of my low academic scores due to brain damage. i can’t work due to disability. i don’t earn money for disability. i’m a burden to my mom who cares for me.\n\nthe black hole in my chest is back. it’s growing and sucking in everything keeping me alive. i hydrate only to dehydrate through my tears. \n\n“you’re worth it.” “you’re not alone.” “someone loves you.” it doesn’t fill the hole. nothing does. \n\ni wonder when the hole will finally consume the fear of the unknown. i wonder when i will make the jump. i have so many options at my fingertips, so many outs. i live near a bridge. i take medications that can be deadly. i have an extremely high pain tolerance, i’ve never needed opioids or even ibuprofen for post surgery. \n\nsometimes, someone will never contribute to society, to a family, to friends. \n\ni believe that someone is me. ",
    "score": 25,
    "created_utc": 1746079824.0,
    "subreddit": "depression",
    "id": "1kc1uft"
  },
  {
    "title": "Is goal setting a sunk cost fallacy?",
    "text": "I'm always conflicted whether a simple to do list is beneficial or not. I tick it off as I go along but hardly even bother to do what needs to be done.\n\nSometimes I complete the odd task then tick it off like booking an appointment for instance, but mostly this is automated when I can be arsed without even looking at the list of things that needs done.\n\nIt subconsciously places me into a mindset of having to 'plan my every action'. So I put things off that may help because its simply not on my priority list. This is obviously not the way to approach life, to be reliant on planning ahead of every goal as it goes against spontaneous action.'\n\nI need to get out more as I'm a serious recluse even during warm weather. Today I ventured out of my cave to get a trim, it felt good to just simply walk in the sun for a brief moment because a day out for me is usually opening the windows and blinds, that's as close as I get. I wish I could be better at making goals and taking action, \n\nI get so overwhelmed with thinking what career path to take for instance so I instead do nothin but wallow. Its been a constant frustration for me that has plagued my life, keeping me locked in this dangerous cycle of rumination which depression feeds upon, I'm sure u guys can relate to this twisted paradox.",
    "score": 2,
    "created_utc": 1746129012.0,
    "subreddit": "depression",
    "id": "1kchur4"
  },
  {
    "title": "i have no life, nothing will change. why am i wasting my life at home?",
    "text": "I'm almost finished Highschool. I'm a current 12th grader who didn't do any volunteer hours, or completed the OSSLT. ( Failed once, and too embarrassed to retake it. ) I have severe social anxiety and fear going outside. I have no friends. nothing will change. I can't change myself and I refuse to get help. I had a social worker issued by the school once in elementary and since that day, I told myself '' I'm never telling an adult about my problems again. ''",
    "score": 4,
    "created_utc": 1746115335.0,
    "subreddit": "depression",
    "id": "1kccd75"
  },
  {
    "title": "Update on me (21M) and my situation has progressively gotten worse, I'd like to know how to turn my life around.",
    "text": "About 4 months ago in January/ late December I had made a post on reddit also asking for advice about a breakup I was going through. trying not to restate the whole post, long story really short, basically I was broken up with, and I don't know why, I can speculate all day, but it's just not helping me, by doing that. the post attracted one person to comment some supporting words which I did not forget about, appreciate and did take to heart, saying that I need to keep going and keep eating, stay healthy etc. \n\nSo, update since then, the good parts, I started taking medicine to help with anxiety and depression, with that I picked up a new hobby or if I'm honest, something to distract me, motorcycling riding. that's about all for the good, on the other hand, I lost my job, I'm in debt from taking out loans which I could pay if I kept my job, I'm stressed out with my family members medical issues, and to keep it brief, I feel stressed, every day I wake up\n\nRelationship wise, I'm stuck I feel as if it's Wrong to move on as I put everything, I had into her, and to let go of the memories we had, but I know I couldn't and wouldn't take her back if she texted me today, because of the pain it put me through. By now, I thought with my combined efforts of deleting all social media reddit included, not looking back at past pictures and thinking about the times we spent together, my attempts to medicate, lack of communication to her, and self-allowance, knowing I'm going to have bad days, then better ones, that I would eventually grow past this person, and hardships I'm going through. But, I haven't, I don't know if this is normal or not, to not be over someone in about 4 months or so that you knew for years, regardless how this all ties together is, I was unable to focus at work, not motivated enough to go out and talk to more people, and my mood was constantly down. consequently, I was fired, and I just sat there, freaking out inside, unbothered on the outside.\n\nProfessional wise, I'm too stuck in my own head that can't compartmentalize work from personal, and i end up spacing out, and it causes me to make mistakes, and sometimes not even remember them. leaving the only thing I can say is \"I don't remember what happened\" like I'm on auto pilot 99% of the time. I need a new job now of course, and I been searching ever since, but I don't even know if it will turn up like the last one I had, as it seems to be a bigger issue than I originally let on.\n\nFamily and personal wise, I put these 2 together because some of this is me overthinking, some is true with losing my job I had to move back in with my parents, which I didn't want to do as I hate feeling that I leech off them. I offered to pay rent with the money I have saved, my mom declined taking it. my stepdad made some comments about how old I am coming back to live with them is ridiculous and that I should figure it out on my own. which only makes feel that I'm letting them down.  The meds I been on haven't been working as well as when I was first given them, then again to someone who's so used to feeling abnormal, normal is the weird feeling, if that makes any sense...\n\nAnyway, I don't want to feel as if I failed, relationship wise, professional wise, family wise, and personal wise. ",
    "score": 3,
    "created_utc": 1746119025.0,
    "subreddit": "depression",
    "id": "1kcduxz"
  },
  {
    "title": "i feel really sad and like i’ve got nowhere to put it",
    "text": "Not really sure why i'm posting, for awhile i've felt very apathetic towards life and have dropped out of a lot of my sports and music (i'm 16f). This year a few weeks after christmas i discovered my father was cheating on my mum, he confessed to her and they have stayed together. \nThis effected me greatly and I have been attending therapy since before this happened. I canceled my last appointment as nothing seems to help. Im constantly disgusted by my dad and so sad for my mum who deserves the absolute world. \nI feel like nothing makes me truly happy and hasn't for awhile, i don't physically harm myself so I guess i'm not that sad. \n\nI don't know has anyone got any advice apart from exercise haha.",
    "score": 6,
    "created_utc": 1746105378.0,
    "subreddit": "depression",
    "id": "1kc8gzg"
  },
  {
    "title": "Honestly it’s not worth it to live",
    "text": "If u don’t have an amazing career to make money with, or don’t have a job you love what’s the point. Work and half of your money is gone just finding a place to live. After 23 love is about what u can provide and becomes transactional so it’s really not love. If ur a normal person and don’t have a negative self talk I say enjoy the small things like your favorite ice cream, or the beach but to rest of us we should just end it ",
    "score": 296,
    "created_utc": 1746028630.0,
    "subreddit": "depression",
    "id": "1kbk024"
  },
  {
    "title": "This illness literally controls everything in my life",
    "text": "I've been depressed for 3 years and counting. I don't think I'll stop counting any sooner. \n\n1. I cannot sleep when I feel like because every night is filled with insecurity, trust issues, guilt for existing and more and more ideas to kill myself. Thoughts control when I get to sleep. \n\n2. When I wake up is also controlled by depression. Since I have such a bad headache by afternoon every day I need to wake up early to start studying early. And my sleep isn't great because hey someone is in the darkness watching you and ghosts and nightmares idk what else. Migraine and dizziness sucks. \n\n3. How much I eat also is dependent on this because I have so much pain in my throat every time I try swallowing something. It is GERD and the only reason at my age to have it is because of some mental illness. \n\n4. How I talk to people is controlled by it because I just feel guilty for them having to be near someone like me, having to talk to someone as disgusting as me, someone as lazy and selfish as me. I want to escape from everyone. Run away kill myself not have to face anyone. Otherwise I'll have to be as silent as I can while literally screaming from inside and appear as if I'm the happiest person on this planet. \n\n5. How much I can concentrate, how I can communicate is controlled by it. I have to talk to patients in the hospital, if I live long enough I'll be a doctor in the next 1 year. I cannot study properly forget about retaining material. Concentration, the will, the desire, the interest, everything is gone. I cannot communicate with patients well because my mind works literally so slowly that I can barely follow what they say. Normal speed is too fast for me with all the dissociation. \n\nDo I want to get better? Honestly no because even if there is a slightest possibility of me getting better, I am not a good person, I'm gonna relapse very quickly and I'd never wanna be where I am now.\n\nPeople say: \"The only way out is through\". The only way out is to escape and get over. ",
    "score": 4,
    "created_utc": 1746111872.0,
    "subreddit": "depression",
    "id": "1kcayfa"
  },
  {
    "title": "Does it really get better?",
    "text": "I don’t want to die but I’m still here\n\nI (26f) just went through an old diary/journal I’ve kept on my nightstand since my senior year of high school. Starting from the first few pages it’s filled with my scramblings about how much I want to die and how I hate myself and want to kill myself. \n\nI STILL feel this way. I have not changed since I was 17. I still fantasize about killing myself every day. I think that if my sister didn’t die when we were kids I would have done it or at least tried it by now. I don’t know if I will ever not be in pain. People say it gets better with time but I’m not sure that’s true at all. If something is broken in your soul not even a full lifetime can fix it. ",
    "score": 27,
    "created_utc": 1746074374.0,
    "subreddit": "depression",
    "id": "1kc0g8a"
  },
  {
    "title": "What’s the point",
    "text": "I’m so tired of trying. I work my butt off full time and try to be a good person but life seems intent on punching me in the face. I can’t pay my bills. I can’t keep my partner from using. I can’t even go to the dr to get the iud I’ve had for 3 extra years removed. I just go to work and then come home and sit in the same spot day after day. My house is a wreck and I don’t really care. My partner wants to get married but how do I tell them that I don’t see the point since we can’t even manage our life now! I use to be motivated and everyone has always considered me a strong smart leader but I just don’t see that person anymore. I just want to sleep so that my mind is quiet.",
    "score": 2,
    "created_utc": 1746124123.0,
    "subreddit": "depression",
    "id": "1kcfx9c"
  },
  {
    "title": "My inaction in life has caused basically all of my problems, how do I stop?",
    "text": "Since high school graduation I've been kinda coasting through life not really doing anything. While my peers were improving and doing shit with their lives I was (and still am) lazing about doing nothing and being depressed. I'm self aware enough to know that this is bad, but I lack the energy or drive to stop it.\n\nI'm currently 24 with absolutely no prospects in life or skills. Has anyone here faced a similar problem? How did you solve it?",
    "score": 2,
    "created_utc": 1746124035.0,
    "subreddit": "depression",
    "id": "1kcfw0b"
  },
  {
    "title": "Suicide",
    "text": "Im not currently having suicidal ideation and I have no plan but out of curiosity do other people often have that voice telling you you should throughout the day/life? Its a taboo subject obviously so i don't know how to bring it up but do some people just not have that as they go through life? I feel like it is there quite a lot and just gets louder at certain moments and so I wonder do normal non depressed people just not have that? ",
    "score": 4,
    "created_utc": 1746110365.0,
    "subreddit": "depression",
    "id": "1kcacl2"
  },
  {
    "title": "Should I just un alive myself and get all of this over with?",
    "text": "I’m 15, so I absolutely HATE school and I don’t wanna be there. School has made me sooo drained and so unhappy, one day I realized I really don’t have to go because no one can actually make me go so I told my grandma and she called my therapist I stuck to my word and I didn’t go to school but after that the next day I went. After everything that happened I was at school EVERY SINGLE DAY I could not stay home at all, so if I was sick, on my lady’s month, or etc I still had to go. Today i did the same thing she called my father and ig now he’s going to get me Monday to live there again, PS, when I was with my father I was very depressed and unhappy and I tried many time to un alive myself and his household is just not it his wife is kinda a btch, my sister and bother lives there and my step siblings. I don’t wanna be there again but I absolutely don’t wanna be at school and my mental is just getting worse day by day. But sooooo much more has happened in my life I just can’t take it anymore it’s not even just this. ",
    "score": 4,
    "created_utc": 1746109565.0,
    "subreddit": "depression",
    "id": "1kca1ld"
  },
  {
    "title": "What am I doing wrong",
    "text": "All my friends forgot my birthday. Every one. Im a good friend. I lend them my car all the time, never ask for anything in return. I bake stuff for other, never ask for help cleaning. I never ask for anything, always go out of my way to help whenever I can. I’m there whenever they need someone, I always let them know they matter to me. I never seem to get that back. I let them drive my car across a bunch of the country, without me, and barely got a “thank you”. All I wanted was one person, just one, to remember. My wrist is sprained, my leg I injured, I can’t exercise at all, my schoolwork is meaningless, at least I thought my friends cared. I guess not. What am I doing wrong? I just don’t understand. I really thought someone would remember ",
    "score": 2,
    "created_utc": 1746122676.0,
    "subreddit": "depression",
    "id": "1kcfcm1"
  },
  {
    "title": "I HATE IT HERE",
    "text": "I didn't thought my depression will get worst but as the time for the results is getting closer I just want to jump of a building AND YOU DARE SAY \"IT WILL GET\" OR SOME POSITIVE SHIT! \n\nI am sorry for being a piece trash but I just feel so tired of thinking about MY FUTURE AND WHAT WILL OTHERS THING ABOUT ME because I am not good at studies AND no longer have a school because the IDIOT PRINCIPAL WENT TO JAIL and also I have to fine a new school to get admission in BUT BUT FUCKING BUT I am not good at academic so no school want a idiot! AND ALSO THE FACT THAT I CAN'T EVEN GIVE A INTERVIEW PROPERLY or pass the entrance exam \n\nIf the exam result are out I wouldn't get admission in any school and I can't look at my family in the future because of the shame they will feel have a child like me..",
    "score": 5,
    "created_utc": 1746107010.0,
    "subreddit": "depression",
    "id": "1kc92d7"
  },
  {
    "title": "I'm empty",
    "text": "I am a 14-year-old female. I have this empty feeling that sticks for a few weeks, leaves for a week, and then returns. I feel as if every conversation is fake, and I'm alone even when I'm with my best friends. I have prayed and tried to become a better Christian in the hope of God healing me, but it's just happening. I feel unfulfilled and apathetic, that I'm not fully present in any conversation. \n\nI have been diagnosed with low autism, anxiety disorder, and ADHD. I see a therapist every month but I still fear telling her things. I have major trust issues and I don't know how I'm going to get better. There is this dull ache in my chest and an emptiness I don't know how to fill. ",
    "score": 4,
    "created_utc": 1746106792.0,
    "subreddit": "depression",
    "id": "1kc8zh2"
  },
  {
    "title": "help",
    "text": "hi guys so ive been thinking abt taking my life away because ive never been happy with my life although i have everything that would make a girl happy. but since i was a kid ive always cried at school and trainings and isolated myself and made my life like real hell. i dont remember anytime in my life where i really enjoyed it. and what'a hurting is that i really have everything any girl would want if its gold, cloth, trainings, like literally anything even brain and beauty. I've really tried to change the person who I am but I keep failing. I don't even know how to go to college anymore or study or go out of the house. I was never happy with my life since I was literally 7 or somth i even remember all my childhood has been depressive and I never used to say yes to plans and say my parents said no although they would always agree. I really dont know what to do pls pls could there be something with my brain??\n\nlike is really enjoying life a choice?\n\nhow?\n\ni don't believe that because how could it be a choice and ive been like this ever since i was a small kid. Even while going out i used to see everything as dark or black. i dont know really what to do. i gave up on my life and myself. and everywhere i go like school, college, everyone seems to be really living and happy with their lives except me. its really not normal. could there be somth really wrong with how my brain functions. i really used toc cry and have sad notes written of how i dont have any friends although i used to have but my brain tends to do that and isolate myself. what can i do guys? i really need help\n\n  \nive tried even pyshiatrict and whatever and therapy and i take meds but im still the same useless person i cant seem to do life anymore.\n\n  \nlike how can i enjoy life??\n\nive always based my life on studying anf used to isolate myself from ppl all my life and close my phone to the point where i went college and got fed up from life and even not studying at all where i;ll prob fail this year.\n\n  \nand even when i was small and used to go out ive never enjoyed. all my pictures since i was young were even depressive . i think i was born to be doomed and cant imagine it in a different way.\n\n  \nif there was a scan or test that we could do to check how our brain works im pretty sure mine would be unbalanced or have like 90% percent depressed and doomed mind.\n\nyou guys dont understand its to the point where im sad i wake up everyday and i hide from ppl in college and i dont study like im not doing life/",
    "score": 3,
    "created_utc": 1746112348.0,
    "subreddit": "depression",
    "id": "1kcb5hg"
  },
  {
    "title": "I looked fine on the outside. Fun, successful, always “on.” But inside, I was in turmoil.",
    "text": "I looked fine on the outside. Fun, successful, always “on.”  \nBut inside, I was in turmoil.\n\nFor 18 years, I drank every single day.  \nAt first, it helped me tune out the noise - quiet the anxiety, the overthinking, the ache I didn’t have language for.\n\nBut over time, what used to help became a poison.  \nMy body started rejecting it. My brain too.  \nI didn’t know who I was anymore without something in my system.  \nI was always caffeinated, buzzed, crossfaded, or crashing.\n\nEventually, the cracks showed:  \nThree psych ward visits.  \nAn attempted suicide.  \nThen finally, rehab.\n\nIt sounds ridiculous now, but realizing *“maybe it’s all the drinking”* was actually a breakthrough.  \nRehab didn’t just sober me up, I was a functioning alcoholic - it gave me my identity back.  \nIt helped me understand alcohol not as some harmless adult beverage, but as a drug that was destroying me slowly and quietly.\n\nI wanted to share this story with you guys because I’ve also decided to take action.  \nI don’t think the public really knows how serious alcohol is; that it causes cancer, addiction, worsens mental health, and contributes to suicide.\n\nSo I created a petition asking Congress and the Alcohol & Tobacco Tax and Trade Bureau to update the Surgeon General’s warning label on alcohol to reflect what science now confirms, and what too many of us learned the hard way.\n\nI’ve never led anything like this before. It’s just me and some LLMs trying to build something real. If you feel the truth might’ve helped you (or someone you care about) I’d be grateful if you signed: [https://www.change.org/LabelTheTruth](https://www.change.org/LabelTheTruth)\n\n*(Heads up: Change may prompt you to donate after signing. That goes to their ad system - not me.* ***I’m not raising money, just awareness.*** *Your signature is more than enough.)*\n\nBe kind to yourselves.  \nThe world isn’t exactly fighting for you to succeed.",
    "score": 3,
    "created_utc": 1746112092.0,
    "subreddit": "depression",
    "id": "1kcb1s4"
  },
  {
    "title": "I’m the worst person I know",
    "text": "I’ve gone through a really detrimental heartbreak, 8 months ago. I’m nowhere close to being healed or have moved on. Everyone always leaves me, usually in brutal ways. Love has always been the most important thing in my life, yet I can’t find it. Not one person has ever truly loved or cared for me.\n\nI cry everyday, because I can’t help it. There’s the deepest pit of sadness in my heart. I tried for months to talk myself out of it, to go to therapy, etc, none of it truly helped. I’m lost in life, no clue where I want to live. I’m broken, sad, and have become a bitter person. I’m miserable. Everything sets me off. I want to end my life. I’m reaching my breaking point and don’t know how much longer I can do this.",
    "score": 15,
    "created_utc": 1746079011.0,
    "subreddit": "depression",
    "id": "1kc1n7c"
  },
  {
    "title": "I thought about stabbing myself today",
    "text": "I am 15, and I am suffering from depression. I keep skipping school, and I even skipped school today. I feel so overwhelmed, and my life just keeps getting worse. I’m always being blamed for everything. Sometimes I feel like it is my fault and that I’m a burden to everyone around me. I was planning to stab myself, but the only thing keeping me alive is that I’m too much of a coward to actually do it. I’m just so upset at myself. I feel so stupid and useless. I thought I was getting better, but now I’m back at square one. My parents say if I keep doing this I’ll be taken away and go to court for the amount of days I missed. I have so many Saturday schools, and I’ll probably be held back. I’m scared of this but even though I know this could happen, I can’t bring myself to change. I’m not sure what to do anymore.",
    "score": 2,
    "created_utc": 1746118164.0,
    "subreddit": "depression",
    "id": "1kcdihx"
  },
  {
    "title": "Tired of feeling like this all the time",
    "text": "I just feel completely done lately. every day is the same. i wake up, pretend to be fine, come home and just sit in silence. i don’t talk to anyone, no one checks in, and honestly i don’t think anyone would notice if i just stopped showing up. i don’t really eat right,my life is a mess i’ve stopped caring about everything. it’s like im just watching my life happen from outside of it. i keep thinking about how it’d be easier if i just didn’t exist not in some dramatic way, just like quietly disappearing I needed to get this out of my head i feel like i’m always on the edge of something and i don’t know how to pull myself back anymore. i’ve started hurting myself again. i know it’s not the answer, but it’s the only time i feel anything that isn’t numb or hollow. i guess i just needed to say this out loud or whatever counts as “out loud” on the internet. if you’re reading this, thanks. just knowing someone might hear me helps a little.",
    "score": 5,
    "created_utc": 1746102276.0,
    "subreddit": "depression",
    "id": "1kc7fea"
  },
  {
    "title": "I Feel like I Lost Everything before Hitting 30",
    "text": "\\*Obligatory, I know people have it much worse than I do, and with depression, you can feel unworthy of it.\n\nBut basically, I had a lot going for me for the last 10 years. Great jobs, Great friendships.  Everything has been going well. But this year, my good friend and roommate moved out, I'm unemployed now, and I've lost pretty much all interest, in any and everything. \n\nI was the last person you'd think would turn into a crazy loner, but people just don't interest me anymore, nor do I think I have much to share or contribute to anyone else. I just find myself utterly exhausted by everything. I was really hard working and driven, I had a hobby that I got paid for, I've traveled the world, been with a ton of women, and I've worked at some of the most prestigious institutions in the world....but now all of that is gone, and I feel completely burnt out.   \n  \nNow, I actively try not to speak with people and In a weird way, I'm almost content with how empty my life is. I didn't think I'd feel this way so soon.  I can still go outside, exercise, enjoy a beautiful day....  \n  \nBut I've fallen out of love with life and I'm not taking any steps to improve myself and that's frustrating to admit. I know I'm probably just wallowing in self pity, hence why I think I have nothing to share. Even when I'm invited out to things, I usually choose not to go.   \n  \nMost the time I feel like I'm just better off rotting away alone. \n\n",
    "score": 2,
    "created_utc": 1746115761.0,
    "subreddit": "depression",
    "id": "1kccjef"
  },
  {
    "title": "This is my last night",
    "text": "I don’t know where to start. But at least i know where it ends. All I’ve known my whole life is pain, suffering, heartache, and loneliness. I put in so much work to continually better myself, love myself, accept myself. I exhaust so much effort into making others around me happy. I always show up yet never shown up for. I always listen but can never be heard. I’m constantly falling short in every aspect in life. I’m a shell of the human i once was. Nothing brings me joy, pleasure, happiness. Only sadness and anger. I remember what it was like to be happy. Barely. But the distant feeling of wonder, and excitement is so far out of reach that it only exhausts me more trying to catch it. I’ve spent so many years breaking down my walls, making myself more vulnerable, trying to be a better man. To feel normal in a crowd. To feel loved by their peers. I thought i was there. But the reality was that I’ll never be there. There will always be something holding me back. Someone to take away the hope. The things i hope for never come true, and i think the reason ive suffered for this long is because all i can remember is how often ive hoped for this life to end. Maybe its because the things i hope for will never come along. Maybe my life hasn’t ended because then I’ll be in a better place and for some strange reason the universe wants me to keep crawling through this darkness. Death is the one thing i hope for anymore. But maybe hope isn’t enough to put me at peace. This isn’t a cry for help. My mind has been made up. Don’t waste the energy to change my mind or my outlook. I don’t blame anyone for who I’ve become. Please don’t blame yourself. ",
    "score": 0,
    "created_utc": 1746128415.0,
    "subreddit": "depression",
    "id": "1kchmgz"
  },
  {
    "title": "Iam die slowly",
    "text": "I now used Clonazepam 3 m and gabapentin 1200 m \nDuring day\nI suffer from ocd and gabapentin make it worse \nAnxioes and depressed all time \nI hate to sleep cause i feel shit and panicking in morning \nI tried zoloft and lexapro and i can.t handle it \nI tried also mirtazapin and it make me like dead person .. \nI need a help cause I can.t handle many meds \nAnd doctor told me i can.t do things anymore l. 😂 \nWhat meds could help me or lige changes \nI have hiv and my immune systemic are very bad\nI need a miracle pill for anxiety and panic attacks \nWith no hair loss 😭 cause i had a phopia from it !\nI pray god to help me finding a help?",
    "score": 0,
    "created_utc": 1746128057.0,
    "subreddit": "depression",
    "id": "1kchhf2"
  },
  {
    "title": "I think I’m mad",
    "text": "\nToday I woke up with different anxiety that I  usually feel. My dog woke me up, and the Sun was up, so I guessed I over slept and I let my dog out. She didn’t even need to use the bathroom. She barked at me until she came back inside. \n\nHow long her bark was in that moment and how everything felt so bright and disorienting made me feel super weird. \n\nWhen she came back inside, I took myself to bathroom thinking maybe I needed to use the restroom. Sometimes I don’t understand when I need to go and different feeling when reality it’s just poop. (That’s ADHD thing according to my last psychiatrist) \n\nI came back out and just laid down. But I’m shaking. I scroll through social media to distract myself and it’s not working. All I want to do is go into the shower and scrub off my skin with a pumas stone. \n\nI think maybe I was mad bc my routine was disrupted \n",
    "score": 2,
    "created_utc": 1746114379.0,
    "subreddit": "depression",
    "id": "1kcbz62"
  },
  {
    "title": "The hardest part for me is that every time I try to do something to feel better mentally, it ends up feeling pointless. I just get hit with more disappointment.",
    "text": "If I had to describe depression, I’d say it’s not just something that kills you slowly from the inside. It also kills anything you think might help you heal. It’s like this loop you’re stuck in. You try over and over to get out, but somehow you always end up back at square one.\n\nHonestly, I think people who want to die don’t actually want death. They just want that loop to stop. They just want peace from the never-ending cycle.",
    "score": 1,
    "created_utc": 1746127835.0,
    "subreddit": "depression",
    "id": "1kchec1"
  },
  {
    "title": "realizing i am alone in this life",
    "text": "having “friends” is useless. messages are ignored unless they have something they want to talk about. phone convos and irl are all about themselves. everyone rarely texts me, even my bf, when i can see that they’re active. it is in the back of my mind everyday that i will eventually kill myself. i now am only fully relying on myself for comfort, however that works for me, until i finally die. ",
    "score": 3,
    "created_utc": 1746106203.0,
    "subreddit": "depression",
    "id": "1kc8rl6"
  },
  {
    "title": "Overwhelmed, stressed.. and so lost.",
    "text": "TLTR;\n I've been living in the States for about 5 years now. I moved here for my fiance since his family is here. At first I loved it! A different scenery, a chance to start over and be new. But now I just miss everything about home. Slowly the past 2 years I've been missing home, more and more.\n\n Now I just feel an anger inside, I feel like I missed so much. My cat died, that really got me, I loved that cat, my parents were taking good care of him. Then a very close friend of mine passed, and I wasn't there and couldn't even make it to the funeral. My parents are getting older, a part of me is always worried to get a call that something happened to one of them. My friends back home all went through something and I feel like I can't support them as well as I'd like too. \n\n I'm just here. I've been the only one working for 5 months, rent is expensive! Then the bills.. and food.. I don't even like thinking about what to have for dinner anymore, I dread that question. Everything just stresses me out so badly, I don't know how to deal with my emotions anymore. I have been going to the gym, that seems to be the only thing keeping me somewhat sane. \n\n I just also can't stand the people now, all these small things get to me and I know they shouldn't, but they do. Just driving to work this morning my spotify wouldnt connctect. Or it just kept disconnecting, anyways it was was a point I just started balling my eyes out. I just want music. Everything feels against me, I feel like I'm drowning, and breathing exersizes dont seem to help, I just want to cry more. I just want to rip my hair out and scream. I don't know how to deal with this, any hobby I have I've lost interest. I love video games, but of course, my friends only all either don't like each other or lately super passive aggresive, makes me hate playing games with anyone..\n\nMy fiance is amazing, and I love him! Don't get me wrong, he does make me so happy and fortunate to be with someone like him. He's gone through a lot as well, at first when he quite his job I was and still 100% with him and will support him, but it's been 5 months.. I'm struggling to keep up with everything. He knows it too, he's been looking for work but because of previous jobs he had a back injury, he's having a hard time find work. He had quite a few interviews but no call backs. He's stressed and depressed, I'm stressed and depressed. \n\n I'm trying my best to keep it together, I miss my family, I miss the support, I miss my old community. This place sucks. The people suck, I used to love the food now I'm bored and hate it. I've gained so much weight, I hate how I feel and look. It's the biggest I've ever been in my life, it's so embarrassing and humiliating. Everything feels against me, everything is so overwhelming I don't know what to do or think anymore, I'm scared. I'm worried all the time. I hate this, this feeling is horrible, I'm just lost. So damn lost. \n\n\nSorry that this is long, and probably all over the place, I just needed to write it down, say something because there's nothing else I feel like I can do. I love and hate my life right now. I'm an mess.  I hope others don't ever feel this way, it's a horrible feeling. Has anyone else gotten through this feeling? Just anything, any words. Any person. ",
    "score": 1,
    "created_utc": 1746127307.0,
    "subreddit": "depression",
    "id": "1kch6v7"
  },
  {
    "title": "Advice for Relative with Depression",
    "text": "Hello community.\n\nI need some advice from you, because I, or rather my brother, am facing a big problem.\n\nMy brother (29) has had severe depression for about 3 years now (I think it runs in our family) and he can't get out of it despite regular therapy. He repeatedly has the feeling of not being worth anything and not being able to do anything, which leads to extreme fears about the future, feelings of powerlessness and no proper sleep (he says he sleeps a maximum of 4 hours a night, although he goes to bed around 22:00, but can't fall asleep).\n\nFor context: He works in our family business in the construction industry (which I also worked in but managed to leave). The industry is very tough and the family situation, especially with our father, who is otherwise loving and does everything for us, is very difficult to work with and always shakes his self-esteem anew. After a 2-year sabbatical and therapy, things went well again for a while, but a few days ago everything escalated again and he couldn't help but start crying. The mental stress he is under causes him to make mistakes and lack energy, which of course fuels the vicious circle.\n\nIn my opinion, the job in our family business doesn't play to his skills and he needs to do something else to prove his abilities and rebuild his self-confidence.\n\nHe somehow knows this too, but he can't find the strength to change anything (I know the feeling of permanently overwhelming tiredness).\n\nI would like to get him to support him on his way out of the company and get him into an activity (possibly volunteering with the Red Cross) so that he sees that he is not worthless or without ability and to get to know other people and ways of life\n\nWhat tips/procedures/strategies would you have for me so that I can get him on this path and support him? (because he needs help here, he can't do it alone) \nIf anyone has experienced this, what has helped you and what have you done?\n\nThank you in advance\n\n",
    "score": 1,
    "created_utc": 1746127168.0,
    "subreddit": "depression",
    "id": "1kch4wh"
  },
  {
    "title": "Is my life ruined?",
    "text": "I am a freshman but have absolutely no credits and I’m going into my sophomore year I’m afraid my life is ruined and theirs nothing I can do to make up my credits I also am home bound meaning I’m not in public school I just meet with a teacher idk maybe I’m just anxious ",
    "score": 1,
    "created_utc": 1746126388.0,
    "subreddit": "depression",
    "id": "1kcgtwb"
  },
  {
    "title": "I can't stand being alive",
    "text": "I keep wanting someone to put me out of my misery. I want someone to stomp my heart in one swift motion. I want to sleep and never wake up. It takes a lot of energy to wait out the day until I sleep. \n\nI don't want to die, I want to just be gone, disappear, crawl into a hole and vanish. I want the heart ache to stop.",
    "score": 1,
    "created_utc": 1746126349.0,
    "subreddit": "depression",
    "id": "1kcgtca"
  },
  {
    "title": "I can’t keep struggling like this I don’t know much longer I can keep going",
    "text": "Hello I just turned 24 but I still can’t seem to dig my way out of this hole and it actively feels like I’m being buried in it. A three long abusive relationship ended about a year ago it left my homeless I had no family to go to for support and my friends live 100s of miles away I signed a lease with a friend of mine back in September and have been financially drowning ever since I’m in so much debt on top of student loans I can’t feed myself most days and my car is on a downward spiral creating a money pit I can’t feed anymore. It was my grandpas car who had died three years and has been my safe space ever since. I have a mood disorder that has been becoming harder and harder to control even on medication and I’m in therapy due to the stress causing me to constantly self sabotage and spend recklessly because I genuinely think I’m going to off myself during the next depressive episode. My grandma has had two strokes and I fear for her life everyday as she has been my only rock recently. My mom died due to a relapse roughly a week ago I told her I wanted to rebuild our relationship once I had my life together and now I’ll never have that and I didn’t get the chance to tell her I loved her one last time I’m filled with so much regret. I haven’t paid April rent and they expect this week. I’m constantly isolated here besides my job that has continued to cut my hours (I work at Target and we all know what’s happening) more and more often I think it would be easier to just die so I don’t have to live like this anymore. ",
    "score": 1,
    "created_utc": 1746126162.0,
    "subreddit": "depression",
    "id": "1kcgqp7"
  },
  {
    "title": "I Don’t Know What to Do",
    "text": " I have been suffering from depression since I was 11 years old, and I will be 17 this year. I don’t know how I am going to live past 18 at this point. I have nothing I am passionate about–at least not to the extent of having a full time job surrounding it–I have difficulty concentrating on my schoolwork–which I do online–and I spend just about every moment wishing I was dead. Even when I am feeling “good”, I still don’t want to be alive since I reason to myself: ”I feel just fine now, so I should close the book now before it gets worse so I can end this miserable symphony on a high note.” No, perhaps this reasoning serves merely as a justification for emotions I would have had regardless of my conscious thoughts. The worst part about all of this is that I have no idea why I feel this way. \n\nI heard from a psychologist on YouTube that it’s a good exercise to imagine what circumstances around you would need to change in order to be happy. Apparently, doing this can be a useful tool to help a despondent person to ascertain whether their feelings are caused by the outside world, or whether they are simply brought about by an ailment of the mind. Interestingly, the only world I imagine myself happy is one devoid of people and responsibilities, made complete with a basalt-gray aesthetic throughout the land, grey cloudy skies, and tower for me to inhabit with a vast library spanning the fields that interest me. Not only is this wildly unrealistic, but I may end up not even being satisfied if this fantasy ever did become a reality.\n\n\nFurther context: I started feeling chronic hopelessness when I was 11, and the chronic suicidal ideation since I was 13. I have been in therapy and taking SSRIs ever since I was 14.",
    "score": 1,
    "created_utc": 1746126139.0,
    "subreddit": "depression",
    "id": "1kcgqef"
  },
  {
    "title": "I'm going to kill myself eventually",
    "text": "I don't know when. maybe next week, maybe in a month, a year. Just waiting for something bad enough to happen to push me over the edge. \n\nI've hated being alive for as long as I can remember. I never could get along with anyone, no matter where I went I was an alien. When I was a kid I could distract myself and play video games for days straight but now I can't even bear to play for longer than 30 minutes.\n\nI feel so disgusting all the time. No matter how much I shower I can't wash it off. This world is disgusting. I don't want to exist in a place I don't belong. It was always blatantly clear I wasn't meant to exist anyways. I never had a single friend, never done a thing in my life.\n\nim a complete loser and a pathetic excuse for a man.\nthere's no one who cares about me and nothing will change once I'm gone I barley fit the criteria for a person. my life and death will be as insignificant and meaningless as that of a roach.\n\nNot even drowning myself in alcohol can numb this overconsuming pain and loneliness. when I'm drunk I still want to just be dead. I have no will to live, I just don't. I don't want to go to therapy, I don't want to get better, I only want to be dead. It's a shame really, I don't even have it too bad, im just an ungrateful little bitch.",
    "score": 139,
    "created_utc": 1746029231.0,
    "subreddit": "depression",
    "id": "1kbk8yv"
  },
  {
    "title": "How do I love myself?",
    "text": "I’m 20 y/o M and I just simply don’t know how people “love” themselves. \nHow can I be happy with the way I am, I know I have good principles because my dad taught me them, he, unfortunately died 4 years ago. \nIn my eyes I am fat, I’m miserable to be around and I’m constantly ruminating about the past or the future, I don’t know how to get out of this fucking hole im in. \nDo I need to be perfect to love myself? \nDo I need a girlfriend to love myself?\nHow can I love someone when I myself do not love myself?\nHow can someone love me when I myself do not love myself?\nPlease someone help me understand this rut that I’m in, because I feel as though I won’t be able to ever love the person I see in the mirror. I’m not here seeking attention, I’m just looking for solutions, and frankly I’m embarrassed to be posting about it on Reddit. Thanks for reading ",
    "score": 3,
    "created_utc": 1746104189.0,
    "subreddit": "depression",
    "id": "1kc81o9"
  },
  {
    "title": "True friendship is dead or is it me",
    "text": "According to Facebook I have made some friends which I can usually add to the list every time I am hanging out by myself in the city by making little effort. However almost none of these people I thought my friend I see again and usually make no desire for sustained text conversations. Occasionally a new friend is agreeable and can be visited in person a couple more times until the eventual radio silence. I don't have any friends from childhood or college so this is most unfortunate. I am not really the church going type however trying to convince my lady but she is young and still likes to party with her girl friends while not coming home sometimes until next day or two but I trust her and have no worries about infedility. So anyway I always seem to be in perpetual loneliness and do get depressed which therapy barely mitigates. I love my girlfriend and happy she is not friendless like me. Maybe it is only a matter of time for when she does not come back any more and then it will be just me and the Lord nobody else. Perhaps if my faith not so strong then depression and hopelessness may lead me into an early grave.",
    "score": 2,
    "created_utc": 1746111717.0,
    "subreddit": "depression",
    "id": "1kcaw3b"
  },
  {
    "title": "Temporary reprieve?",
    "text": "Does anyone here have something that gives them a temporary reprieve from their depression? Like you almost forget you have it? I don’t know if this is the subreddit, but I have Bipolar II which means lots of “fun” periods of depression, but sometimes I almost forget it’s there. I don’t if it’s cause I’m genuinely happy, or it it’s just cause I’ve gotten so used to the feeling. Usually happens when I’m playing with my son. Is this something other people have?",
    "score": 2,
    "created_utc": 1746111461.0,
    "subreddit": "depression",
    "id": "1kcas2p"
  },
  {
    "title": "I just don't know how to cry. Otherwise I will be fine.",
    "text": "I just don’t know what to do anymore. Since the lockdown, I’ve spent the past five years in front of a screen, giving life no priority. Now it feels like I’ve lost those years completely.\n\nI’ve failed in every exam and every important decision. I can’t even remember the last time I smiled for myself.\n\nA friend I trusted betrayed me and made my world feel like a darker, lonelier place.\n\nI don’t even know where things went wrong.\n\nAll I know is—I don’t think I deserved any of this.",
    "score": 1,
    "created_utc": 1746124727.0,
    "subreddit": "depression",
    "id": "1kcg64c"
  },
  {
    "title": "Please don't let me be me anymore",
    "text": "I am so completely, totally, utterly worthless. 29, and I am in the exact same place I was a decade ago. Over a decade ago. Same terrible 2 hour job, same bedroom in my parents house, same loneliness, except somehow worse because I've known not being lonely but been left behind every time due to how worthless I am. Depression, anxiety, ADHD, possible autism and bpd.\n\nI desperately can't deal with being me anymore. I can't take this, I can't I can't I can't I can't I can't. Please help me. Please ",
    "score": 17,
    "created_utc": 1746068236.0,
    "subreddit": "depression",
    "id": "1kbyovk"
  },
  {
    "title": "i’m about to kill myself and end it all",
    "text": "i am 13 years old and i have been thinking about killing myself since i was 10 \n\nmy parents make my life a living hell where everything is about grades and missing assignments and i just want to stop my life here and make the end now \n\ni don’t want to talk to any professional or adult about this because they will give me the same bullshit about seeking therapy and that shit\n\nmy life is boring as fuck and my birthday is next week should i do it after i turn 14 or before i turn 14\n\ni just want it to end ",
    "score": 19,
    "created_utc": 1746065812.0,
    "subreddit": "depression",
    "id": "1kbxy1g"
  },
  {
    "title": "I'm an idiot.",
    "text": "Hi all.\nI know it's a long post, sorry about that.\nIf you have any questions I'll probably be happy to answer them below.\n\nI'm 22, living at home.\nMy life is an unending series of disasters.\n\nPeople have always said I'm a hot head and I have problems with authority. That's just not the case. Recently 2 or 3 people have even used the word aggressive to describe me or how I come accross. I think that is because my breaking down has really started approaching critical levels in the last 1-3 years.\n(I'm not some aggressive beast who yells at people, I promise.)\n\nI have a problem with people who abuse me or others via their authority (it's pretty common if you open your eyes).\nI didn't get on well in primary school was always messing and in trouble and talking back to teachers etc. \nI'm smart and was raised well, largely avoiding physical fights, never bullied others, treating women well and so on and so forth.\nSecondary school was no better. I moved with my mum from my home town to the capital and left my dad behind. \nIn school I managed to conduct the first year fairly normally but by second year cracks were showing. By third year I had started skipping school, smoking, drinking and lots of dating. Covid hit in 5th year at which point I dropped out (not having a crystal ball to tell me about predicted grades, would have probably stayed if I knew I could get a reasonable grade with minimal work).\n\nStarted working full time around then and since then have been in and out of jobs up to now. 6 months working here, 2 months wasting time and nulling emotions there, and so on. \nI did survive 6-12 months in a few places but most of my employment has ended within 3-4 months for one reason or another. During 2020 to say 2022 ish, it felt easy to go from one place to another. I barely had to apply to a handful of places before I'd have another job offer. It's changed since then, and I've had a terribly hard time finding work. And the work I have found has been consistently lower quality (albeit always the same minimum wage pay). Think going from a grocery store -> nice office environment -> back to poxy retail.\n\nI'm not qualified for anything in any way other than retail really. I am hoping to start a course in the next few months which if I am successful will enable me to go and work in the field I want to work in. (After 18 months of getting through the course on a minimum wage job (if I can even find a new job))\n\nI recently lost my job while still in probation period.\nIt was brutal. It was unfair. Unwarranted. And it came from a manager who did everything to pretend they were my friend. (Trust me, I've now begun internalising the idea that nobody at work is my friend.) And it came just days after a devastating medical diagnoses for one of my parents, which I had shared just days before with that same manager who had told me how hard it was for them when their parent had a similar very serious health problem. (I wonder how much harder it would've been for them if they got f***ed out of their job during such a time...)\n\nI've never seriously studied anything, other than light research in personal time into all the various things I thought I was interested in before realising they were way too ambitious and/or unrealistic.\n\nI'm really struggling right now. I have no savings. I have no job. I have no qualifications. I have no career. I have no friends (except some who are far far away living their own happy lives). I've never achieved anything in my life. \nOne parent is gravely sick and I am taking public transport the length of the country every other day to act as a caretaker for them. My friends have gone to different countries to pursue their careers and more.\nI just feel like a massive fuckup every second of every day because I am and I want change but the realities of this world make me think it isn't worth living through. If I did decide to take my life I would probably go on a 'holiday' and go missing or something.\n\nI'm lonely. I'm tired. I have nothing to show for any/all of the effort I've ever given anything. I'm struggling to use logic to form reasons I shouldn't give up. \n\nI haven't dated in 2.5 years and my confidence in all aspects not just romantically has never been lower.\n\nI don't know if I can start fresh or rebuild from these foundations or lack thereof.\n\nI have no more money for food, travel, haircuts etc so I am living off my family. It feels shitty. I should have my own money. I should have a car and a life like my friends do. But I don't. Because I may not be a hot head but I sure do come across that way when I am faced with utter bullshit.\n\nDon't know how to end this post but thank you for taking the time to read or reply.\n\nI know things could be obviously worse but at the same time, I hope it's not selfish to say that that doesn't help me, and my life certainly isn't a walk in the park.",
    "score": 1,
    "created_utc": 1746124299.0,
    "subreddit": "depression",
    "id": "1kcfzuz"
  },
  {
    "title": "Why Do I Keep Trying?",
    "text": "Every time I try to change, I prove once again that I am incapable of any such thing. I can't be better. I only get worse. I'm a liar. I'm lazy. And for some reason, I don't try to make that change. Last time I brought up suicide, my parents were all, \"No, we love you so much, we'd be so sad if you did that.\" You know what would really happen? The lies stop. No more fighting with my brother. You no longer have to put up with my bullshit. You already ignore my mental health and you have two other kids who aren't as useless as I am. My family's better off without me.",
    "score": 2,
    "created_utc": 1746110657.0,
    "subreddit": "depression",
    "id": "1kcagoa"
  },
  {
    "title": "I don't feel comfortable in my own skin",
    "text": "I'm 19M and since I was a kid I have anxiety and self esteem issues, the type of when I was 6 years old I was already anxious to be with other kids in a daycare.\n\nmy parents never realized I'm this way, they think I am a stupid ass guy who doesn't care about anyone and do things like talking in a lower tone almost mumbling on purpose, or that I'm just very very very lazy when I don't want to go out solve something by myself, it's definitely not a excruciating lack of self esteem and me wanting to kill myself over my looks.\n\nthey really think I'm pretending or even most likely they don't even know I go through this since kindergarten, I do blame on them cuz they are two pieces of shit who think they do all is needed to have a functional son just because they feed me and offer habitation, but I know it's not their only fault, it's not their fault I was born with such an ugly face, hair and the most unsocioalizable mind that has ever happened to exist.",
    "score": 1,
    "created_utc": 1746124186.0,
    "subreddit": "depression",
    "id": "1kcfy6p"
  },
  {
    "title": "16 and tired of life",
    "text": "Im 16 turning 17 in a month, everything in life has been fucking me in the ass. Parents who don't gaf, financially fucked, and have no friends. I dropped out at 8th grade in highschool because of financial problems and depression and it's ruined my life, I have no friends and I'm always in my house rotting and crying. I had recently tried to gather motivation to continue and atleast graduate but now thinking about it, I'll have to suffer for a few more years only to end up with a low paying job that won't make me any happier. My only reason for living is my bf, currently we are in a ldr, and i really hope it would work out but realistically with my financial problems and visa issues, I doubt it's ever gonna happen. Hopeless, no plans for the future cause nothing excites me. I don't think I have any hobby or passions.. what is the point of life really, it's boring and dull and tiring ",
    "score": 5,
    "created_utc": 1746088937.0,
    "subreddit": "depression",
    "id": "1kc3xup"
  },
  {
    "title": "I've screwed myself (extortion, witchcraft and so on)",
    "text": "Notes: I speak Spanish, so I use a translator. Sorry for any spelling errors. This is an account I don't use, so I hope I'm not putting myself at risk. \n\nI (19 M) need help. This can be summed up as: I looked for trouble, created a problem, and now I'm panicking about the consequences of the problem I created. \n\nI am someone who believes in magic, logically I am not mentally well (lol), and a few days ago I was curious to know what it would be like to be bewitched or \"amarrado\" (latinamerican) So I googled a witch. I remember her page well because it had a gothic font and it caught my attention. I contacted her and paid her some money. Basically, I didn't have to do anything until we had a video call, you see, I was expecting weird candles and a weird spell, but in the video call he showed a \"voodoo\" doll of me and the person (I'll explain what happened later), I panicked when I saw that and his altar since it looked a little creepy and I just stopped thinking. When he mentioned that he would send me a package (she had my brother's address, because I gave it to him while I was shocked) with a medallion, the box with the voodoo and animals for me to kill them and bury them in a cemetery. She then mentioned that she could do it for a price, and I didn't really listen after that. I order her to cancel everything, and she told me it would have to be around $770 USD for that or they would tell the boy what he tried to do to him,  I hung up, blocked her, and deleted the chat (though it may not have been deleted entirely, I'm not good at this things). \n\n\nI confessed to my brother everything that happened, he was obviously upset and I'm scared that he's messed up everything, our years-long bestie relationship, the possibility of moving out, and his safety, I also had to confess it to his partner, because I had screwed them both. \n\nAfter a couple of hours, the \"leader\" showed me a video of the video call without my consent. In this video, I appear saying part of the \"spell\" I mentioned:  If I don't do this, I will give you the most beloved thing (to you, Saint Death). It was meant to embarrass me even more, but it was a stupid move, since in that video call his \"disciple\" revealed the killing of animals and even suggested stealing to get the money. She (the leader) also tried to roast me in a group of witches, saying, \"Does anyone know this guy? He opened a dangerous portal and now he could die, also I'm looking for the other one.\" She showed it to me saying that I should pay her $500 USD to not say anything to the boy and to \"close the portal.\" \n\nThe boy the spell was directed at wasn't even interesting to me, I only put him in because he was the only boy whose full name I remembered. But even that makes me see what a terrible person I was being. \n\nThis was two days ago (as I write this it's the third) and since then I haven't stopped feeling anxious, everything feels so unreal, and I've had suicidal thoughts again, which I haven't had since months ago. At this point, I don't want to kill myself or continue thinking about it, but I don't know what to do. He knows my full name, the man's name, my address, and my brother's and my phone numbers. \n\nI've been researching various forums to see what's done in these cases, but none of them screwed up as much as I did, or even worse than I did. So I decided to post my own case. ",
    "score": 1,
    "created_utc": 1746123872.0,
    "subreddit": "depression",
    "id": "1kcftoe"
  },
  {
    "title": "Life isn’t fair",
    "text": "I genuinely think that one of the biggest misconceptions we grow up with is the belief that life is fair. And as I grow older, as I become an adult, I realise that it’s not true.\n\nThe thing is, that some people are lucky. Some get the chance to realise their deepest dream, meeting their forever person, professional success, getting rich, whatever success looks like for them. But unfortunately, others out there have a string of bad luck after bad luck. Getting sick, losing the only person you care about, losing your job… the list goes on.\n\nI’m not saying that success depends only on luck, no. Sometimes, you really do have to put in the work. But again, unfortunately, you can work as hard and as smart as possible and still fail. You could be a good-hearted person, do everything right and still end up with a miserable life. While, out there, this bad person, seems to be living the perfect life.\n\nLife isn’t fair. And guess what ? I think it is okay. Maybe you should adjust your hopes and dreams based on what you have. You can't change the direction of the wind, but you can adjust your sails. Go with the flow and adapt to the situation in front of you. Because I truly think some people spend more time complaining than taking action.\n\nI just wanted to share this. Maybe it will help someone, like it helped me.  \nIt’s okay to fail where others succeeded. It’s okay to let go of that childhood dream. Live your life the way you want, because it’s yours — as long as you're not hurting anyone or doing something illegal, of course. And especially for those in this subreddit: you already have your mental illness to deal with, so don’t add more weight to an already heavy load. *(And keep taking your meds, lol.)*",
    "score": 1,
    "created_utc": 1746123866.0,
    "subreddit": "depression",
    "id": "1kcftko"
  },
  {
    "title": "My wife doesn't understand why her and my son are not enough",
    "text": "I've been numb and depressed since I was roughly 12 years old. That's when I had my first suicidal ideation. Even medicated, I think constantly about ending it all. There's just no point to this rat race to just line some billionaires pockets. \n\nBut my wife takes it personally. She feels like every time I come to her to confide my depression and ideation, that I'm basically saying her and my son aren't good enough to want to keep living for. I try to explain that this is just how my brain has always worked. Even now, being on enough pills to tranquilize a horse, I still think life isn't worth it. But I continue for them, because I know leaving them would make their lives infinitely worse and I could never do that to them.\n\nIt's just been so hard, losing my brother, losing bother my parents to cancer, when my mom was my previous reason for living before my wife and son. No matter what I do, there will always be that hole in my heart.\n\nHow do I explain to her that she is good enough, and that they're literally the only reason I am still alive? My wife has dealt with suicidal depression before, but she gaslit herself into being satisfied with life. But I just can't. My love for them is what keeps me going despite all the bullshit this life throws my way. I just wish she understood it's not something personal against her.",
    "score": 1,
    "created_utc": 1746123703.0,
    "subreddit": "depression",
    "id": "1kcfr96"
  },
  {
    "title": "I want to care but feel like I can’t",
    "text": "Hi, i’m in my mid 30’s. My dreams feel like they’ve died. I fight with my partner over minor things and they blow up. I barely see my friends. Work isn’t terrible but I’m in terrible debt. Blah blah blah… i just feel like I don’t have the will or care to go on. I have severe depression like you guys and lately its been hitting differently. I don’t have any plans to end myself but I’m in a place where I would welcome it if fate were to kill me. I’m just tired all the time. I come home from work and sleep just to go back to work and then come home again to take another nap. My partner points out alot of my flaws and I genuinely thought I was doing better but they notice I’m not and it creates tension in our home. I feel like i’ve given a lot to them just to be told it’s not enough. I feel like i’ve let my mom down. The only joy I find is video games and even then…they are starting to feel like nothing. I just feel like everything has gotten so pointless. Like I’m going nowhere or the people around me are frustrated with me and I don’t want to deal with anything. I want to go home to take another nap. ",
    "score": 1,
    "created_utc": 1746123631.0,
    "subreddit": "depression",
    "id": "1kcfq78"
  },
  {
    "title": "Stuck in a rut?",
    "text": "I've gained 2 kg the last couple weeks when i was supposed to start losing weight, to be fair I've been eating a lot worse and more the last week than i usually do, I'm now officially overweight (-\\_\\_-). I've been struggling with mental health for many years, quit my job a year and a half ago and stopped going outside. I want to spend time going on walks or exercising outside, or even going to the gym, but i have social anxiety and can't really go anywhere by myself. My hair is a mess, my skin is awfull, I'm doing irreperable damage to my body as we speak... I hate looking and feeling like this ",
    "score": 1,
    "created_utc": 1746123483.0,
    "subreddit": "depression",
    "id": "1kcfo49"
  },
  {
    "title": "The more I think about my life the more I realize I'm extremely dumb",
    "text": "Why do I have to be the one person lacking in everything? I gave 3 interviews and didn't get a call for even one. I dated my now husband and never focused on setting up a good channel for communication and just got caught up in bloody hormones. I ask stupid questions all the time. I am always mentally behind. I was thinking the other day about my first summer internship and wasn't even remotely in consideration as a decent employee because I didn't know anything. What is wrong with me and why can't I just die?",
    "score": 1,
    "created_utc": 1746123061.0,
    "subreddit": "depression",
    "id": "1kcfi59"
  },
  {
    "title": "Leave of absence",
    "text": "Has anyone had to take a leave of absence from work due to their depression/mental health. I’m going through a really difficult time right now and I’m highly considering it. But I just started a new job and I can’t really afford to not have an income. \n\nTIA",
    "score": 3,
    "created_utc": 1746101037.0,
    "subreddit": "depression",
    "id": "1kc717j"
  },
  {
    "title": "I’m having a mental breakdown",
    "text": "It’s fair to say that i’m slowly losing my sanity and having a mental breakdown\n\nMy special friend i lost around a year ago,all the people that i hurt and hurt me and the people that backstabbed me around that time\n\nMany toxic people i met after the fact,i platform i was ousted from because of a 2 faced bitch who claimed to love me but only wanted to destory me\n\nI’m even remembering people from my life from many years ago,people that still hurt like scars to this day…even someone important of my life that still comes back to my mind of this day\n\n\nThat person i was close with that’s not a shell of themselves…i always say i need a special person or i need to be surrounded by people to be happy but in actual fact…i think even if i had them now my mind would be terirating\n\nI was on team fortress 2 with my friend earlier and all i was thinking about was revenge on a person that hurt me recently…other people that left scars on me…people heck that may still be around certain parts of interwebs\n\nPeople that hate me,people that wont listen to me,people that make unfair judgements on me peoole that wont learn the truth people that wont hear me out\n\nIt’s all consuming and honestly i feel myself spriling to a point of contemplating my own life again…all these situations all these people…all these memories and thoughts are tearing me apart…are breaking me down…are making me to a point i don’t want to be here anymore\n\nAnd i don’t know how to get these voices to shut up,how i get these people to leave my mind…how i get all this pain and baggage to go away…\n\nEven in this post right here…what are they empty meaningless words…sure someone is reading them…but what difference does it make?\n\nSure give some words of comfort say everything will be fine…but if playing a game with one of my best friends that has been one of the few ways of escapism for awhile doesn’t even manage to work anymore what realistically will…there is even a huge match with my football team tonight that will literally decide the future or my club and i can’t even bring myself to focus on it\n\nWhat will having the right person do…what will having the right people do…when all i can think about is the countless upon countless of people that despite and hate my guts and wont hear any different…\n\nI wish i could just leave this planet behind but i know it’s all a pipe dream…i want to be happy…i want to find peace…i want to make a future for myself i want to find happiness but i just cant…",
    "score": 1,
    "created_utc": 1746122469.0,
    "subreddit": "depression",
    "id": "1kcf9fu"
  },
  {
    "title": "nothing works anymore",
    "text": "venting to friends, talking with my psychologist, trying to implement her techniques, talking with my school social worker... nothing makes me feel any better. only thing that allows me to escape for a while is sleeping and sometimes i still dream abt how bad i am",
    "score": 2,
    "created_utc": 1746108626.0,
    "subreddit": "depression",
    "id": "1kc9omr"
  },
  {
    "title": "doing nothing, help",
    "text": "\nHow do you stop doing nothing?\n\nI recently was put on a combo that made me stop feeling so shit and suicidal, but the issue remains that my life has become a doom scrolling nightmare. I literally will sit for days in my bed just scrolling on anything, obsessing about bipolar and reading in Reddit trying to find a solution.\n\n\nI am unable to keep a job for more than 2 weeks. 1 lost interest in almost everything. I wake up, scroll, eat breakfast, watch tv, scroll, shower, scroll, eat lunch, scroll, maybe tv again then sleep. I can't keep living like this. I feel like my days are wasted. I do have family, friends and also a boyfriend, but have not made efforts to deepen the connections. I am still applying for a job because I feel like it will help me break out of the cycle.\n\nAnyone experiencing something similar, what do you do with your time?\n",
    "score": 1,
    "created_utc": 1746122133.0,
    "subreddit": "depression",
    "id": "1kcf4dg"
  },
  {
    "title": "My life",
    "text": "Why can’t I just have love why am I so not being loved towards of",
    "score": 2,
    "created_utc": 1746108569.0,
    "subreddit": "depression",
    "id": "1kc9nux"
  },
  {
    "title": "They just took my car",
    "text": "My life is over I’m so sad because l really could have been someone great. I know it. ",
    "score": 1,
    "created_utc": 1746122094.0,
    "subreddit": "depression",
    "id": "1kcf3sp"
  },
  {
    "title": "A disappointment to myself and my mother",
    "text": "This is mainly just to get my thoughts out because,  I just can't anymore. I am a 30 f and my mother is so disappointed in me and she is right, because honestly, I am a disappointment. I have no plan for my future and still live at home. I do have a full time job but it doesn't really pay well. I tried the academic route, I even have a Master's degree but I still don't earn enough to move out. Having a plan just feels so difficult and everything around me feels so hard. I just can't get the basics right at all.\n\nToday, we had a massive fight about my contribution to the house. I feel like such a burden and useless person. I honestly wish that I never existed.\n\n",
    "score": 1,
    "created_utc": 1746121914.0,
    "subreddit": "depression",
    "id": "1kcf1aj"
  },
  {
    "title": "I’m 14 and already done living",
    "text": "I feel like every thing in my life has gone wrong Im Chronically ill and have chronic pain in every joint and muscle in my body my family treats me like a burden, I can barely walk, i do online school because of this I have no friends and I barely leave the house taking showers are hard I have to sit down in the shower to avoid passing out. Im two years behind in my school im trying to catch up but its hard the pain in my hands is terrible making it hard to catch up on my school. My family is poor we can barely afford food I have two pets and we are struggling to feed them I found ways on online to make a little bit of money to feed them I refuse to let them go hungry they are the only thing that makes me get up. Im on medication that doesn’t even work it just makes me tired. Im trying so hard but I don’t think I can keep going im mentally and physically exhausted I can’t do anything I like can barely take care on my pets and myself im ashamed to be 14 and barely able to walk I wish I was like other ppl my age I just can do this anymore. Sorry for any misspelling ",
    "score": 11,
    "created_utc": 1746074873.0,
    "subreddit": "depression",
    "id": "1kc0l1c"
  },
  {
    "title": "I am getting better",
    "text": "Whatever better is. I am depressed and have been that way for a long time. A lot of things have happened over the years. But for the sake of this post I had/have s*icidal ideation. I had a plan and a time and place. This is where I got better, a few years prior to turning 30 which is when I intended to d*e.\n\nBecause I had this plan in my head I pulled away from people. All people and while I didn't burn bridges. I did let them rot. For some I never bothered because I had an expiration date. At least I thought I did back then. Now I don't and am realising I never made any real connections. This depression and other issues started so young, I never tried to build relationships. I existed in my head a very very long time. Decades. \n\nAnd now I don't know how to build relarionships with people. I try but then I am just reminded of how broken I am when I try to keep a conversation going. Then I crawl back inside my own head where I built a safety bunker and hide behind jokes and the mask I built to function on automatic so no one sees me d*e a little inside.\n\nNow I am here looking for advice on redit because therapists are expensive and I got nowhere else to go. (Obligatory haha)\n\n(Sorry for the * I didn't want to post and get my post deleted or something, this took a lot of effort for me to write)",
    "score": 2,
    "created_utc": 1746107552.0,
    "subreddit": "depression",
    "id": "1kc99lm"
  },
  {
    "title": "Life seems to be",
    "text": "Billions of ppl trying to keep up, trying to be happy, while navigating hardship in some way shape or form. Poor ppl feel money would solve everything. Rich ppl still battle things. Maybe loneliness, a health issue etc. A man was drafted into the NFL, but his mom passed away the same day. You can get in an accident, food poisoning, live a long life but grieving those you lost. I experienced a severe mental health crisis due to a medication and although I got a second chance to get my life back, I didn't take it. Feeling too defeated from what happened. Made me realize that people's lives keep changing for the worst in the blink of an eye and the longer you live horrible moments are inevitable. One day you will lose someone that you can't think of living without and be changed forever. I'm just feeling like I don't want to go through any more hardships. My mental can't take it. Having to stay protected from the devil. Having to isolate myself from ppl that are suppose to be family and care about me. Having to question intentions. I believe in God and don't want to disrespect him by acting like my life is disposable but I'm so tired. ",
    "score": 1,
    "created_utc": 1746121094.0,
    "subreddit": "depression",
    "id": "1kcep4q"
  },
  {
    "title": "Its scary how depression can seem like dementia",
    "text": "I remember I used to think I was developing dementia, I was in my head all the time, I didn't know what I was doing, I couldn't remember anything. With help it's gotten better and now thinking back to how I felt then it scares me that I may get like that again, I don't want to go back",
    "score": 8,
    "created_utc": 1746083027.0,
    "subreddit": "depression",
    "id": "1kc2mal"
  },
  {
    "title": "Depression makes me selfish",
    "text": "My sister told me that I was hurting everyone around me by being depressed.\n\nI've never asked for anything from her, never trauma dumped to my family, always kept to myself no matter how badly I would break down. But just me existing with depression is enough to make things worse for the people I care about.\n\nI'm sorry. I didn't know. I was only scraping by because I thought suicide would hurt those around me, but I didn't realize that I was already hurting you. I was too focused on making up reasons to make it to tomorrow that I stopped thinking about how other people felt. I was too busy hating myself that I didn't think about how it impacted others. I hate that. I really thought I was better than that.\n\nI really can't live feeling like this.\n\nI'll be a better liar for them then. I'll even trick myself with these honest lies and these half truths. \n\nI'm never lurking or posting here ever again.\n\nI'm better now :)",
    "score": 9,
    "created_utc": 1746080375.0,
    "subreddit": "depression",
    "id": "1kc1zfb"
  },
  {
    "title": "Am i depressed",
    "text": "Hi so i am 17years old and a male if that helps so i am wondering if i am depressed for the last year it started when i fell in love with a girl i was head over heels we loved the same music we both loved cars we had the same personality i thought i found “the love of my life” so i asked her out to go with me to a big car event so i bought tickets everything and then she blocked me and never said anything to me after that or so i have been feeling constantly sad i feel like i am just existing instead actually living i feel like i wanna cry constantly i want to cry constantly i want to be sad i feel like shit all the time and i dont feel like i am gonna last 5 more years and also if i were to die i feel like nobody would cry about it or come to my “funeral”\nAnd i dont feel like i wanna be happy i only wanna be sad i only want to cry \n",
    "score": 2,
    "created_utc": 1746107129.0,
    "subreddit": "depression",
    "id": "1kc93xm"
  },
  {
    "title": "How to spot depression?",
    "text": "This is pretty much that but with the details. \n\nHi yall,\n\nI’ve been noticing quite a few signs that I think are not normal. My partner has suffered with depression in that past and has made an attempt to before (around 14). Their room is never clean and as much as I dont mind much however it concerns me, they don’t shower often however do skincare every other night. They don’t ever wanna seem to go out and try avoiding getting out of the house as much as possible. They hate getting out of bed to do anything and either forget to eat or eat a meal a day. \nThey do cook when I come around around twice per day for us to eat and make snacks through out the day for us as I have picked up on the low eating a while back due to an ed that has gotten better over the years with me refusing time eat unless they do. \n\nI’m not sure if they are depressed as they have a tendency to hide their feeling and I’m not sure how I can support them or what I can do so if there is any insight on this please feel free to comment.\n\nThank you in advance. ",
    "score": 1,
    "created_utc": 1746120528.0,
    "subreddit": "depression",
    "id": "1kcegt6"
  },
  {
    "title": "I don't want to answer...",
    "text": "I am furious right now! My grandmother keeps on asking me why I wasn't able to give the school entrance exam if it was so easy! AND I DON'T KNOW MAYBE BECAUSE I AM REALLY STUPID \nI don't want to give the entrance exam again in 4 days or look at the teacher who was there last time or have to give the interview again..\n\nAs well as my main exam result are going to come and this will add extra problem for me BECAUSE I AM CAN'T DO SHIT \n\nI want to kill myself... maybe end of this week I will or before that ",
    "score": 1,
    "created_utc": 1746120068.0,
    "subreddit": "depression",
    "id": "1kcea64"
  },
  {
    "title": "My family hates me.",
    "text": "I don’t have a good relationship with them so when I die I won’t have the guilt to leave them all behind.",
    "score": 3,
    "created_utc": 1746098322.0,
    "subreddit": "depression",
    "id": "1kc683v"
  },
  {
    "title": "I'm struggling with severe anxiety and depression, and I feel completely stuck",
    "text": "\nI’ve been going through intense anxiety attacks almost every day for the past six months. They get so bad that I feel like I’m about to die. I cry a lot, and whenever my mom hears me, she yells at me instead of trying to understand. She always asks, \"Why are you crying again?\" like I’m not allowed to feel what I feel.\n\nI keep telling her I need to see a therapist, but every time I bring it up, she gets nervous or angry. Once, she even insulted the therapist I had reached out to, calling her a liar. That therapist had told me I was dealing with severe depression, and honestly, it made sense. But I had to stop seeing her because I couldn’t afford it anymore.\n\nI used to be a brilliant engineering student. I was doing well, even landed an internship a few months ago. I had money, some sense of purpose. But now I’m broke, stuck in bed most days, unable to work on my thesis for months. I have no friends, no social life, no support system.\n\nI’m just existing. Barely. And I don’t know what to do anymore.",
    "score": 2,
    "created_utc": 1746106129.0,
    "subreddit": "depression",
    "id": "1kc8qo8"
  },
  {
    "title": "M going thru a rare serious problem cz of mdma",
    "text": "{ sorry for my English)Before i took mdma for the first time.. i was thinking  i have a good heart .. and i was doing everything to prove that to my self... For example my music test is Justin Bieber - one direction.... I was doing good deeds like giving from my self to people even if i don't have it ... But i was expecting return from everything i do ... And that's caused me depression since long time ago... ( Realized that after i took mdma ) ... But .. i took mdma with my friend ..  and he saw a Devil in me .   Despite i was doing this.    I hate everything ... I hate people ..( here where my problem begin ) once while i was rolling on mdma ..my friend understood that i hate everything so he was talking about him doing weed and i hated that cz i didn't want to be addicted to anything anymore or maybe cz I'm jealous from him smoking weed? That's what he said ..  she shocked me ( he was talking in Normal way then when he reached to point where he talked about weed part .. he yelled saying don't let burn in your heart ..i was rolling so high on mdma and then suddenly  i woke up from it and since then I can't hide anything..  literally everything ... I can't control my face anymore .. this story happened 10 months ago ... M still going thru this until this day ) u may actually say why i didn't go to doctor ... I didn't know about it .i thought i was controlling my face.. And no one told me about it even my parents cz they wanted to see what inside my heart ... I know it's crazy and no sense story .. but it's true ... Everyone now knows that i hate them and i hate the place I'm living in ... Everyone knows about it before me  .... What should i do please.!! Did anyone been thru this ? That's the first time i open up about this cz there's no place where i can post this and people understand!!! I searched it on Google and didn't find any answers... Guess cz I'm the first person going thru this ",
    "score": 2,
    "created_utc": 1746106087.0,
    "subreddit": "depression",
    "id": "1kc8q55"
  },
  {
    "title": "how do i tell my parents (or atleast hint) that i am depressed",
    "text": "hello, i am just an average teenager from iraq. i started feeling depressed years ago. thought nothing of it..i just thought it was a phase. a few years later and here i am, contemplating whether i should jump or just deal with it. i want to get better..i absolutely hate this feeling. i cry myself to sleep everyday..i want help but i dunno how to ask for it. especially in this country..because if i say im depressed they will just try passing it on with prayers. not saying that i am not a muslim myself..but i want actual help. how do i make my parents aware that i am depressed",
    "score": 1,
    "created_utc": 1746119586.0,
    "subreddit": "depression",
    "id": "1kce2wd"
  },
  {
    "title": "how bad am i?",
    "text": "How bad is it to have multiple specific and detailed suicide plans even though I don't necessarily want to kill myself right now (I was suicidal in the past). I feel like I'm sort of just preparing myself for something inevitable in my future. How bad is that?",
    "score": 1,
    "created_utc": 1746118952.0,
    "subreddit": "depression",
    "id": "1kcdtu5"
  },
  {
    "title": "I feel nothing",
    "text": "I just feel empty. My hobbies dont mean nothing, eating dont mean nothing, there isnt a single thing that brings me pleasure or joy. I dont even feel the usual \"i feel sorry for myself\" sadness theres just nothing. I could win a million dollar right now and it wouldnt mean shit because i cant think of a single thing that would bring joy anymore. \nThere is no point to anything, im just passing time. Im supposed to be angry and sad that my friends arent hanging out with me but i dont even feel that. \nJust nothing.\nIts really hard to keep going like this.",
    "score": 1,
    "created_utc": 1746118460.0,
    "subreddit": "depression",
    "id": "1kcdmoy"
  },
  {
    "title": "How do I overcome not wanting to exist?",
    "text": "I have dealt with depression for more than 20 years. For the last few, I am constantly in a state of just not wanting to exist. I don’t really share a connection with anyone, nor do I find anything anymore that brings any lasting happiness or joy. The only thing I look forward to each day is a dreamless sleep where for a few hours (even if it feels pretty instant) I get to experience not being, or at least a semblance of it.\n\nHas anyone dealt with this crippling desire to just not exist, and was there anything you were able to do to move past it? I have talked to my wife about it, but she just gives me a hug and goes “there there” which doesn’t really help.\n",
    "score": 1,
    "created_utc": 1746118276.0,
    "subreddit": "depression",
    "id": "1kcdk3p"
  },
  {
    "title": "Need advice on opening up",
    "text": "(sorry for spelling errors, English isn't my first language)\nHi! I've been dealing with depression for a while now. My family know about my mental health, but I never told them the full extend of it. That was until I opened up to one of my siblings, hoping it would make me feel better. But the opposite happened. I felt extremely ashamed of my feelings, and ever since that day I told myself to hide them. Apparantely it works, because everyone seems to think I'm cured just because I smile more. However, atm I feel worse than I ever did before. Recently, I've gone back to self harm and been having suicidal thoughts basically all day every day. I'm a bit torn between opening up or keeping it to myself. I don't want people to worry, and I don't want them thinking I'm weird for it. But at the same time it's getting really really bad now, to a point where I've had times where I didn't feel safe with myself. \nCould you please give me some advice on what I should do? If you think I should open up, please tell my why you think that. Thanks a lot!",
    "score": 2,
    "created_utc": 1746104394.0,
    "subreddit": "depression",
    "id": "1kc845z"
  },
  {
    "title": "Wake therapy helps/cures Depression and Anhedonia",
    "text": "I want to spread awareness for wake therapy. Its a therapy that can help reduce or even cure depression temporarily. It was a therapy used before medication existed. I do Wake therapy once every 2 weeks and the effects are great. I can feel more emotions, I feel more positive, I feel LESS tired, my concentration is boosted\n\nI made a detailed scientific explanation on Wake therapy a few months ago:\n\n[https://www.reddit.com/r/anhedonia/comments/1if2dc7/wake\\_therapy\\_for\\_depression\\_and\\_anhedonia\\_it\\_works/](https://www.reddit.com/r/anhedonia/comments/1if2dc7/wake_therapy_for_depression_and_anhedonia_it_works/)\n\nRead everything because there is important information there like combining it with light therapy for optimal results. \n\nThis is not medical advice, I only share the lots of research that I found",
    "score": 1,
    "created_utc": 1746117940.0,
    "subreddit": "depression",
    "id": "1kcdf8h"
  },
  {
    "title": "I'm wasting every opportunity to get better",
    "text": "Life gives me alot of opportunities to get better and get out of this hole, I wasted them all and I guess im wasting the one I have now, even though its dark right now, when I look back i would wish to take action but i dont.",
    "score": 0,
    "created_utc": 1746117621.0,
    "subreddit": "depression",
    "id": "1kcdakp"
  },
  {
    "title": "I'm tired of struggling..",
    "text": "I've struggled for as long as I can remember. My parents shouldn't have had me as they weren't prepared to raise a life. From abuse and neglect to today I have done nothing but struggle since I was little. I struggle to be someone, to function every day, to be accepted in any social manner. I've struggled to just exist and be a functioning value to society so much so that I'm socially awkward and mostly not accepted amongst social norms. I'm too busy trying to not seem like a dramatic mental mess that I just can't function well outside of that. \n\nI'm tired and I don't know what the point is anymore. I would've given anything to not be stuck like this since I was 7. I can't help but wonder and worry for the future as I feel like I'm losing my grasp on caring enough to continue forward. \n\nThis'll probably just go empty like usually. Thanks. ",
    "score": 1,
    "created_utc": 1746117573.0,
    "subreddit": "depression",
    "id": "1kcd9uh"
  }
]