[
  {
    "title": "I just spent $60 for the most disappointing BJ ever",
    "text": "I’ve never thought of prostitutes before. But I’ve been so incredibly busy with life and work for the last two years or more, I haven’t dated anybody in that time or even gone out with anyone.\n\nI’m not exactly flattering and I don’t quite have the time to go to night life to try my luck there.\n\nI was just SO horny. So impulsively I pulled up to the area in my city known for having prostitutes going up and down the street looking for business. My goal was to pay for some cheap hole to stick into that was at least an actual vagina, bust, and leave.\n\nI felt so awkward and didn’t even have the balls to tell her I wanted to fk her hole and leave and be done, I just went with “I don’t know yet”, got her into my car and went with the flow.\n\nUuuhh “the flow” ended up in me paying $20 for her to get some shit at a gas station, then pull up to some random apartment complex where we had to be so sneaky I couldn’t even TRY to enjoy it, and denied pussy for that very reason when I asked.\n\nI settled for a BJ that I couldn’t even get hard for. And she charged me $40 for it.\n\nUltimately it’s okay, an overwhelmingly disappointing blowjob at a sketchy area of town with all the risk involved with no repercussions was well worth the $60 looking back. Could’ve been a lot worse, got the wrong person in my car, busted by cops, who knows.\n\nThanks for reading if you did, I just needed to get it out somewhere and there’s zero chance I’m telling this to a single soul ever.\n\n**REFLECTION UPDATE**\n\nAlright I thought about this for a while since I posted this and finally came up with how I wanted to word the answer I was looking for to all the people saying I dehumanized this woman by calling her a cheap hole.\n\nI‘ll admit I am an asshole when it comes to wording, I don’t sugar coat bullshit and I called her a cheap hole cause that’s what she is. What do you rather I had called her? A bargain promiscuous lady? Lmfao. Like alright I can call her a cheap sex worker, but why bullshit? She a street hoe. I’m an asshole. That doesn’t mean I think less of her. I can simultaneously call people out for what they are while also respecting their choices - believe it or not in such a CRAZY concept. I treated her very nicely from start to end precisely cause I was respectful that she’s providing me a service. I stopped her mid sucking my limp dick cause I felt BAD for her for dealing with a soft guy for the last 10min and wanted to let her go her way. I would not be surprised if I was actually the person who treated her the nicest the entire night. And I didn’t treat her nicely as means to an end, I treated her nicely cause every human deserves to be treated well. Regardless of profession, race, ethnicity, sexual orientation, etc. unless they specifically done something to you that warrants it.\n\nBut if you a bum I’ll call you a bum, if you’re a bitch I’ll call you a bitch, if you’re an asshole you’re an asshole, if you’re a hoe you’re a hoe. Why are some words okay and others not? You all called me asshole, shouldn’t you have respected me and called me an unpleasant guy? LOL no you called me for what I was.\n\nI did not call her a cheap hole to dehumanize her or with the intention to disrespect her, however, that’s what Y’ALL assumed from the wording. You’re free to not believe me, and think because I used the word cheap hole there’s somehow no way I still believe she deserves to be treated well. I respect hoes, they’re just doing their thing, making their money. I treat them with respect and I’m always polite, but if you’re a hoe you’re a hoe and that’s okay.\n\nI can both call you a hoe and still respect you as a human being, I’m just choosing not to use some more socially acceptable word in order to be presentable. On that end I am an asshole and I’ll admit to it. If you’re a hoe be a hoe, don’t be offended someone calls you a hoe - that’s what you are?? With that said I’m not gonna treat you as less of a person.\n\nMy sister is a stripper, she had only fans before and many partners. I’d tell her and people who’d ask to go out with her that she’s a hoe, why? Cause she was a hoe like tf? She never took offense to it cause it was the truth. I ain’t gonna call her prude cause she’s not. I simultaneously did not judge her choices one bit and would not let someone think less or disrespect my sister because she is a stripper and had an only fans. If calling someone an at best controversial word despite being what they actually are is highly offensive to you idc get off your snowflake island. I still respect them regardless, I just don’t act like a pussy and use more “acceptable terms” to convey it.\n\nI think it’s real silly for any sex worker to get offended by being told how things are: she was a $40 BJ from the middle of the street. She was a street hoe. That doesn’t mean I treated her less than she deserved or called her that in my story to dehumanize her, it’s just how y’all perceived it. And deduced my entire personality as someone who doesn’t respect others. If your standards start with what word I choose to call someone, yeah you lost me there - definitely the asshole in that case. I won’t treat you anything but well though.\n\nCheck all my fkn replies. Did I call anyone any names? Curse anybody out? Acted disrespectful towards anyone? Tried to fight anyone wishing me terrible things? I did not. Matter fact I believe I held myself very reasonably this entire time. If I was a disgusting pig who doesn’t respect others, or women for that matter, how come I’m so polite to everyone who’s been judging me? Beats me bro.",
    "score": 1758,
    "created_utc": 1746097066.0,
    "subreddit": "confession",
    "id": "1kc5vg0"
  },
  {
    "title": "I lied about the pain during my colonoscopy to get more fentanyl",
    "text": "During my pre-colonoscopy appointment I was told that the local anaesthesia I would be given fentanyl. And so knowing that this would probably be the only time to experience it I was honestly excited. To preface this was about a year ago and I hadn’t tried any other drug apart from weed and mushrooms at that point.\n\nTo preface I’ve always been curious about the feelings of different highs from different drugs. With all the negativity surrounding fentanyl I knew this would be the best time to experience it.\n\nFast forward to the beginning of my colonoscopy, I was to let them know if I was experiencing pain and a lot of discomfort. \n\nI get injected with my starting dose and they start the operation and whilst I still feel the effects of it - it wasn’t really a euphoric or energetic high, but a drowsy and blissful sort of one. So I’m laying there on the ‘hospital bed’ (idk) just watching the camera go through my insides and I just can’t help but wonder if I could get some more because I wasn’t really feeling any euphoria. \n\nI then begin to make fake grunting sounds as if I’m in pain and one of the nurses holds my hand and tells me to squeeze if I’m in pain. I squeeze and they then give me some more. As they’re injecting me with it they tell me that this is the most they’re giving me (which was a lie for some reason, I’ll go into that later). I start feeling like I’m being absorbed into the bed. \n\nSome time goes by (no clue how much) and the same thought pops up again - “I wonder what more feels like. It’s not like I’m gonna die of an overdose surrounded by all of these doctors right?\n\nMore grunting and moaning sounds later I’m being injected with more despite being told that the previous dose was the last one (I may be misremembering and that this was when I was told it was the last dose but I’m almost certain they told me that twice including this time).\n\nI’m feeling super light now and feel like I could just look at the wall forever laying there on that bed. That’s all I really remember up to that point. I barely remember the end of the colonoscopy and don’t remember being wheeled into another room after it ended. \n\nI do however remember, after being wheeled into another room, listening to some type of calming instrumental music on my phone. A doctor walked in to check my vitals and he asked what I was listening to and I said rock music for some reason (I don’t even listen to rock or anything like it). He then asked who my favourite rock band was or something like that and I replied Michael Jackson not even in a joking manner or anything idk wtf possessed me to even say rock or Michael Jackson. He then just left the room I don’t really remember his reaction, he didn’t really have any to my recollection. \n\nBut that was about it, I was in that room for a couple more hours until I was picked up by my mom to be taken home or I would’ve had to have been there for 24 hours. \n\n",
    "score": 278,
    "created_utc": 1746117855.0,
    "subreddit": "confession",
    "id": "1kcddy6"
  },
  {
    "title": "Got a massage in another country but didn’t end up how I planned.",
    "text": "Throwaway because my wife views my main account. \n\nI went to the Philippines for a work trip and when checking into the hotel the front desk asked if I wanted a massage charged to the room. She said it would be $18USD for 1 hour. That was a no brainer for me so I told her let’s do it. Called to talk to my wife and told her about it and she joked “don’t be getting no happy endings”, which I laughed because I honestly had never thought of that. \n\nThe massage person ended up coming to my room and I took off my clothes and laid on the bed and she covered my butt with a small towel. She began the massage and I slowly was drifting into a purely relaxed mode. It must have been about 20-30 min but I heard her tell me to turn over, which I did. She covered my penis area with the towel and proceeded to massage my feet and legs. I’m not sure what got me but when she would rub my leg, the top of her hand would slightly brush against my penis. It was nothing for a bit but all of the sudden I began to become harder and harder to which she noticed and chuckled. She moved down towards my ankle and calf but I  could not get my erection to calm down. The towel then fell off my penis because of the erection and I didn’t know what to do, and all of the sudden I felt this massive buildup in me and realized I was about to cum. I froze with fear and she kept rubbing my calf’s and then all of the sudden I just exploded, right there in front of her. She looked very surprised and I was super embarrassed. She cleaned me up and the massage came to an end about 10 min later. I apologized to her and gave her a decent tip and was hoping I would never see her again. \n\nI talked to my wife that next day and she asked how it went and I told her it went great and nothing else. I felt so incredibly bad that I had lied to her and not told her about it. I’m not sure if I was in the wrong but it sure felt like it so I kept quiet. This has been eating me up for years and I just want to find a way to tell her. ",
    "score": 3821,
    "created_utc": 1746051653.0,
    "subreddit": "confession",
    "id": "1kbt586"
  },
  {
    "title": "I’m pretty sure I once mistakenly had a sugar mama.",
    "text": "I went into the 2020 pandemic during the biggest breakup of my life. (At that point). \n\nSoon enough, Nicole came along. \n\nShe requested to follow me late one night on IG, so I shot my shot. \n\nBefore I knew it, we were on the phone, talking, exchanging secrets, etc. \n\nTikTok was pretty big back then considering people were trapped in their houses.\n\nI saw a video that day claiming that women fantasize about sex 43 times a day on average. \n\nI decide to bring it up. Before you know it, I spun a lie to make her horny enough to start rubbing with me on the phone. \n\n(I have a sexy voice and active imagination). \n\nWe were pretty serious for a day and a half or so, then I realized it couldn’t really go anywhere cause we came from very different backgrounds. \n\nEventually, she became a very good friend. \n\nShe’d send me money regularly, buy me food, and most importantly was there for me when I needed. (I returned the favor). \n\nEventually when I was aware of her sexuality, I’d literally FaceTime her, pull my dick out, she’d sarcastically roll her eyes, put on a show for me, let me finish, and we’d hang up. \n\nShe even sent me birthday money once.\n\nEventually she got really involved with her boyfriend, so she disappeared for a few months. \n\nSomeone close to her let me know that after it ended, she’d been looking to talk to me. \n\nI find out that one night while we were having phone sex, her boyfriend was sleeping on another phone in the background. (Very funny, but suckish for the guy). \n\nThen she eventually found someone new who I encouraged her to go after. Pretty sure they’re married. \n\nI miss her doe. \n\n(Just wanted to post). ",
    "score": 49,
    "created_utc": 1746123391.0,
    "subreddit": "confession",
    "id": "1kcfmvn"
  },
  {
    "title": "As a kid, whenever my mom would upset me, I’d switch from calling her mom to ‘Mother’— which in my head was short for motherfucker.",
    "text": "🤓",
    "score": 49,
    "created_utc": 1746112302.0,
    "subreddit": "confession",
    "id": "1kcb4tm"
  },
  {
    "title": "I can't forgive myself for what I did in 7th grade.",
    "text": "In 7th grade, I was that guy who had 2 close friends(we were a trio). I used to talk to my classmates sometimes about random stuff but never made any friends. Me and my friends always used to sit together, we used to talk and laugh during lectures, but we never caused trouble for others. One day, the teacher separated the entire trio. I was made to sit next to a girl. She was nice to me. I let her copy notes sometimes. She helped me out too. I think we became friends then, we used to talk about movies, music, etc. Then other students started teasing me and her. They used to call us lovers and all. At first, I didn't bother. But then, things started getting out of hand. They wouldn't stop. They used to call me by her name when I passed by. I was really bothered by it. I tried to stop them. Even my friends stepped in to help, but it was of no use. One guy even wrote our name in heart on a bench with a marker. Then I completely stopped talking to her. I didn't want to be teased by others. She noticed the change and came and tried to talk about it. I just told her to leave me alone. She didn't have any friends. She was all alone. She had lost her mother, just 2 months before this happened. One could see that she was disturbed by that. She didn't express it much, but one could tell she was hurt because of how I pushed her away like that. Soon, she changed the school. My friends later told me, what I did was wrong. I regretted it. I am now a First Year college student. I recently saw her while I was on my way to college. I do not know if she saw me, or if she even remembers me. But, I very well remember her and am ashamed of my previous actions. I wanted to go up to her and talk to her and wanted to apologize but I couldn't. I just stood there watching her leave.",
    "score": 181,
    "created_utc": 1746080263.0,
    "subreddit": "confession",
    "id": "1kc1yd9"
  },
  {
    "title": "I chewed on my foot shavings because it had a nice texture",
    "text": "Sorry. This is a bit of a nasty confession I can't admit to anyone in real life. I have a habit of chewing on things because I like the texture. I've chewed on the soft parts of my fingers, beauty blender sponges and straws because it just feels so good to keep chewing.\n\nOne time, I was grooming myself and cutting my toenails. I noticed that I had a lot of dead skin on the sole of my foot, and decided to try cutting it off with a penknife since I'd done similar things to my calluses before. So I did, and I cut a really big thick round piece out (think 3mm thickness, 5cm diameter). It was the first time I had ever handled such a huge piece of thick skin, and I was really intrigued that this piece of thing was produced by my own body.\n\nHandling it just made me more curious because it had this firm but malleable texture that reminded me a bit of beef jerky. Then, the thought popped into my head: what would it feel like if I chewed it? So I did just that. \n\nI was right - it was chewy in an addictive way. There was just this resistance about the skin that made it so fun to keep chewing, so I just kept chewing on it lol.\n\nNo I didn't eat the skin, but I would probably chew on it again if I had more tbh.",
    "score": 1071,
    "created_utc": 1746030077.0,
    "subreddit": "confession",
    "id": "1kbkl35"
  },
  {
    "title": "I switched the difficulty of clair expedition 33 to story mode",
    "text": "No regrets I am enjoying it even more now. I am 47 year old, done my dues in gaming. ",
    "score": 10,
    "created_utc": 1746109762.0,
    "subreddit": "confession",
    "id": "1kca4dv"
  },
  {
    "title": "I messed up big time and I really don’t think I will forgive myself",
    "text": "Me 14 m was walking out of 4th period math class and went into the bathroom where I was told to record by a kid who was 16 m he had went up to a autistic student and punched his gut and I sat there and did nothing while still recording for 22 seconds minutes after that I had realized the serviety of the punch and the kid was coughing and groaning badly I ran out of the bathroom scared to get in trouble as I was close to expulsion and going to juvie I wanted to go back and check on him so bad I constantly texted him asking if he was ok and needed help I felt so bad now it’s been about 9 hours he’s hospitalized and I feel like shit I’ve cried 7 times knowing I could’ve stopped that if only I had just swung and not sit there I hope the kid is okay I’ve known him for a long time and he’s genuinely a kind and amazing well spirited kid and he’s hurt so bad I have tried to justified it but I feel like it shouldn’t be I deserve to be in as much trouble as the other student and I deserve my ass to get beat I really messed up this time and I don’t know what to say to him other then sorry just over and over ",
    "score": 72,
    "created_utc": 1746072255.0,
    "subreddit": "confession",
    "id": "1kbzv70"
  },
  {
    "title": "I’m a terrible person and I just need to get this off my chest",
    "text": "This is a reupload, but of my own story. I just kind of need some advice, harsh or nice, I am not the victim of the story and I am well aware that I’ve made a mistake that isn’t okay.\n\nI’m a reptile owner of many, I’ve literally never rehomed any of my reptiles and have always rescued my reptiles from neglectful situations. I’ve always fed them, housed them, and ensured what time I had with them was pleasant.\n\nRecently I’ve been noticing I wasn’t cut out for one of my rescues. I rescued him from someone else literally off of facebook marketplace, [I felt so bad for him,] and tried to give him a good life. He was an extremely flighty gecko, a look don’t touch. I couldn’t clean his cage or even put food within his cage bc of how flighty he was, and it made keeping him healthy and his space clean hard. Extremely difficult. And that’s not his fault at all. He had a spacious enclosure with lots of hiding spots to keep cover from the naked eye, which I thought would alleviate his stress. But regardless it didn’t, and I’m sure that’s due to his previous owner/s. \n\nRecently we’ve been having some wonderfully hot weather so I made an irrational decision to let him loose. No one wanted him when I tried to humanely rehome him and it was growing bad for him and I. He genuinely seemed so much more relieved once out of his enclosure in my yard.\n\nBut now he stays in this one tree outside my house. Literally, I go check on him every day. He seems to be doing well, still flighty and does not want to be touched or caught. He’s bright colors, often like I’d see when he was relaxed hanging out in his enclosure, or when he was enjoying high temps. \n\nIdk. I know this isn’t humane and I’d NEVER make this choice again..it’s so cruel and I hate myself for it, but at the same time he is genuinely thriving without living in that enclosure, and I see him daily even though people don’t know about it.\n\nI just wanted to confess this to someone else to read lol. I haven’t told anyone. I feel horrid. I would never make this choice again even with the hardest reptile. I just thought it was the best choice, and idk what I was thinking. I miss him a lot. He’s not dead, and is doing well where he is, but I still feel immense dread and guilt.\n\nI’m reuploading this merely because I just want people to read it, share an experience, share advice, whatever it provokes other people to do. Because it’s genuinely bothering me that I made this choice but I felt it was for the better. He seems so much happier and I just feel guilt because it’s traditionally extremely inhumane to do this. ",
    "score": 90,
    "created_utc": 1746064728.0,
    "subreddit": "confession",
    "id": "1kbxljv"
  },
  {
    "title": "I was touched multiple times by multiple different male male family members.",
    "text": "Uh this is my first ever post and I just feel like I need to get this off my chest. I will not be mentioning how old I am or any personal details about me as ik my family members use Reddit a lot to read AITA or the confessions. I was first touched at the age of 3 or 4 by my dad, It made me a very sexual child. Id fantasies about being an adult with a curvy body and I'd masturbate quite a bit. Back then I didn't understand what I was doing wrong because yes I would get caught. I would get in so much trouble but for some reason I couldn't help myself. I would wait until I was alone or when everyone was asleep. Well I vividly remember one night I was trying to sleep and I couldn't so I decided to touch myself. And as I was I saw my dad walk down the hallway, so I tried to pretend I was asleep so he wouldn't yell at me to go to sleep, well he ended up coming into my room and rubbing my body and my butt while. I asked him what he was doing (bare in mind I was like 3-5) he told me to shut up and then asked what I was doing, and why was I still awake. I told him I don't know and that's when he rubed inbetween my legs. I squirmed and then he left. I went to sleep maybe an hour later just to wake up again in a different bed with my pants down later in the night. He would leave and then come back to touch me. I remember crying almost every night knowing he was touching me there and I was too scared to tell anyone because he was also very mean to me. He would tell at me constantly. He would hit me. He would bully me all the time and then at night would touch me while I was asleep while my mother slept in the room next door. One day my mother said that we were moving and me and my siblings where all excited. I thought finally maybe I can get away from him and be okay. But when we moved it happened more. And two other family members on his side touched me as well. My older cousin made me lay on top of him while he grinded against my private parts while my younger cousin slept right next to us. And my uncle put his hand down my pants and touched me while sitting right next to my aunty (his wife, my dads sister). At this point I knew it wasn't right. But it wasn't until sex ed in grade 6-7 where I learnt what SA was. That's when I knew it was wrong. What they were doing was molestering me from a young age, yet still I was afraid to say anything so I kept quiet. I would smile and be happy while silently crying on the inside. this continued for years, my dad touching me more often my cousin and uncle only did it once from what I remember. But my dad continued to touch me for years after. It didn't stop till I was 14 or 15. I was in my room trying to sleep and that's when  he came in and tried to bribe me with my phone (mune and my siblings phones got taken off of us) saying \"I will give this back to you if you do me a favour. It will only take five minutes\" I knew what he wanted but I tried to play it off saying back \"what is it? A job? Like cleaning?\" He wouldn't tell me what if was and just kept saying that it would be quick and only take five minutes. He then tried to get on my bed and touch me but I jumped off and said \"no I know what you want and I don't want to. Stop\" and I walked into the lounge, all the lights were still on and my sister was watching tv on the couch. I pretended that everything was fine and sat next to her. He got very mad with me the look in his eyes where as if I had stabbed him almost like a \"how dare you\" and he took it out on me the next day making me do loads of chores and yelling at me. My mother yelled at me a lot that day too.\n\nVery sorry this is long. There is so many more incidents that I could definitely talk about but I feel this is so long already. I'm very sorry again and I understand if no one reads this I just really needed to get it off my chest. \n\nEdit: I only posted this a few minutes ago and already so many have given some kind words and advice. Thank you sm I will respond as much as I can. Also forgive me on the grammar. And spelling mistakes english isn't my first language I translated most of it through chat gpt and google.\n\nEdit #2: hello guys, thank you so much for your kind words and advice. However I keep debating whether I should have posted or not as I am getting very questionable DMS. I've just had a person say \"so you think your dad was right for touching you?\" I replied with \"no why are you asking\" to which they responded \"he must have felt strong urges to do that\". I asked why they were messaging those things and I got no reply I infact think they blocked me. I wish I could put in a screenshot but I don't know how. I'm sorry if my story had made people upset or mad. But this is my truth and I would appreciate it if I didn't get those sorts of messages. Thank you \n\nEdit#3: hey guys so a lot of you have been telling me to tell someone and I should have mentioned that I did tell one person. They were my closest person and I would talk to them about everything. They unfortunately moved far away when I was still little and they cut off the whole family I never knew why. I would try to reach out but it's like they fell off the earth. I miss them dearly and hope they are doing well but I still feel hurt sometimes as they haven't reached out after years. Thank you for the ongoing support ❤️‍🩹",
    "score": 370,
    "created_utc": 1746031720.0,
    "subreddit": "confession",
    "id": "1kbl8vp"
  },
  {
    "title": "Ive dropped 7kgs in the last 2 weeks but it's just from smoking way too much",
    "text": "Over the last week I've been getting a-lot of compliments from friends and family on my weight loss and I just tell everyone I've been eating less and working out but the reality is that I have one meal a day and 12-15 cigarettes for the rest of it. \n\nI think it might just be the stress from turning 25 and still not looking at any long term-relationships, which in my country, is a requirement to purchase a home.\n\nI wish I had lost the weight under better circumstances.",
    "score": 41,
    "created_utc": 1746066718.0,
    "subreddit": "confession",
    "id": "1kby82y"
  },
  {
    "title": "I lost my best friend and I don’t know how to make things right",
    "text": "Warnings: mentions alcohol use, suicide, abuse\n\nI lost my best friend and I don’t know how to make things right \n\nI (27F) had a friend from middle school through the first year of college - I’ll call her Shayla. \n\nShayla was a rock for me during a difficult period of bullying in middle school and part of high school. At the end of high school into college my anxiety and insecurity was getting bad. \n\nFreshman year of college I noticed Shayla started pulling away and our friendship changed. She got her first serious boyfriend who happened to live in the same dormitory on the same floor as I did, and she would come and go a lot without us seeing each other. She started going to a lot of social events with mutual friends that other close friends were included in, but I was excluded from. She started prioritizing some newer friendships, some with people that made me uncomfortable and openly made fun of me during gatherings. I started to cling to other circles of college friends and ignore it as best I could. I wanted to talk about it with her but didn't know how. \n\nTowards the end of that first year of college Shayla’s partner’s roommate, someone all of us in both circles knew very well since they lived in that same floor, ended up taking his own life. It was a terrible time, and it somehow created a weirder rift. I barely spoke to her the rest of that year. \n\nThe second year of college my anxiety was very bad and I started freaking out over little things that happened, and lashing out in small ways. \n\nExamples: Shayla unadded me on Snapchat, so I unadded her on Twitter. She'd post about a gathering with people from the first year that I didn't even know about, so I'd make a post about doing something with different friends. \n\nOne day I was walking to a meeting for a student group I was in. I passed her while she was walking with another friend, and neither of us said anything at all or even acknowledged each other. I was anxious about it and the same night I texted her asking to hang out, and she said she couldn't that weekend, but would take a rain check. I ruminated on it intensely, to the point where I felt physically sick, and then that same day I went nuclear. I just blocked her number completely. I also deleted my social media because I was tired of seeing everything happening around me while I was sat up alone in a dorm most days. \n\nIn the next few months there was a social event both Shayla and I were invited to, and attended. We said nothing to each other. To make it worse a few of the people there were ones who had talked crap about me and bullied me during those earlier school days. Some friends later asked after that interaction why I didn't talk to her anymore, and I lied and said it was because she was talking crap about me. I didn't actually know that to be the case. I was so anxious about how quickly our friendship deteriorated, and how much I was shut out by her and the friends from that first year, that I didn't know how to explain what had happened. \n\nOne day towards the end of that second year of college Shayla actually emailed me asking if I wanted to hang out with her and and another mutual friend. I was really happy to hear from her, especially after such a difficult year, and I emailed back apologizing that my phone \"wasn't working\" (remember, I had blocked her) and saying I'd love to, asking about where and when. I never heard back. At that point I was distraught and feeling very alone so I went nuclear again and deleted her number. \n\nFast forward to the last year of school - I had reached a point where I had tried anything and everything to cope with my anxiety (except what I actually needed which was therapy, and maybe medication). I ended up using alcohol a lot and it led to a bad cycle of not taking care of myself, shutting people out, and overthinking absolutely everything - and of course it also made the anxiety worse. \n\nI was drunk at a party one night and ended up ranting to someone at the party. I didn't remember most things from that night but came to find out later that I had ranted about Shayla, and said she was talking crap about me and had said something bad about a different friend - we ll call her Andrea. That wasn't completely untrue; Shayla and I both gossiped with each other in high school and would say stuff to each other about other people like Andrea, who she had said some things about. But I shouldn't have said it at the party regardless.  Shayla and the Andrea weren't close and hadn't seen each other in a few years, but to this day I feel bad about causing a rift between them of any sort. Andrea asked me about it later that last year of college a few months after the party and I didn't correct it - I just reinforced the sort-of-lie, which I feel made it worse.\n\nThen came the end of college - shortly after graduation Shayla emailed me saying she felt bad we grew apart, asking if I wanted to meet up. I sent an email back apologizing for any hurt I caused since I had no idea if she had tried to reach out over phone, and that I was glad to hear from her. We met up and talked. She asked about me thinking she was gossiping about me. I apologized and was straightforward that being shut out by her and the group she was with was what made me paranoid that she was talking crap, but that I hadn't heard anything specific. She asked me if it had anything to do with her saying something about the Andrea and I said no. While that was true, that me ghosting her had nothing to do with something she said about Andrea, I didn't come clean about having said that at the party (I assume the person I was talking to at the party circulated it to where it got back to her). \n\nWe talked more about what had gone on in those few years - both of us had some difficult romantic relationships, covid had happened, etc - and then we parted ways. I know we won’t be friends again and I feel I’ve done everything I can to bring closure with her personally, but I wish I had handled things so differently and just talked to her early on about how I was feeling. \n\nThe thing I feel that I really left unresolved is telling Andrea that I had said Shayla was talking crap because I was hurt, and not because she actually was. I don't know how to come clean to the Andrea because it isn’t black and white, but I feel it was lie and I don’t know if/how it’s affecting their rift or the opinions of others in our general social circle. \n\nAndrea is also someone who has not historically been the most trustworthy friend for me which comolicates things. \n\nLong Example: I had a horrible romantic relationship experience my last year of college involving abuse that I don’t want to get into the details of, and which caused me to seek therapy for the first time (which I guess is a silver lining). That “partner” (if you can call him that) ended up going around to anyone that would listen asking them what I had said about him (I’d said nothing, I wanted to pretend nothing had happened and move on with my life) and then saying very horrible things about me. Andrea told me he’d said horrible things but wouldn’t specify what they were, then later in the year she invited me to go out with her so she could bring another friend, we ll call her Tina, in the hopes I would go on my own rant about the relationship (which I didn’t do). I know this because the same day Andrea invited me out I got a long text from the former “partner”, after months of no contact, saying he wanted to know how I was doing, and had been thinking of me. I didn’t respond. I also knew because Shayla and Tina spent that outing asking by me vague questions about how I’d been doing, who I’d heard from recently, and looked visibly disappointed when the outing ended with me having said nothing about what happened. \n\n\nToday I have healthier friendships with people I met at a better time in my life and a new romantic partner that I love, and that has stuck with my through intense anxiety which makes me hopeful that I can have healthy, long lasting relationships in general. I’ve done counseling a couple times and recently set up my first psychiatry appointment to find a more permanent solution for anxiety, overthinking, self esteem, and general emotional struggles. I have been very intentional about not gossiping, being more responsive to friends, and proactively reaching out to people - even when it’s awkward and something is bothering me. Shayla has a romantic partner and is engaged, and from what I can tell seems to be doing well which I’m very glad about.\n\nIs digging this back up and clearing the air with Andrea is the right thing to do - and if it is, how to approach it? I don’t want her and Shayla’s rift to impact their well being, or their social circle around them, regardless of whether or not they were close. Part of me feels it would be good to come clean about why I said what I said at that party, the other doesn’t trust Andrea and doesn’t know if I’d just be opening an old wound. \n\nWhat do you think I should do? Any advice is helpful. Sorry for the length and appreciate anyone who can weigh in.",
    "score": 9,
    "created_utc": 1746100273.0,
    "subreddit": "confession",
    "id": "1kc6sp9"
  },
  {
    "title": "I’ve been avoiding my friends for months and I don’t know how to fix it",
    "text": "I’ve been avoiding my friends for months now, and I feel guilty about it. It started out small, like missing a hangout here and there, but over time it’s become a habit. I tell myself it’s because I’m busy or just need time alone, but the truth is, I don’t know how to tell them that I just don’t feel like being around people right now.\n\nI’ve been pushing them away slowly, and now it feels like there’s this huge distance between us that I can’t undo. I feel bad because I know they care, but I don’t want to lie to them either.\n\nHas anyone else done this? How do I fix it without making things awkward?",
    "score": 17,
    "created_utc": 1746080331.0,
    "subreddit": "confession",
    "id": "1kc1z0e"
  },
  {
    "title": "I used to lick shoes as a kid. Only new shoes. I had to taste the sole before it was put to use",
    "text": "I have tasted other things that are too embarrassing to admit even anonymously…",
    "score": 46,
    "created_utc": 1746056998.0,
    "subreddit": "confession",
    "id": "1kbv1fj"
  },
  {
    "title": "Me and my motorcycle blasted into a jaywalker at 55mph.",
    "text": "I was driving 55mph on a highway with a whole line of cars about 50 yards behind me.  The road was dark and out of nowhere, this dude is stumbling in the middle of the road and I only had a microsecond to swerve without wiping out.\n\nMy handlebar caught his arm and Im 100% sure he went down to the ground.\n\nIn that instant I made the decision that I wasn't going to have my life upended just because some yahoo  doesn't know better than to be jaywalking on a dark HIGHWAY.\n\nI gunned it and never looked back.  I'd bet good money that the cars behind me ran him over.\n\nIm not happy about it, but I'm glad I didn't stop.   This was WAYYYYY before cell phones and security cameras.",
    "score": 5352,
    "created_utc": 1745961938.0,
    "subreddit": "confession",
    "id": "1kazg3a"
  },
  {
    "title": "Even if you just leave a kind word, that would mean more than you know.",
    "text": "https://gofund.me/f77abece\n\nIf you’ve ever had no one to call — you already know how this feels.\n\nIn 2023, my life collapsed. I suffered a broken neck and back. I lost my car — which I was using to drive Uber and survive — and after that, the bills started to bury me.\n\nIt’s now 2025. I’ve been trying everything. But I’m completely alone. No family I can call. No savings. I owe $5,500 in rent and I’m about to be evicted.\n\nI have two kids & two dogs who rely on me. No income. No car. No one.\n\nI don’t expect miracles. I just want to survive.\n\nI made a GoFundMe as a last resort. If it’s allowed, I can share the link in the comments or DMs. Even $1 helps. Even a share means the world.\n\nThank you for reading. I know I’m a stranger here, but I’ve got nothing left but this shot.\n",
    "score": 4,
    "created_utc": 1746109550.0,
    "subreddit": "confession",
    "id": "1kca1e7"
  },
  {
    "title": "Momentary confusion/clarity in the life of a bartender",
    "text": "I am an introvert. I grew up sensitive, raised by by that had the best intentions, but not the best practices. I was a strange kid in a very small town. I've been called a lot of things, but also feared by my peers because I am not like them. I'm almost forty now, I've been working in the same bar for at least ten years, and I am still not like them. All of this to say, my confession is that sometimes I just want to fall over and be done. I have a daughter I know, a daughter I don't, and a loving girlfriend. Occasionally my family remembers that I am both alive and have a phone number. I have someone that I allow to live with me that can no longer contribute to the household. And I'm just so tired. I just want to fall on my face in front of all of them and never have to get up again. ",
    "score": 7,
    "created_utc": 1746085599.0,
    "subreddit": "confession",
    "id": "1kc378v"
  },
  {
    "title": "I write erotic stories for women but with ulterior motive…",
    "text": "I still can’t help myself. Once I realized that I could write a story hot enough to make most women want to touch themselves, it quickly became my obsession. It always turned me on so much hearing how wet it made them and how they couldn’t help but to give themselves immediate relief.  Knowing they were getting off to my stories got me off, and further compelled me to always want to outdo myself with an even better, more erotic tale. Now I have a collection of stories that I’m forever trying to share. It’s become an addiction, seeking out women to feed the stories one by one, wanting only to hear them speak of how turned on they get. Surely this must be some form of sex addiction?",
    "score": 346,
    "created_utc": 1745993473.0,
    "subreddit": "confession",
    "id": "1kb9l2e"
  },
  {
    "title": "I had the best girl in the world. I had her and I lost her.",
    "text": "I had the best girl in the world and I lost her. She is still in the world, but she’s no longer mine and never will be mine again. The truth is I never deserved her and I was lucky that she saw something in me and gave me a chance to earn her in my life. I could have earned her, but instead I took her for granted. I was shallow. I was stubborn. I needed it to be right. I was intolerant of her views that didn’t align with mine. I became a lazy partner. I could have deserved her. I could’ve earned her, but instead, I threw it all away without stopping to realize I owed her the best version myself. I owed her the best I could possibly be. I had her and I lost her.",
    "score": 418,
    "created_utc": 1745988568.0,
    "subreddit": "confession",
    "id": "1kb8bfs"
  },
  {
    "title": "My pants ripped while at work and everything bounced forth",
    "text": "I work as a courier between business and I was in a shipping dock picking up some heavy  boxes. Now as I squated to pick one up my pants ripped at the back seam and \"everything\" flopped out at the peak of the squat. Now this wouldn't have been an issue had I not been fresh out of undergarments due to a laundry mistake. It was instantaneous. The loud and fast rip, the sudden drop and freedom of \"everything\" bouncing forth and the immediate crispness of the outside air on my hotdog and velvet purse. I immediately stood up to conceal the exposure  and checked around but there was nobody there. I was still mortified. Tied my hoodie around my waist and eventually made my way to target to pick up some fresh pants. But I'll forever dread the thought that maybe someone saw my Oscar Meyer but was equally as mortified to have witnessed this catastrophic event",
    "score": 5916,
    "created_utc": 1745934406.0,
    "subreddit": "confession",
    "id": "1kaocei"
  },
  {
    "title": "I used to suck on coins when I was still a little kid.",
    "text": "That's pretty much it. I mean, I knew I shouldn't. My parents stopped me whenever they caught me and told me not to. Explained to me how gross and unsanitary it was. But I liked the metallic flavor. ",
    "score": 13,
    "created_utc": 1746051749.0,
    "subreddit": "confession",
    "id": "1kbt6iv"
  },
  {
    "title": "I am a pervert and I try to hide it from everyone who knows me.",
    "text": "I am really young, I admit it. Since I entered pre-adolescence, those subtle tastes or strange signals from childhood became a dark part of my personality. It was obvious from the moment I thought \"Nobody should know this about me\" and reluctantly erased those twisted thoughts from my mind. I have always felt a great fascination with master-pet relationships, cannibalism, some topics related to the feederism community, vampirism, a small obsession with control in ways as twisted as you can imagine. In my mind, it is really attractive to maintain control and a certain sense of ownership over someone, to the point of perhaps depriving that person of their physical freedom (you know what I mean and it's not pretty) and keeping them by my side as if they were an animal with no voice or vote in my decisions. It's one of the reasons why it's too difficult for me to form deep bonds or genuine connections; it's understandable, even I know how creepy it can be. I know perfectly well that I am sane; social interactions are simple and I can keep my desires perfectly isolated for as long as necessary. They don't harm my friendly or family relationships, as I would never let anyone find out about my twisted tastes. Deep down, I know I'm someone lacking human values with which I can identify, but that doesn't mean I don't want a conventional relationship like that of a happy couple. Unfortunately, I have always rejected people who fall in love with me because I know how terrifying it could be to confess to my special person how much I like to drink my own blood or show them all my sadomasochistic fantasies. I wouldn't want them to stop seeing me as \"the intelligent boy in class, the responsible brother, the pretty boy without a sense of humor\" to start seeing me as the next Jeffrey Dahmer. I can form genuine affection connections that exclude a part of my essence, but I know they will never fully satisfy me and that makes me somewhat sad... Very sad. I would never do anything to harm someone, but if I had the opportunity to make my most disgusting desires reality, I still wouldn't do it; nobody should suffer because of the sick mind of a boy who received a late sexual education. I would like to meet someone with whom to share that part of me that I keep silenced daily, someone who instead of judging it takes the time to understand it and in a way, enjoy it (no, I don't mean committing bloody acts; a simulation perhaps, nothing that involves causing real harm), but I understand that most people don't find it pleasant to have a human pet and I know I'll be perfectly fine without a double life in which I become a serial killer to satisfy my emotional voids of disgusting things. And by sharing I don't mean anything explicit through images or anything sick, I'm talking about metaphors, writings, stories, and personal experiences. I love drinking my own blood, but I wouldn't tolerate explicit visual content of that action. I don't like seeing people harm themselves; as much as a certain part of me feels strangely good, my sane side never lets me frequent such content or promote it. I'm not justifying the fact that yes, my tastes are disgusting, I don't recommend them as a healthy or wholesome practice and I am someone who genuinely enjoys these things because I probably have some kind of trauma that I'm unaware of, so I don't romanticize the actual practice of such acts and I take full responsibility for all my actions, none directed with the purpose of harming someone else, only myself to a slight extent. I've preferred to live pretending that I'm aroace rather than facing my own reality and that doesn't make me happy, but I think it's the right thing to do. I am a pervert and I try to hide it from everyone who knows me.  \n",
    "score": 146,
    "created_utc": 1746000783.0,
    "subreddit": "confession",
    "id": "1kbb9x3"
  },
  {
    "title": "Most of the places I have worked, I make it a goal not to get any work done before noon",
    "text": "It started at an internship like 15 years ago when i realized I could do the work a lot faster than expected \n\nStill doing it now. I ease into the day - I may browse my emails, get files opened, check socials and news and get my personal admin tasks done…you know warm up for about 4 hours and THEN . At noon, I blast off into a hyper efficient work grind because I know my relax time is up but im also ready af to work then\n\nIf I start to work too hard before noon I will deliberately drop the task and say whoaa whoa not time yet . Otherwise how in gods name are we making it through until actual 5?!\n\nThis started as a corporate f-you move but I realize I do this every place I’ve worked & I still rose up the ranks \n\nDon’t work too hard out there or you’ll die\n\n( may be I’m like this cause one of my first bosses killed themself ) \n\nxoxo have a balanced day ",
    "score": 56,
    "created_utc": 1746018992.0,
    "subreddit": "confession",
    "id": "1kbg8jh"
  },
  {
    "title": "I’m really smart but I downplay it and never talk about my achievements",
    "text": "Unless you really pry it out of me because I learned that people are SO quick to feel bad about themselves / get jealous because of what someone else has done…\n\nAnd I can’t stand making other people feel bad :(\n\nI used to think others would be excited for me but I can’t even state basic facts without seeming like bragging. \n\nNow I’ll meet entire groups of people, and go all night without mentioning a word about myself or career and they’re always more friendly to me that way . Everyone in the circle talking about what they do and I won’t open my mouth until directly asked. Sucks because I thought there would be more of a shared excitement for peers who are doing well, I learned….. that is not the case ",
    "score": 25,
    "created_utc": 1746031771.0,
    "subreddit": "confession",
    "id": "1kbl9ng"
  },
  {
    "title": "Drop out of college without my mom knowing for a good 2 years",
    "text": "I drop out of school without my mom knowing. The only reason was because quartine hit and ruined my learning and when I graduated it felt so fast to me. So when I went to college it was difficult I was struggling a lot and made me had mental health issues. I was relying on energy drinks day by day to keep up and it was overwhelming to me",
    "score": 5,
    "created_utc": 1746055424.0,
    "subreddit": "confession",
    "id": "1kbuhij"
  },
  {
    "title": "I drank someone's holy water and refilled it with tap water",
    "text": "When I (34F) was 18, I dated a guy in Uni - nice guy. He lived at home with his parents and younger siblings. His father was a surgeon, and they lived in a beautiful big house. \nThe family wasn't overly religious. His parents had a small vial of holy water in the pool room that they had gotten while on vacation at the Vatican. \nWell, one night my boyfriend at the time and I got incredibly drunk (legal drinking age is 18 where I live). And, just as the title says, curiosity (and vodka) got the better of me. I drank the holy water. Refilled with tap water. And put it back. \n\nI just needed to get that off my chest. \n\nEdited to include age and spelling",
    "score": 777,
    "created_utc": 1745962921.0,
    "subreddit": "confession",
    "id": "1kazu2l"
  },
  {
    "title": "I’ve been “playing” guitar for over thirty years.  All my friends know me as the guitar guy. I have thousands of dollars worth of gear.  I know all kinds of music theory. I can’t play guitar.",
    "text": "This isn’t my main account so I can hide my shame from my friends. I’ve had guitars hanging on my wall since I was 15 years old. I own four acoustic and six electric guitars, plus a ton of pedals amps, etc.  \n\nI give out guitar playing advice on forums, but it’s just stuff I’ve read or I google the problem and give the AI answer. I’d much rather sit and watch guitar tutorials or music theory videos than actually practice.  \n\nI know what scales are but I don’t know any.  I know what modes and triads are but I don’t know any.  I can play maybe three chords, but not well.  I like the feeling of making music on the guitar but I also hate practicing.  \n\nAt this point, it’s part of my identity and everyone assumes I’m accomplished when they find out how long I’ve been “playing”.   I always come up with some excuse on the rare occasion that someone asks me to play something.  I’m terrified for anyone to hear me play because my secret will be revealed, instantly.  \n\nI’m in my late forties, and I’m fully aware that the fantasy of being famous and playing on the stage for thousands of people is far behind me.  If I ever did become proficient, it would just be for my own gratification. \n\nI do this with all my hobbies.  I spend a bunch of money, get lots of gear and never do anything with it.  I own four sets of juggling balls and can’t juggle.  I own a weaving set and have never completed a project. I’ve been trying to learn Spanish but don’t remember any of the vocab. I don’t know what’s broken in my brain; I’m fairly intelligent and have a tech savvy job.  I should be able to learn these things.  \n\n I know the obvious advice is to try another instrument or give it up. However, I really do like the idea of playing guitar and I’m not willing to give the hobby up.  Removing this part of my identity would feel like killing part of who I am. Maybe today will be the day I start practicing, but I doubt it.  \n\nAnyway, I’m a fake and a liar and I just wanted to get that off my chest.  \n\n\nEdit: I’ll summarize the most commented responses since I have read everything.  \n\n1.  You have ADHD. \n2. Give up and sell your gear. \n3. Just practice. \n4. Don’t be a little bitch.  \n5. Everything is AI, including this post.  \n6. Take physical lessons for accountability. \n7. Lying is bad, mmmkay?\n8.  It’s ok to be a collector. \n\nEdit 2: I actually picked up the guitar and learned the first part of the minor pentatonic scale last night. Thanks for all the motivation :)",
    "score": 2234,
    "created_utc": 1745941885.0,
    "subreddit": "confession",
    "id": "1kararc"
  },
  {
    "title": "Desicion that changed my entire life and it's perspective",
    "text": "Hi guys, today I want to share about the desicion that took in my life which changes my life the way I think I way I thought everything. This is not a forceful decison or an influential. It's all on me only. The decision is I want to get married to my love of my life.\n\nHere's the story in 2017 during inter I went to my frnd home she invited me as there was a pooja I went there everything is well until there's a guy of her relative came there and just had a look we had then after lunch I came back to home all is well. But suddenly the very next day that guy came near to my home I got shocked 😳 my family and me are going to another function to some other place then at the afternoon I got a call from an unknown number I lifted that call nd shockly this is him who I saw in the morning. Then we talked how you got the number. Later we spoke at the very fast meeting he told me to get married.\n\n I was shocked we have age gap nearly 7 yrs. I told no let's just be friends and then will see. After that I didn't talk to much because I am busy with my studies. Later I had an another meeting with him in my frnds home. He is too fast to touch and want to take the things fast. I told I am not that much interested.then  I left the place after some time. Then we start talking to each other . Then met with an accident. I prayed alot to the god to get good health because I am having an positive thoughts on him. \n\nHe recovered and he can't able to lift his hand bcz hand got facture. Later we talked and small small meeting we got I thought things are good on going I shared at first only that I am bit angry person and he told me that yes I will handle you. \n\nBut things got changed on new year 2019 I waited a long tym to talk but he is busy in some other call.till morng 3 am I am in waiting only. Early he called and talk like nothing happened I got broke I cried alot I injured my arm also still he is not reacted like I did a mistake. Then after he didn't even say sorry for his mistake instead he portrayed like my behaviour is the reason. \n\nFine on that jan 1st day of the year mine was a bad still I forgive him and talk but he is not in a position to understand what's his mistake. The remaining will be continued...",
    "score": 0,
    "created_utc": 1746124239.0,
    "subreddit": "confession",
    "id": "1kcfyyp"
  },
  {
    "title": "AIO Am I to ask my mother to move out and stay with my brother",
    "text": "",
    "score": 0,
    "created_utc": 1746087784.0,
    "subreddit": "confession",
    "id": "1kc3owr"
  },
  {
    "title": "Opinen sobre mi caso ayudenme por favor 🫶🏼 necesito",
    "text": "",
    "score": 1,
    "created_utc": 1746086867.0,
    "subreddit": "confession",
    "id": "1kc3ho2"
  },
  {
    "title": "I have to be in a very specific position to fall asleep",
    "text": "I have to have two king sized pillows, one in front of me and one between my knees, then a very flat normal sized pillow between my arm and my head. And for the weird part, I can’t fall asleep unless I cross my toes. Big toe over middle toe on both feet. Lmao. \n\nI’ve never even noticed the toe thing until my boyfriend pointed it out🤣🤣 I do it every single night. ",
    "score": 86,
    "created_utc": 1745998864.0,
    "subreddit": "confession",
    "id": "1kbaueq"
  },
  {
    "title": "Remembering Highschool moments......................",
    "text": "Hi I was in my class 10th and and on the right side of my seat, in the adjacent row, a nice good girl used to sit. \n\nWe just used to study or help each other in those matters only. \n\nOne fine day she handed me a novel stating that she found out it's language to be a bit tough and asked me to read it.\n\nI went to my home and started reading the novel. Just on the back side, there was a photo of some prince. I read the novel and honestly found it to be a romantic novel. The language was definitely not tough.\n\nWhat do you think in your opinion. I have been single all my life till now and many times think why am I so. \n\nThis memory of class 10th flashed. \nYour opinion is most welcome and a girls point of view is desired.",
    "score": 7,
    "created_utc": 1746048455.0,
    "subreddit": "confession",
    "id": "1kbrwfk"
  },
  {
    "title": "I don’t think I’m over my 10 year ex - what should I do",
    "text": "I’m (30F) unsure if I’m over I’m high school sweethearts (30M). We were together from high school until 3rd year of university (6 years). He broke things off when he couldn’t handle the pressure of my car crash, it left me with a disability - I was 21 at that time.\n\nWe kept in touch because we’re in the same high school friend group and have gatherings 1-2x a year.\n\nI’ve had several relationships after our break up but I realized that I’ve always look for characteristics of him - facial features, career, hobbies, personality class. He hasn’t dated anyone in 9-10 years and visits me when I’m in hospital (it’s been more frequent the past 2-3 years).\n\nCurrently, I have a boyfriend 30M, very supportive, we’ve been going out for 1.5 years.\n\nI want the best for my high school sweetheart and frequently have ‘what if?’ about my injury. But I want some type of closure? I don’t know what I want. Thank you.",
    "score": 94,
    "created_utc": 1745993112.0,
    "subreddit": "confession",
    "id": "1kb9hqq"
  },
  {
    "title": "Mi casi algo valio vrg!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "text": "Pues eh estado enamorado de una persona la cual siempre fue linda conmigo ella y yo nos amabamos por asi decirlo, de un día a otro, se torna como a una semana atrás me empezó a tratar un poco raro por asi decirlo, me decía muchas cosas bonitas pero muy secas si es que me explico en un lapso de unos 2 días me dejo de hablar, y pues se que como es su familia le quitaron el teléfono y asi fue JAJS, hasta antier que llego a la escuela como a las 6, cabe aclarar que entrábamos a las 2 de la tarde, pues llego muy rara a la calle la vd, no le tome importancia y la neta ni le hable, solo me dio curiosidad de que había unas 3 amigas con ella hablando, ya al terminar la clase fui y le di un besito en el cachete ella solo se burlo con su amiga de forma nerviosa a lo que yo me aguite me fui y le dije que ahorita la veía, ya en la noche opte por mandarle un mensaje de que nose que trajera o que habría pasado en su familia o alguna situación que solo esperaba que estuviera bien, a lo que ella como 2 horas después me respondió y me dijo \"eso espero :(\" soy una persona bastante linda al amar considero yo, a lo que le dije que que le pasaba, que había estado muy rara varios días que si pasaba algo, solo le dije: podemos hablar mañana?, solo me dejo en visto, al día siguiente en la escuela estaba hablando yo con sus amigas y un amigo en una de esas les pregunte que pasaba con ella, a lo que me respondieron que le preguntara a ella por que venia detrás de mi, ya solo llego y le pregunte como estaba me dijo que bien tome valor y le pregunte que que pasaba, ella me dijo que no estaba segura de decirme por que no sabia si lo iba a tomar a mal o me iba a enojar (obvio si ), ya ella me empezó a platicar que no era nada de su familia si no de su ex novio ya que ella me había comentado que según era \"virgen\" y me lo repitió y me dijo: recuerdas que te dije que era virgen ?, a lo que respondi que si y me dijo que pues no que me había mentido, para luego decir que estaba embarazada, sentí lo peor del mundo, quede en shock simplemente no reaccione me ardió el corazón llegaron mil sentimientos a mi y a mis sentimientos, simplemente le dije que no sabia que responder, ya me dijo que esperaba no lo tomara a mal (obvio si JAJA :(  ) Y me dijo que esperaba que simplemente nos fuéramos a llevar bien ya luego me dijo que si me podría dar un abrazo a lo que conteste que no para posteriormente darle un beso en la frente y irme a llorar, sentí lo peor del mundo y lo sigo sintiendo aun, hoy mismo volví a hablar con ella para pedirle un último beso JAJA y para desearle lo mejor aunque me sintiera yo de lo peor, la vd no pienso en buscarla nunca más ni nada pero siento muchísimo muy feo espero poder sanar correctamente de esto por que nunca en mi vida me habían dicho algo así y menos tan iriente espero comprendan la gente aquí y me puedan aconsejar aun me duele pero se que puedo superarlo, simplemente ayuda.",
    "score": 0,
    "created_utc": 1746078934.0,
    "subreddit": "confession",
    "id": "1kc1mj7"
  },
  {
    "title": "Uber pool done right in Gurgaon, back in January 2017!!",
    "text": "This was in Gurgaon, near Galleria market and I used to stay in a posch society behind it. I had casually booked a ride not thinking much. \n\nWhen the cab arrived, I saw a hot af girl just browsing her phone, sitting in the back seat. I scooted inside and casually said hi. She responded with a nonchalant hey and we got chatting. She seemed cool and had decent conversational skills, esp after being that hot.\n\nI played it cool, didn't try to put in too much effort. When she started asking questions about my work and lifestyle, I knew she was interested. I asked what her plans were and she said she was gonna go to the mall. I asked her about LinkedIn and connected. I had a premium membership and her phone number was public. \n\nA few seconds later, she gets a text on her phone telling her about where she was and where she was headed. While she was spooked, I as her co-passenger kept talking with her coolly. I asked if there was something bothering her and she relented quickly. I consoled her and told her to block the guy, but she didn't ;)\n\nWhen she was getting out of the cab, I admitted it was me on the other side and I was just pranking her. She was a little angry but definitely impressed. I told her that since I already had her number, it was customary to ask her out for a date. She hesitantly agreed and I asked her if she wanted to go out then and there.\n\nAfter about 13 drinks and lots of smokes later, she was back at my place, frisky, horny and ready to fuck. And fuck we did. Hers was the plumpest ass I had still ever fucked. This was in 2017 and it's been 8 years now. Guess who's booking flights from Bangalore to Delhi for next week. ;)",
    "score": 0,
    "created_utc": 1746113478.0,
    "subreddit": "confession",
    "id": "1kcbm3c"
  },
  {
    "title": "I let my hands wander on a friend who wasn't into it :/.",
    "text": "CW// mention of non-consensual touch, substance use, and possible addiction.\n\n-\n\nI feel really sick to my stomach thinking about it, so I guess that's a good thing.\n\nAt a group sleepover (20F), we all got high and drunk in the same night, which honestly should've been reason enough for me to stop. Especially as the group's hard-weight while my friends are more light-weights. Before we went to bed, I laid down on a friend's (20F) leg and asked them to play with my hair. Their hands began to get more aggressive and my hand reflex squeezed their thigh, the pressure only increased so with my delusion, I assumed they liked it. That plus asking them if they felt comfortable and the one of the responses back being a wink, I thought I was in the clear. In fact, I assumed I was encouraged.\n\nSo not long after, I let my hand wander to their upper thigh, their stomach, and their chest, all while people were trying to sleep around us too. After touching/brushing those areas, I couldn't get another answer if they were comfortable or not and if I could continue touching there; so I stopped but they stopped being comfortable quite a while prior. \n\n*They messaged me last night and I don't think they weren't into it at all. I doubt a single part of it. I went on for so long. Though some responses might've been misleading in my eyes, I could never get a flat out yes from them and now I know exactly why. I shouldn't have touched them without a flat out yes, but I was too caught up in my own emotions to care about that. I was selfish and didn't fully consider if they weren't into it the way I was. Dumb note, but I'm also a virgin, the most virgin in the group, so maybe I was just that desperate or clueless to stoop that low for any action.\n\nI feel so disgusted with myself to have made them uncomfortable. Honestly, I'm wondering if I'm having a sex/masturbation and weed addiction that's feeding into all this, and I accidentally took it out on them? I had to apologize while a bit high (**got high not expecting the message a few hours later) and I'm worried I sounded fake as hell because of it. Sometimes the only motivation I have day to day are those two things. It's not an excuse but it might be a reason and I feel gross knowing that. I feel gross even wanting to get off after this.\n\nThey're in my main friend group I've had since High School. I don't know why I decided to risk this, I just wish I never did. Especially as someone who's also been uncomfortable being touched by somebody. Yes is yes, no is anything else.\n\n-\n\nEdit:\n\nThank you for the genuine replies, just wanted to confirm that I've already apologized to this friend. \n\nIn the morning, I asked maybe once or twice if I made them uncomfortable and they said no, but that was to brush it off. After they left, I messaged them and asked if they were uncomfortable and I'd never do it again if they were, and they said they didn't care too much of it and it's a one time thing we can sweep under the rug. A few nights pass until they confronted me last night. That they never gave explicit consent for me to start nor continue, how close my hands got, and the nerve I had doing this in front of our friends. I sent quite a few messages apologizing back, absolutely on their side, and that I feel remorseful. It's currently left on delivered. I just hope they don't feel unsafe around me, though it's very fair if they do.\n\n-\nEdits:\n\n*added another line for clarification that me and my friend have already addressed this.\n\n**clarification that I didn't get high to apologize to them! i immediately stopped puffing once they opened the convo and I didn't continue smoking until hours after the conversation was over. I wanted to be as sober as I could be for the conversation.\n\n+note: other times I asked them for their comfortability, it was often left unanswered, instead stating how intoxicated they were. I should've stopped there. I only let my hands roam further than the outer leg after the wink as that was my most clear answer, which still isn't a full yes. + I asked about the wink afterwards, they said they couldn't remember answering like that.",
    "score": 727,
    "created_utc": 1745948436.0,
    "subreddit": "confession",
    "id": "1kau06l"
  },
  {
    "title": "Rainy days have become a reflection of my weeping soul.",
    "text": "Can’t recall when it started, not sure when it will end. Lookout, gray skies ahead with no chance of sunshine in the near horizon. ",
    "score": 12,
    "created_utc": 1746031963.0,
    "subreddit": "confession",
    "id": "1kblcf0"
  },
  {
    "title": "Everything Ive ever achieved in life is because of cöcaine",
    "text": "It sounds crazy but it’s true. Long story short is I’ve been suicidal and depressed since I was 9 years old (Currently I am 21F). In school I did ok and got into an average uni. In uni I really realised how depressed I was because I was alone and my parents weren’t there to take care of me. I was spending 4 straight days in bed not doing anything and I failed a bunch of exams first semester. By this point I had tried concerta, fluoxetine and sertraline. I went to my gp and she put me on citalopram. However I had exams coming up and I couldn’t really wait 6 weeks for the citalopram to kick in so I started doing cöcaine. I had done it once before at a party and it made me so happy so I did it again. \n\nI remember that day so specifically. I was no longer tired and my body didn’t feel like a million bricks. The voice in my head that kept telling me to go kill myself for the past 11 years if my life disappeared. I never felt better. And so I started doing it everyday. I went from lying in my bed for 4 days straight to spending 10 hours at the library studying. Anyway I learnt a whole years worth of stuff in about 3 weeks. Id do cocaine everyday about 5 times (a little line each time) And I passed my exams! And when I went back to my home country for the summer for 3 months I was sober. \n\nIt wasn’t too bad being sober. Because now that I knew what not being depressed was like even when I sometimes felt suicidal I kept telling myself that life isn’t that bad. For my second year of uni when I came back I found it impossible for me to study. And with the winter coming I found myself barely able to get out of bed and suicidal again. So what do I do? Cocaine. And again it fixed my life. I got my shit together started going to class and studying. Ofc I don’t have all the money in the world. So I’d pace myself. 3gs every month. So if I had little left and a week left till my next re up I’d save it or not do some for few days. Id ration my coke for the month. \n\nAnd yeh. That was like 2 years ago. I still do coke everyday. I do other drugs too Ofc but recreationally. All bc of coke I am now a star student. All my professors love me. People come to for help with their assignments. All my grades are A’s. I’ve learnt so much and I am a very scholarly person now all thanks to coke. Ofc doing coke everyday is no way to be. It’s expensive, its bed for my heart etc. but I don’t know how else to be. \n\nI am very close with my parents and they’re super strict Muslims. So strict that they don’t believe in psychological medication. When I was 16 and I started taking sertraline my mom and my dad both called me a drug addict (haha foreshadowing) and when they learnt that it didn’t work they told me that I wasted their money and that everything going on is in my head. And they forbade me from taking any kind of other medication. Ofc when I turned 18 I went to my gp (I live in the U.K.) and she prescribed me bunch of stuff but nothing worked on my brain. I kind of resent my parents. Because they don’t realise £200 missing from my bank account every month but they’d get so mad if they found out I talked to a therapist or took any medication. So in a way they made me an addict. \n\nI feel so ambivalent. I know coke is bad but I don’t know what else to do. No psychological medicine is allowed because of my parents and even if they did allow if I’ve tried so much shit I don’t think anything will work. But I don’t know what else to do. I’m sober if I’m not studying or doing uni work. But there’s still 2 years more to my degree. I’m conflicted. \n\nEDIT- Ik some people will say I’m justifying my addiction bc of my parents. But they are a huge reason why I’m doing coke. If I was on anti depressant, I can’t stop overnight and go on holiday with them. I’ll have withdrawal and start throwing up. With coke I just hide the coke in the house and go on holiday feel perfectly fine. \n\nAlso regarding adhd, a private diagnoses is £4000 and I am financially reliant on my parents and they would never pay that much for a adhd diagnoses. They don’t realise £100 missing every month tho. My parents also check my phone and messages. I can hide one text to my dealer every month from my parents. I can’t hide multiple calls and emails and texts from psychiatrists or doctors or people calling to confirm an appointment. And if you say don’t give them your phone. If I don’t they psychically hold me down and take my phone away from me and check my phone, messages, pictures, everything. So yeh. Idk what to do. And I can’t draw a boundary between them bc like I said they’ll just take my phone away as soon as I try to set boundaries. ",
    "score": 152,
    "created_utc": 1745971004.0,
    "subreddit": "confession",
    "id": "1kb2stn"
  },
  {
    "title": "I really need an answer - this cannot be normal at all",
    "text": "I, (35,F) have a problem or at least I think I do.   \n\n\nI think I may be a s\\*x addict. \n\nI need s\\*x to breathe.   \nNot just any s\\*x though and not with just anyone. \n\nI am quite specific about my wants/needs, my likes/dislikes. I am quite dominant in my everyday life and find myself on the side of ultimate submission when it comes to s\\*x. \n\nI crave dominance from a tall, foreign, accent yielding, salt and pepper haired man.\n\nWhen these interactions occur, I turn into the complete opposite to my everyday self. I am an absolute kitten and when it's all over, post-nut clarity hits me and I am over it. \n\nI have come to this conclusion as lately (read always) I have s\\*x on the brain. Flashbacks, day dreams, you name it. All quite vivid and all leaving me needing more. \n\nIs this normal for everyone? ",
    "score": 0,
    "created_utc": 1746114528.0,
    "subreddit": "confession",
    "id": "1kcc1b6"
  },
  {
    "title": "The world sucks and I made a mistake on thr internet.",
    "text": "So never ever ever show your face on the internet. \nLong story short I started chatting with this woman who said she was 23f. We were getting hot and heavy over text and I sent some pictures. Turns out she wanted to post them to a minor abuse page and black mail me. \nNever again. \nI have lost all faith in humanity 💔 \n\nI know I'm the idiot for trusting someone on the internet. I feel stupid enough already. \n\nI blocked her deleted the chats but she had them saved already. At the end of the day I haven't done anything wrong and the people in my life know who I am. \n\nSo really a psa don't ever show your face or nudes on the internet unless you are willing to potentially loose everything. ",
    "score": 243,
    "created_utc": 1745955966.0,
    "subreddit": "confession",
    "id": "1kax1iz"
  },
  {
    "title": "I haven't changed clothes in 4 days and I just go everywhere with the same jacket to hide",
    "text": "I haven't answered any messages. I haven't changed clothes. I have spent two days in the hospital back and forth, and I have to go tomorrow, too. All I worry about is covering my wounded arms and my bruised neck from people. \n\nEverything seems like such a bother. \n\nI just start walking straight ahead with no destination and head to nowhere with the same song on repeat. I feel lost, I must look lost, I clench my arm behind my back; figured it fits how I truly feel, like I have no arms. An armless body. I detach completely from reality during those walks and don't know who I am or where I am anymore. I must look insane. I cannot quite care. I want a hug. ",
    "score": 138,
    "created_utc": 1745962247.0,
    "subreddit": "confession",
    "id": "1kazkhm"
  },
  {
    "title": "I just yelled at a Ticketmaster phone agent for something out of her control",
    "text": "I knew it wasn’t her fault and my anger should’ve been directed at Ticketmaster for their shitty policies that have left me $5000 in the hole. I was condescending and demeaning. I told her that her English wasnt good (although it was truly difficult to hear what she was trying to say at times) I was just so enraged at my predicament that I took it out on some poor girl thats probably making $17/hour. I knew it was wrong but I couldnt stop myself. I feel terrible about it but I also feel lighter after letting out some of that frustration. \n\nEDIT: Ok guys now that Ive had time to cool off, I called the customer service line back to apologize. The new agent I spoke with said they dont work in the same city with the agent but they did notate the apology to the account and sent an email to the supervisor of that city. ",
    "score": 154,
    "created_utc": 1745956668.0,
    "subreddit": "confession",
    "id": "1kaxbjo"
  },
  {
    "title": "Decades ago I stole a lost purse at work. I’ve never told anyone until today.",
    "text": "Many years ago I worked at a grocery store during college. I was constantly broke and didn’t know if I could afford my books in the coming semester.\n\nOne day, a customer turned in a small, lost purse. I brought it back to our office and glanced in it to see if I could find the person‘s identity. I found their license, but also there was over $300 in cash. In a moment of greed and desperation that was in no way justifiable, I crammed the purse into my pocket and ran it out to my car. It had an ID, and credit cards, and other things, but I just wanted that cash to cover some of my upcoming bills, including my books.\n\nThe next day the customer came back to see if anyone had found her purse. She was probably in her 60s or 70s. One of my coworkers told her no, there was nothing in the lost and found. The woman looked so overwhelmed. This was long before modern phones and connectivity, so she was going to have to deal with all this with phone calls and visits to banks and what not. \n\nI would see her in the store frequently for a few years after.  I always felt awful and I’ve vowed to never do such a thing again. ",
    "score": 110,
    "created_utc": 1745959913.0,
    "subreddit": "confession",
    "id": "1kaymch"
  },
  {
    "title": "I used to steal alcohol for weekends and give people free groceries in my old Supermarket job.",
    "text": "I began working for one of the main UK supermarkets after I left school and started college a few decades ago. I knew a few people working there, including a couple friends of mines that would party with me at weekends. I started in the cafe section (mostly just stole buttered toast there lmao) but eventually got moved to the top tier of the peasant employees - the tills! One friend and I were often next to each other on tills or just a few spaces between us. We would get high in her car during our breaks and use receipt paper to write messages back and forth that would often send us into mad giggles. I actually still have some somewhere haha.. I remember literally having to hide my head under the till desk because I could not contain my laughter (think desperately holding back laughter while getting into trouble by teachers at school lol) while a decently sized queue - at one of the most busiest periods of the day - waited for me to begin scanning. I think I pretended I dropped a pen or some shit so i could pull myself together😂\n\nAnyway context given, time to confess my crimes..\n\nI liked scanning fast, much of the time way too fast for the scanner to pick up on the item. That would usually mean you pull item back and rescan till it beeps. But my friends **imaginary for legal purposes and post rules** who had been on tills longer than me would purposefully not scan a decent amount of my shopping anytime I was lucky enough to shop while they were on. So I had to pay it forward obviously! Family, friends and strangers alike all struck luck anytime they queued at my till and had a nice surprise when the amount wasn't as much as expected. \n\nMy **imaginary** friends also showed me how we got our free alcohol for the weekends... one of us would go in when we knew another was on tills and pick up a few bits including our preferred bottle of spirits and mixers etc. Anytime anyone bought alcohol a warning about age restricted items would pop up and we either had to click that they were 'of age'/ or that they were underage/ had no ID. It all sounded and looked the same to shift leaders, other than we usually take the alcohol away if we cant verify legal age. But we would just click underage/no ID, pretend we pressed the other option and slide that glass bottle on down to be bagged up with the rest of the stuff (that we would pay for lol) No one was ever any the wiser 🥸 \n\nManagement were bellends and I walked an hour into my last shift after a disciplinary meeting about a shift I had taken off after a cousin took his own life. This was only 6 months after losing my first love in a car accident so I was retriggered about that and obviously devastated over this family loss.. so they weren't happy I was taking time off again after all the time I'd had off when my boyfriend died. So I quit there and then and walked out. Place was so toxic and cliquey! \n\nAlso while I worked cafe they served fish that had maggots and there were tiny flies in every vinegar bottle.. was the worst part of supermarket to work! My next job was in a seafood factory and honestly still one of my favourite jobs I've worked. Except in winter.. omg those 5am freezing cold starts were brutal. \n\nI hereby declare my remorse (as stated in post rules lol) I'm so so so remorseful and sorry for my crimes 🙏 Thank you for reading ",
    "score": 15,
    "created_utc": 1745998127.0,
    "subreddit": "confession",
    "id": "1kbaohr"
  },
  {
    "title": "I cant stop thinking about my camp counselor. Its been 2 years.",
    "text": "Met him when I was 15 (f) and he was 19. At subsequent camps, though there was never any flirting or ANYTHING weird on his part, we had a spark. Whilst barely knowing each other had a conversation that lasted over 3 hours one time. I got fanny flutters at the prospect of just seeing him- its hard to put to words how incredibly attractive I find this man. His smile makes me want to melt into the ground and never get up again. Im now 18 and I havent seen him for a year but I feel the exact same way and have never been able to forget about him.\n\nCONTEXT: I met him during a time in my life when I felt incredibly lonely and thinking of him I know was a way of escaping the emptiness I felt around me. But what I felt for him I think was totally real and to this day ive never felt similarly about anyone else. Now when I think about him it just makes me sad because realistically we have no chance of being together anytime soon and he doesnt really seem interested in me much, the times we occasionally message. But he also doesn't know I've turned 18 so wouldn't have to feel weird anymore about showing interest?  So maybe things would be different if I could find a way to tell him? Or am I just kidding myself? But I can't stop thinking we'd be amazing together.\n\nI would love if some kind soul could give me a bit of honest advice. Sorry for the rant.",
    "score": 59,
    "created_utc": 1745970511.0,
    "subreddit": "confession",
    "id": "1kb2mwy"
  },
  {
    "title": "La doble cara de la sociedad y del internet.......",
    "text": "Las personas son hipócritas, todos lo somos, incluso yo. Ser hipócrita es mostrar una cara que no es la nuestra, hacer lo que los demás esperan, aunque por dentro estemos rotos. Todos jugamos a encajar, a mostrar una imagen perfecta, pero en el fondo estamos vacíos. A veces, nos acercamos a alguien esperando algo real y nos encontramos con una mentira. Todos tenemos una máscara, todos nos escondemos detrás de algo que no somos. Un ejemplo claro es el de las redes sociales. Todos publicamos lo que queremos que los demás vean: sonrisas, viajes, éxitos. Pero, ¿quién muestra sus peores días? ¿Quién muestra la soledad, el miedo o el cansancio? Nos han enseñado que hay que ser felices todo el tiempo, que debemos mostrar lo mejor de nosotros, pero no todo es color de rosa. Todos usamos máscaras, todos escondemos algo, todos buscamos aceptación. La verdadera pregunta es: ¿quiénes somos cuando dejamos de mentirnos a nosotros mismos?.",
    "score": 0,
    "created_utc": 1746068872.0,
    "subreddit": "confession",
    "id": "1kbyvxc"
  },
  {
    "title": "My sister and I swap places Even though we aren't twins.",
    "text": "My sister and I swap places all the time. We aren't even twins, we are two and a half years apart. But we both have brown hair, brown eyes, medium build, similar faces. \nWe're apparently alike enough that people don't question it, or just think they're crazy. \n\nI have even attended doctor appointments for her because she forgot to cancel and couldn't pay the cancelation fee. (Obviously not blood work/tests) and her routine doctor didn't say anything to me about it. I also showed a house to a sort of family friend for her, and just answered all the questions as if I was her. She has also taken my kids to places for me, and just pretended to be me and non of the parents acted like it was strange.\n\nOur husbands think what we're doing is a little wrong, but sometimes being in two places at once it's just so convenient.",
    "score": 6838,
    "created_utc": 1745866830.0,
    "subreddit": "confession",
    "id": "1ka3krs"
  },
  {
    "title": "Broke my iphone! on that one bad morning, a rare second of rage,",
    "text": "just letting it out!!\n\non that one bad morning, a rare second of rage, i threw my iphone at the wall like a fast pitch, and it was destroyed!\n\ninstantly regret it as i have no backup, can;t get my screen to work (though the phone seems operational) and im out of warranty!",
    "score": 3,
    "created_utc": 1746006030.0,
    "subreddit": "confession",
    "id": "1kbcfa9"
  },
  {
    "title": "I tried to kms 3 days ago & I don’t know where to go from here",
    "text": "I don’t know if this will get banned or not but I just need to scream/cry into the void for a few minutes.. I’ve had quite a few painful losses in my life this past year on top of already having ptsd from losing patients to covid (I’m a cna) .\nI have been overwhelmed , stressed to the max & just was at my breaking point so a couple days ago I tried . If my neighbor would’nt have seen me , I wouldn’t be here right now . I’m mad that they stopped me . I’m even more stressed & full of anxiety . I just don’t know where to go from here or what to do to get help . Everyone is saying “take it one day at a time , tomorow will be better” I don’t want a tomorrow at all . ",
    "score": 6,
    "created_utc": 1746003703.0,
    "subreddit": "confession",
    "id": "1kbbwvh"
  },
  {
    "title": "Me and my friend stole burgers from Wendy’s in the late ‘90s.",
    "text": "Back in middle school — and well into high school — me and my best friend were really in to phreaking, prank calls, etc. It was all harmless stuff to keep ourselves entertained. Most pranks were based on challenges such as “how long can you go.” The idea was to keep the other party on the phone for as long as possible. Our record was ~ 23 minutes to order a single pizza. \n\nMy friend had multi-line phones at his house (one ISDN, and 3 regular landlines) so we decided to start doing conferenced prank calls. We’d often dial 6 digits, switch to the second line and dial 7, then switch back and dial the final digit, and connect the two random people or stores.\n\nOne day we decided to have some fun. We wrote up a script — along with talking points and possible questions from the employees —  and called up several Wendy’s locations around town with the same spiel: “hello, please get the manager, and hold for corporate.” It took us a couple hours to call every location (in groups of 4) with managers who were present. \n\nThe pitch went something like this:\n\n“This is Wendy’s corporate franchise development. We’re losing sales to McDonalds because we don’t have a Big Mac equivalent. That changes today. \n\nWe’re giving each location an opportunity to create something to go up against the Big Mac. We thought the ‘Big Wendy’ might turn off customers, so we’re calling it the double-double Wendy Wendy for now. \n\nYou have one week to work together to create your own version of what you think a Big Mac competitor should look and taste like. Starting next Friday, and throughout the following week, a customer will ask for two double-double Wendy Wendy meals. You will ask them what kind of beverage they would like, then instruct them to pull aside while you prepare their meal. You’ll make two double-double Wendy Wendys, and serve them with two Biggie fries and two Biggie drinks of their choice. They will not be charged for this.”\n\nMost of the questions were along the lines of “what should we do for sauce, and what about the middle bun?” We told them to think of something, as that’s part of the fun, and the winning recipe would net everyone a healthy reward. \n\nFlash forward to the following Friday, we tried it out. The first location had no idea what we were talking about, so we left. The second one took about ten minutes to bring us our meals, but it worked! We visited 5 more locations that week, and dined like kings.\n",
    "score": 17,
    "created_utc": 1745978401.0,
    "subreddit": "confession",
    "id": "1kb59d7"
  },
  {
    "title": "I put down a friend who asked me out when I was younger.",
    "text": "When I was in 6th grade, one of my best friends asked me out. And I put him down HARD. I don't recall very well, but many of my still friends recall the event and all say the same thing.\n\nI was Vicious.\n\nThings along the lines of nobody will ever love you.\n\nI regret it deeply to this day. I could have been nicer. I could have. But I wasn't.\n\n(BTW, if you go thru my comment history, you'll find that I'm a pan-non bianaro person, but I didn't realize this in g6, so I was kinda uncomfortable being with a (trans) man(F-m).)",
    "score": 0,
    "created_utc": 1746069927.0,
    "subreddit": "confession",
    "id": "1kbz6ud"
  },
  {
    "title": "There is a mystery that I need to talk to you guys about",
    "text": "So I'm 20 years old. I was growing in my teen years and at 17 I stopped and never grew again. I also don't look my age, when people guess it's always the age range from 12-17. What I Mean by I stopped growing, I haven't got taller, my muscle mass hasn't increased, my face and shape haven't changed, voice hasn't changed nothing else. I've been trying to find every possible answer on google for this but been able to find nothing. I've even gone to the doctor for blood test to make sure everything is coming back fine. I've done Testosterone check, hormone check, urine test and it all comes back normal. \n\nAnd then what makes this even more unusual, I have pubic hair, armpit hair, slight bit of facial hair, and starting to get chest hair. I was thinking to myself I have a hormone Deficiency or an infection. But if I had a deficiency or infection, it's most likley I would have known by now because of blood tests. And if it went untreated, it's most likley I would have side effects. It's like I stopped going through puberty. I don't know what else, it's a mystery. ",
    "score": 127,
    "created_utc": 1745937653.0,
    "subreddit": "confession",
    "id": "1kapl5p"
  },
  {
    "title": "Sort of made horrible prayer, not sure if due to ocd or not",
    "text": "This is going to confuse a lot of people but I’ll try my best. OCD could be tricking me. I don’t know. But I’ll do my best to explain. Warning: there are some extremely sensitive themes including racism.\n\nOCD has caused me to worry about making bad prayers. It is mainly an anxiety of what others would think of if I prayed for something bad. Basically, it can think of something bad, and I can think of why I want it, and say “amen” pretty easily. Not sure if that constitutes a prayer really since it is ocd driven, and might even feel more real to me than it actually is, but it gets very complicated.\n\nNone of this makes any logical sense to anyone but me, but to me it makes sense and that’s the issue. My mind invented something where I can pray to pray for something. Yes, that’s right, and it makes no sense. Essentially these ideas for prayers come in automatically. I don’t necessarily choose them. I can somewhat choose how I react, but that is where it gets tricky. OCD also blunts my emotions with certain prayers or makes things feel more real than they are\n\nSo, what happened, is my ocd targeted the theme I was most worried about having a bad prayer about, which was unfortunately racism. In the past, I made a mistake that was racist (I won’t get into what it was here), and I thought about it a lot. I imagined people never wanting to forgive me and saying I deserve to suffer forever. Additionally, worrying about making racist prayers made this go up. It was frustrating, because with ocd it can take what people say too literally. So if someone says: “you deserve to suffer,” I might be thinking that thinking about it 10 hours a day for multiple months was justified. This made me have a misdirected frustration towards the people I perceived as yelling at me, which was unfortunately people of color.\n\nHere’s where ocd comes in with the prayer obsession. OCD gave me the idea: well you’re so mad at them you could pray for them all to die. Unfortunately, with the prayer obsession I’ve had, I’ve had a bit of a history with doing bad prayers when I’m not feeling great, and I don’t know if that is just part of the ocd or not, or just doing them to do them. One example is world war 3. I don’t want people to get hurt, but when I was feeling horrible I thought “screw it, I’ll pray for it cause I want to die.” I knew God wouldn’t actually do it, and the normal me didn’t want him to. \n\nThen, and I don’t know why, it seemed extremely easy for a moment to pray for people of color to die, and I actually almost did it, but I stopped myself. This is where the praying to pray comes in. With ocd, if I have a moment where I almost did a bad prayer, my mind “saves” that mindset, and it is possible for me to go back to it any time. So this situation will present itself many times to me. With praying to pray, I can essentially be put back in the mindset at any time no matter what is going on, and by saying “amen,” my brain basically magically does it and it feels like the same thing. Because it feels real to me, it seems like the same thing as a prayer. Last night that is what I did for this and I regretted it less than a two seconds later. So basically, I ended up doing a prayer that was racist. This is exactly what happened in that moment.\n\nThis isn’t who I normally am (although my brain would disagree), but in that moment, with magical thinking, I prayed for all people of color to die, out of what my brain said was “hatred.” My brain also said I felt genuine hatred, but I don’t think I really do. I think it is all related to a misdirected frustration of feeling like I was yelled at, which stemmed from ocd. After the prayer, all those feelings were immediately gone. I don’t know how messed up my brain was, or how much of a role ocd played. It probably at least blunted my emotions. It sort of came on all of the sudden too, but I did it. I’m really sorry. I don’t hate people of color despite what my brain says, but I feel like I did something really bad. \n\nWhen I sit with what happened and don’t engage with it, it does not feel like a big deal at all. The guilt is almost all ocd driven. So I don’t know if that means there is something I’m missing or not. I might be missing something, but I know what happened in the moment ",
    "score": 2,
    "created_utc": 1746031314.0,
    "subreddit": "confession",
    "id": "1kbl33i"
  },
  {
    "title": "I'm on my third year of college and I know nothing about my major.",
    "text": "I'm currently studying to be an accountant and I spent the last 3 years either cheating or just passing out of pure luck, I have no idea of how to anything related to accounting if someone asks me to do a balance sheet I'll literally fold, I have no idea of what I'm doing with my life or why choose this major, I genuinely don't know what I'm gonna do after college ",
    "score": 4,
    "created_utc": 1746003892.0,
    "subreddit": "confession",
    "id": "1kbbyeu"
  },
  {
    "title": "I used to be too reactionary, so I made myself too detached in return",
    "text": "My ex was emotional manipulative and abusive. Every single thing would be turned against me. I said hi to my sister, now I'm plotting to run away with her and disappear from his life. I said I don't like something, it's obvious a slight against him personally. He violated my privacy to the absolute max. He even read my emails from years before we'd even met.\n\nEvery single thing he did was meant to get some type of reaction from me. Cries, arguments, etc. so I started shutting down. The very last straw was when I was a month post partum and was absolutely suffering from sleep deprivation and post partum depression. I checked his phone because he was more attached to it than usual.\n\nAnd there. On Instagram. He was messaging a woman he told me all these negative things about. Heart eyes and \"you're so sexy\" and \"I can't wait to f-ck you.\" Details on what he wanted her to do to him. Like he was going to. That was the last time I cried.\n\nI went stone cold. There was no reactions to anything and it made him so angry. He would go further and further to get something out of me and nothing worked. I snipped any connection I had to genuine feelings.\n\nI've been away from him for three years now. I can't find the real reconnect. I've managed to find a way to react to things, but I'm sarcastic and quick-witted, not heartfelt. It takes me days to process feelings and to have some sort of reaction and I don't know how to fix it.",
    "score": 79,
    "created_utc": 1745943205.0,
    "subreddit": "confession",
    "id": "1karuab"
  },
  {
    "title": "I work gig jobs on the side and I accept no-tip orders just to never actually fulfill them to intentionally delay the non-tipper's order longer",
    "text": "So I'll be logged in to DoorDash or Walmart Spark and I'll accept orders from non-tippers with zero intention of doing the order. I accept it with the intention of delaying their order for however much longer for being a non-tipping piece of shit.  I do it particularly on high mileage ones because the customer knows exactly what they're doing.\n\nSo no, I'm absolutely not sorry. I enjoy doing it. ",
    "score": 0,
    "created_utc": 1746073991.0,
    "subreddit": "confession",
    "id": "1kc0ck8"
  },
  {
    "title": "The paperwork wasn't filled out a job and I got it",
    "text": "I walked into a coffee shop and let me tell you what happened. So I'm told by some people that I'm bulky. I had somebody ask me before if I Iift weights, and I said no. I don't ever lift weights but I exercise sometimes. One time I was at the grocrey store with some of my cousins. I one of my cousins tell me about my body shape. And this is what happened at the coffee shop. I entered the store and there was a guy sitting down at a table. At first he looked at me, and then he looked down at my legs. He had his eyes on my legs for like 6 seconds and then he looked away. It took me a second to figure out why he was looking for so long. At first I thought that my shorts looked too tight, I had something in my pocket that caught his attention, and then I realized why. People have told me that my legs are bulky as well, and it appears I do squats. ",
    "score": 0,
    "created_utc": 1746059722.0,
    "subreddit": "confession",
    "id": "1kbvys4"
  },
  {
    "title": "just look at this, its the best thing youll see today",
    "text": "just watch [https://youtube.com/shorts/6V83cuGwYdA?si=\\_Xn8x4BHs4pSWzQm](https://youtube.com/shorts/6V83cuGwYdA?si=_Xn8x4BHs4pSWzQm)",
    "score": 0,
    "created_utc": 1746056060.0,
    "subreddit": "confession",
    "id": "1kbupkn"
  },
  {
    "title": "I judge your parking-mostly parallel and backing in",
    "text": "Title says it all. Whether I want to or not, if you can’t back in or parallel park I will not forget and I will unconsciously judge you. \nFind an open parking lot and practice, especially if you’re a grown adult, act like one and park your vehicle properly or don’t drive.",
    "score": 12,
    "created_utc": 1745971674.0,
    "subreddit": "confession",
    "id": "1kb3163"
  },
  {
    "title": "I lost my cool on my addict friend last night after he drank again",
    "text": "He was fresh out of detox. For the past week or so every other conversation has been him asking me for reassurance about something stupid. The same exact thing over and over. I finally told him that I wouldn't have the same conversation with him anymore. He either believed I was his friend or he didn't and I couldn't put the energy into convincing him constantly especially after I had driven him to the ER, sat with him while he went through a million mood swings as he is withdrawing from alcohol, drove him HOME from the hospital, cleaned his room, and bought him food.\n\nI was tired. And he kept pushing. I tried blocking his number for a little while but he just kept calling me via whatsapp. So I snapped. I swore. I told him... idk I was mean. I didn't say anything untrue or anything but I definitely let him have it. I said things I specifically knew would hurt him because he had been insulting me.\n\nI feel awful but also I feel so of justified and I just don't know what to do. I'm tired.",
    "score": 23,
    "created_utc": 1745957188.0,
    "subreddit": "confession",
    "id": "1kaxj6w"
  },
  {
    "title": "The last time I got charged with disorderly conduct was the most stupod",
    "text": "Feel like gettin this off my chest randomly AA style. \n\nI went to one of those automatic car wash things, but the ones that have a conveyor belt thingo. When you drive a manual car (stick shift for you Americans), neutral gear is an obvious thing. I can drive those and I’m aware.\n\nI was driving an automatic so I didn’t know how to put it in neutral really. I told the guy it was, but it was in park. \n\nThe conveyor belt worked for a bit and then jammed in the foam rotary sponge section. I got out of my car and left it there for a bit. \n\nThat is how I last got charged with disorderly conduct was for abandoning my vehicle in the middle of the car wash rotary foam roller section thingo. Thanks for listening to me ",
    "score": 0,
    "created_utc": 1746018269.0,
    "subreddit": "confession",
    "id": "1kbfz3w"
  },
  {
    "title": "Can’t forget the way  she dressed and her body looked",
    "text": "M27 Indian, living in the US. Just a few hours ago, I was out playing snooker with a friend at a bar. When we stepped outside, we noticed two girls—one Asian, the other African-American—smoking a joint nearby. While my friend went to get the car, I waited across the street.\n\nHe took about 5–7 minutes, which gave me some time to notice them from a distance. I found myself particularly drawn to the African-American girl—she had an athletic build that caught my eye. After a few minutes, she called out, ‘Do you have a lighter?’ Without thinking, I blurted out, ‘I don’t smoke, sorry,’ and they both laughed.\n\nSoon after, my friend pulled up in his black Mustang. As I was getting into the car, I think I heard the Asian girl say to her friend, ‘You should’ve asked better.’ I’m still not sure if I heard that right, but it stuck with me. Honestly, part of the reason I didn’t approach them was that they looked a little young, and I didn’t want to take any chances.but God,I can’t forget her @ss",
    "score": 0,
    "created_utc": 1746065353.0,
    "subreddit": "confession",
    "id": "1kbxsrs"
  },
  {
    "title": "Nunca la consiguere, y si lo hago, no la merezcocha",
    "text": "Vengo aca a expresar lo que no puedo en otros lugares\nMe gusta una mujer mayor a mi, ella es lindisima, su cuerpo es hermoso, su forma de hablarme me alegra el dia, que me mire me vuelve loco por dentro. Yo ya me le declare y le dije mis sentimientos pero no me acepto (tampoco dijo que no) y ahora somo amigos, que pasa, sigo intentando pero... me puse a pensar, yo no sé que hacer para ayudarla cuando esta alterada o esta triste y tambien solo tengo 10 lucas con cuea (lo que significa que no puedo regalarle nada bonito). \nElla es lo que siempre quise pero ¿que hago si posiblemente la tengo de polola?\nAdmitamoslo soy un fracasado, soy timido, pobre, npc, y muy sensible a insultos. Aunque lo consiga y ella \"posiblemente\" la tenga de novia, no durara mucho segun mi respecta\n\nEn resumen: la quiero pero dudo si ella me quiere, ademas de que quiero lo mejor para ella y yo no soy eso\nNo pido que me den consejos\nSolo vine a liberarme",
    "score": 0,
    "created_utc": 1746042001.0,
    "subreddit": "confession",
    "id": "1kbpdi7"
  },
  {
    "title": "I went through my moms phone while at my mom’s bedside during her TBI",
    "text": "My mom was in and out of consciousness; she had a stroke and a brain bleed. She was stable and had experienced the TBI that morning.\nMy mom has a history of seeking younger men. She has even went so far as to have relations with my sister’s boyfriend’s brother who was 23, my mom 49.\nI’ve caught her with so many men. It’s like a fetish. Even the men she’s married are at least 7 years younger. I think it’s disgusting. My mom has a history of mental illness. She loved men who drink and do drugs. She always put men before me and my brothers and sisters.\n\nWhile sitting beside her while she was resting, she was getting all kinds of messages, naturally.\nIn the social media chats and messages, I saw a familiar name of one disgusting, despicable individual of someone I used to know. A manchild. A manchild who is looking to be taken care of by a woman. He has no shame. This person used to want to date me. I kicked him to the curb and he fawned over me for months, even driving 30 miles out of the way to pass my house to see if I had someone over.\n\nHe was sexting my mom. She was entertaining it.\nTo this day, she has no idea that I know. It was really hard to learn this while she was hanging delicately between life and death. She’s made a full recovery (walking, talking, driving, holding a job) since then but I wish I could talk to her about it.\n\nI feel bad for snooping, but I still feel disgusted by all of it. She knows I am sickened i am by him. I want him to have absolutely no access to me by any means. I think about this almost every single day since it’s happened.\n\nHave I violated my mom’s space? I feel like she is perpetually a teenager and needs constant guidance. Still, I know it doesn’t justify what I did. I’m sorry mom, and now I wish that I didn’t know what I know..",
    "score": 442,
    "created_utc": 1745887574.0,
    "subreddit": "confession",
    "id": "1kabe1v"
  },
  {
    "title": "Jasa Pasang Atap Baja Ringan - Solu Steel Kontraktor",
    "text": "Solu-steel kontraktor menghubungi kami untuk meminta memperbaiki atau restrukturisasi dan optimasi SEO website mereka yaitu solu-steel.com. Solu-steel kontraktor adalah perusahaan kontraktor yang berfokus pada konstruksi atap baja ringan, seperti atap genteng metal, atap spandeck, kanopi, dan plafon untuk berbagai macam bangunan mulai dari rumah, cafe, gudang, gedung, dan jenis bangunan lainnya.\n\n# Analisa SEO Website\n\nSetelah menerima permintaan tersebut tim langsung mulai melakukan analisa dan ditemukan beberapa permasalahan, sebagai berikut :\n\n# Analisa On – Page\n\nDalam analisa On – Page, desain atau tampilan website sangat penting, namun yang lebih penting adalah struktur halaman website. Mulai dari pengaturan Heading, meta tags, desain website, hingga penamaan image dan alt image.\n\nDari analisa tersebut kami menyimpulkan, website secara menyeluruh dilakukan perombakan mulai dari :\n\n1. Penentuan desain website yang sesuai dengan branding solu-steel dengan warna merah putih dan hitam.\n2. Halaman layanan yang disesuaikan dengan layanan perusahaan.\n3. Penentuan kata kunci sebagai heading halaman layanan.\n4. Mengatur tata letak setiap menu atau konten untuk memaksimalkan user experience.\n5. Dan beberapa aspek teknis lainnya.\n\n# Analisa Off – Page\n\nAnalisa Off – Page ini mengacu pada link tautan atau backlink yang mengarah ke website [solu-steel.com](https://solu-steel.com/). Berikut analisa kami :\n\n1. Website sudah memiliki backlink namun memiliki jumlah yang sangat sedikit sehingga otoritas domain pada search engine masih kurang maksimal.\n2. Link tautan kurang berkualitas dan kurang relevan dengan niche website.\n\n# Request Kata Kunci\n\nKlien solu-steel kontraktor memberikan request kata kunci untuk websitenya. Berikut adalah request kata kunci yang diminta :\n\n# 1. Harga Pasang Atap Baja Ringan\n\nKata kunci [Harga Pasang Atap Baja Ringan](https://solu-steel.com/harga-pasang-atap-baja-ringan/) ini mengarah kepada berapa besaran biaya pemasangan atap baja ringan mulai dari jasa pemasangan hingga biaya bahan baku atau materialnya. Masing-masing material memiliki harga yang berbeda tergantung pada jenisnya, tingkat kerumitan struktur, dan luas atap yang ingin dikerjakan.\n\n# 2. Pasang Atap Baja Ringan Bandung\n\nKata kunci [Pasang Atap Baja Ringan Bandung](https://solu-steel.com/pasang-atap-baja-ringan-bandung/) dipilih mengacu kepada dua hal utama, yaitu layanan jasa yang ditawarkan dan area layanan solu-steel kontraktor di area Bandung Raya.\n\n# 3. Kanopi Baja Ringan Bandung\n\n[Kanopi Baja Ringan Bandung](https://solu-steel.com/kanopi-baja-ringan-bandung/) dipilih juga karena salah satu layanan solu-steel kontraktor adalah jasa pemasangan kanopi yang memiliki area layanan di Bandung Raya. Memiliki volume pencarian yang cukup tinggi di area Bandung dan sekitarnya.\n\n# 4. Kontraktor Atap Baja Ringan Bandung\n\n[Kontraktor Atap Baja Ringan Bandung](https://solu-steel.com/kontraktor-atap-baja-ringan-bandung/) adalah kata kunci yang menggambarkan tentang bisnisnya secara keseluruhan yang berfokus di wilayah Bandung dan sekitarnya.",
    "score": 0,
    "created_utc": 1746005944.0,
    "subreddit": "confession",
    "id": "1kbcel1"
  },
  {
    "title": "Can I come to the arcade with you on Friday awww man",
    "text": "Bitch No No bitch bitch bitch no Bitch No No bitch bitch bitch no bitch bitch bitch bitch no no no bitch no bitch no bitch no no bitch bitch ",
    "score": 0,
    "created_utc": 1746053154.0,
    "subreddit": "confession",
    "id": "1kbtok8"
  },
  {
    "title": "I’m a black girl that lives in Crown Heights Brooklyn, and around once week I hang out with a Hasidic man in my apartment.",
    "text": "I just needed to get it off my chest. We don’t have sex, but there is attraction and we talk about it. ",
    "score": 380,
    "created_utc": 1745885283.0,
    "subreddit": "confession",
    "id": "1kaamc3"
  },
  {
    "title": "ive been lying to myself, but here is everything going wrong right now",
    "text": "\n\nI need to talk about this because i feel like it will make me more at peace with it/make my mind clearer. Throwaway because i had my face in the other one. Please ask questions.\n\nIm seventeen. i broke my $h streak after seven months. I was doing so well, told my parents and friends that i was doing so much better and i dont think i could bring myself to ever do it again. my dad frequently says that im obviously doing much better and it makes it hard to talk about it because i dont want to disappoint him.. Did it one night and instantly felt relieved. God knows why.  My mum is a classic asian parent, but shes gotten so much better at catering to my emotional and mental needs even though i know the idea to her is confusing. My dad is strict in all the wrong ways, for the wrong things i think. I love them both but they make me feel really at war with myself. I can go into detail about what they have both done if you ask. \n\nI am failing year 11, i cant concentrate, my head hurts and i blank as soon as i read too much. My memory is beyond bad, its almost like i am 80 years old.I constantly over sexualise myself because i feel like thats all im good for; but i’m afraid of sex due to only one bad experience. i ‘m constantly stuck between wanting to be skinny and curvy. Too scared to lose my boobs because its the only thing people acknowledge me for. I get offered money for sexual services, even though i have never offered, and the idea disgusts me. I am stuck on my first boyfriend and he hurt me so bad, and im ashamed that i go back everytime he is bored. I am talking to him currently and its eating at me, i know i am not the only one again. I cant even look or be near another guy anymore, with out instantly leaving/cancelling/ghosting. \n\nI am a bad friend and never had a friendship that wasnt fueled by my own jealousy, i guess because im so unhappy with myself. Im a two faced bitch who will do anything for people to like me, but if they dont like me, or we fall out, (or even if i think they will hurt me), i switch up and become so nasty i dont even recognise myself. If someone hurts me even a tiny bit, i will go to the ends of the earth to ruin that persons life, and have.\n\nI go through phases where i want to be gone, and where i cant imagine anything better than life. I just want to make it to my 18th birthday, but its becoming a struggle. I am not sad, i am not angry, i am not tired, i am just nothing. Every morning i crawl my way to the end of the day. Sleeping is the only peace i get. Dont know how long i can go like this. Feeling nothing is almost worse than i was really sad.\n\n",
    "score": 3,
    "created_utc": 1745976879.0,
    "subreddit": "confession",
    "id": "1kb4rqn"
  },
  {
    "title": "I never panic buy and damnite I decided to do it today for once",
    "text": "I was late to the Covid panic shopping spree, and I never get with it for all the major weather events! Hurricanes, ice storms, blizzards, and I’m sure I’m missing some other disaster. The only ones I’ve been unfortunate enough to miss out on are tsunamis and volcanos erupting. \n\nI decided to indulge myself. I got off work and I went and bought a years worth of every product I use i could confidently identify as made in china (non perishable). It was actually a little bit fun! I also know that even if prices don’t sky rocket at least I don’t have to worry about any of it for a year. \n\nDon’t worry yall I left the toilet paper alone. I have a bidet. I did forget milk toast ingredients… ",
    "score": 166,
    "created_utc": 1745895759.0,
    "subreddit": "confession",
    "id": "1kae041"
  },
  {
    "title": "I walked into a coffee shop and let me tell you what happened",
    "text": "So I'm told by some people that I'm bulky. I had somebody ask me before if I Iift weights, and I said no. I don't ever lift weights but I exercise sometimes. One time I was at the grocrey store with some of my cousins. I one of my cousins tell me about my body shape. And this is what happened at the coffee shop. I entered the store and there was a guy sitting down at a table. At first he looked at me, and then he looked down at my legs. He had his eyes on my legs for like 6 seconds and then he looked away. It took me a second to figure out why he was looking for so long. At first I thought that my shorts looked too tight, I had something in my pocket that caught his attention, and then I realized why. People have told me that my legs are bulky as well, and it appears I do squats. ",
    "score": 0,
    "created_utc": 1746045251.0,
    "subreddit": "confession",
    "id": "1kbqna8"
  },
  {
    "title": "I raged sohard during gaming, my neighbour got concerned",
    "text": "I'm so so so ashamed of myself. One neighbour called the cops. They thought something bad was happening to me. I was fighting the crones in witcher 3 on new game plus, deathmarch, and if you're very familiar with the game you know this fight is very hard and tedious with these circumstances. It's not exactly an excuse, but yea, for context. For most of the game I was quiet, but I spent the last hour on that fight, dying multiple times, yelling, banging the desk. Also it was a around 3 am, which makes me feel even worse, because I disturbed peoples sleep. I'm also mad I lost the track of time and played for around 6-7 hours, and then after I finished I was so anxious and mad after everything I fell asleep at like 5am. The night before was fine, I played for 4 hours, I remembered to set an alarm and finished playing at a reasonable time, and I wasn't raging as much. Most game sessions are fine, but if I encounter a difficult oponent/quest/level my emotions take control. I rage so hard and I often won't give up till I win. Sometimes I also forget to set up a timer like today. I think this is a big wake up call for me, I definitely need a looong break (2 weeks ago I didn't play at all though) and maybe go for therapy, because I definitely have anxiety issues and gaming is one way to occupy my thoughts fully. ",
    "score": 47,
    "created_utc": 1745917518.0,
    "subreddit": "confession",
    "id": "1kajgvx"
  },
  {
    "title": "I can't look at girls with pink lips normal anymore",
    "text": "For context I been watching porn for a couple years and trying to stop watching it but one thing that has stuck to me is I all ways wonder if girl with pink lips is it pink... ",
    "score": 0,
    "created_utc": 1746047771.0,
    "subreddit": "confession",
    "id": "1kbrmxf"
  },
  {
    "title": "We should DEFINITELY free all the slaves in the U.S",
    "text": "HELLO, I have came up with the idea to make slavery illegal I hope you all respect my wishes. ",
    "score": 0,
    "created_utc": 1746044417.0,
    "subreddit": "confession",
    "id": "1kbqbm5"
  },
  {
    "title": "creí que sería fácil vender contenido para adultos",
    "text": "la verdad es que no tengo idea como funciona ese mundo, pero veo que es muy complicado tener público para eso o intentar conseguirlo",
    "score": 0,
    "created_utc": 1745985734.0,
    "subreddit": "confession",
    "id": "1kb7jft"
  },
  {
    "title": "I’m not Deaf but that doesn’t stop me from pretending",
    "text": "I am a student of American Sign Language (ASL), currently in my fourth year. Sometimes, and it happens a lot, when I don’t feel like being bothered in public, or I am being harassed for money by a “homeless” person, I start signing and use Deaf voice. It works every time. ",
    "score": 15441,
    "created_utc": 1745800393.0,
    "subreddit": "confession",
    "id": "1k9iv1u"
  },
  {
    "title": "Today, I [19 F], on my birthday, lost the only person I was living for ❤️",
    "text": "\n\nI turned 19 today. I still don't know what to type or how to say all this, but I got the news that my mother passed away today.\n\nRecently, I moved to an entirely new state for college. Ever since the age of 10, I have struggled with making friends — it's not like people don't talk to me, it's just that they only talk when they need favors, like notes or help. I have tried forming close friendships, but for some reason, I have always been treated as if I’m not part of the group.\nI have struggled with my gender identity and sexual orientation growing up too.\nLast year, I got into a good college after giving one of the toughest exams in the country. I had hoped that I would interact with people and try my best to change myself. Unfortunately, college was even worse than my school days. There was a hell of a lot of groupism from the start — based on what language you spoke. There were two majority languages — and unfortunately, I spoke neither. Even though I tried, I was alienated from day one.\nI now had no real people to talk to in college; just a few people who spoke to me only when they needed notes or help.\nAt that time, the only thing that kept me sane was talking to my mother. She had always been there for me and never judged me for struggling with all this.\nEvery day, I talked to her for hours and shared every single thing with her.\nI have been suicidal for the past 3–4 years, but the only reason I never did anything was because of her.\n\nI don't have a good relationship with my dad. He abused me physically and mentally while I was growing up. Even though now he has realized the error of his ways — and I would say he knows he was wrong — the trauma he gave me is too much.\n\nEvery year, I used to celebrate my birthday with my mother only (as I didn’t really have any other close people). I would get a text from 2–3 'friends,' so things still felt somewhat okay.\n\nThis year, in college, we have a group chat made specially just to wish birthdays — but no one cared to wish me.\nI even jokingly told some people the day before that it was my birthday, hoping they would write something in the group — but no one did.\nYes, I know that's embarrassing, but I was that desperate. I wanted my college birthday to be better.\nWhat's worse is that one of them, whom I had told it was my birthday, texted me — but only to ask for notes.\nI wished he had just written two words — just two words: Happy Birthday.\n\nI was waiting for my mother to call and wish me at midnight, but surprisingly, she didn’t.\nI thought maybe she had fallen asleep since she had to work early.\nEven though I was disappointed, I reassured myself because I knew she was the only one who was going to wish me today.\nWaking up in the morning, my dad informed me that my mother had passed away in her sleep (due to natural causes).\nI couldn't believe anything.\nI am still not able to process everything.\n\nBut I know one thing — the person I lived for these past years is no longer here.\nAnd today, in a few hours:\n\nI will go out for the last time, take a round of my campus (my campus is extremely beautiful, and one of the other reasons I stayed sane),\n\nand then I will come back to my room — and, hopefully, I will join her too in the afterlife today itself. ❤️\n\n\n",
    "score": 175,
    "created_utc": 1745881987.0,
    "subreddit": "confession",
    "id": "1ka9h6q"
  },
  {
    "title": "Because of something that happened in high-school, at my core I know I’m a monstrous person.",
    "text": "               I am an awful human being. Male in all the ways the men are afraid to be. It would be unfair to all men that share the same hormones and large frame as me to attribute to my awfulness to my gender. But to pretend that my maleness does not influence the aspects of myself of which I am most of ashamed of would be silly.\n               To get more to the source of my self revulsion I have to elaborate on the night where I think I truly revealed myself— my true heart. At the time I was dating my high-school girlfriend, Rose, and we had plans to stay at her friend’s condo in a nearby city so we could party with people we knew but weren’t too close with. I drove both her and the friend there.\n                At the condo/party I was especially liberal with my drinking. One shot, down went three more, two more with an unholy cocktail of vodka and Mountain Dew Baja Blast, so on and so on. Completely wasted. More drunk than I had ever been before or since. I didn’t remember anything besides the actual act of drinking that night. It was an uncomfortably long gap in my memory. The morning after was a bit hazy as well, but I do remember that something was wrong in my girlfriend’s face. She had been crying and she told me she hadn’t slept.\n                 The ride home was really tense. I kept asking Rose what happened but she wouldn’t say. Not with the friend in the car. After a bit of back and forth through the Notes app on my phone (a note I still have and look at often) we decided to pull over at a gas station to talk.\n                 The conversation that followed was an extremely hard one. Through heavy tears she explained that I had made her and the friend extremely uncomfortable the night before. From her account, I had hit on her friend right in front of her. Repeatedly and pathetically. “Hit on” might not be the right phrase as it conjures images of of bachelors trying to “score” at bars and stuff. The image conjured by what Rose was saying was one of a potential rapist. I was following the friend around the condo, telling her how pretty she was, complimenting her clothes, calling myself her “step boyfriend”, all culminating in a skin crawling event where I told her “we’re going to fuck.” Not even a request, a declaration. One with the likely under tones of “whether you like it or not.” After this, I apparently passed out in the bedroom which Rose and I shared. I think the correct phrase for this situation would be “sexual harassment.”\n                 I was convulsing in sobs when she finished. I remember her consoling me which was a kind act I know I didn’t really deserve. She confided that the fact that I remember nothing from that night made it a thousand times more complicated. Does it really though? While I do wish that I could have those memories back just to fully understand why I did and said those things, I don’t think I was a different person. At some core level, those insanely creepy words came from me. Also, the fact that I willingly drank so much represents a choice to dangerously lower my inhibitions. How could I have known though? How could I have known that my true core, one without the mental blocks of inhibitions, was a six foot tall man demanding sex from a woman who thought she could trust him. All things about myself point to a stand up trustworthy guy. Almost all my friends are women, I have two sisters who I practically raised, I’m good friends with all of my ex’s (excluding Rose for understandable reasons), all of those women would trust me with their lives. I get told I’m sweet, charming, thoughtful, a sensitive and empathetic person who really cares. Why then, for that night, was I completely detestable. A wolf in sheep’s clothing. No, not even for that night, read the “I”s and “me”s of this post. Complete narcissism. Explaining and excusing an event that was nobody’s fault but my own and having  the audacity to be self pitying about it.\n               Anyways, Rose and I broke up. The breakup wasn’t quick. It was months long with a thousand long talks to see if we could salvage the broken trust. I’ve never loved anyone or anything as much as I loved her which makes the events of that night a tragic point in both of our lives. The friend left for college and no one’s talked to her since. I haven’t seen either of them in years. I know I hurt them both. Not in any physical way but in a lasting mental way. When I try to put myself in their shoes that night (which I do obsessively) I can’t escape the truth. I am a horrible human being",
    "score": 38,
    "created_utc": 1745908054.0,
    "subreddit": "confession",
    "id": "1kahbno"
  },
  {
    "title": "What sentence stuck with you the completely changed your life",
    "text": "What made you want to crash out?\nOr what made you want to change your life for the better?",
    "score": 332,
    "created_utc": 1745861536.0,
    "subreddit": "confession",
    "id": "1ka1e26"
  },
  {
    "title": "I was there when Adam Walsh was kidnapped and I was with the people who did it to him!",
    "text": "I was kidnapped.  I was horribly hazed to the point of exhaustion by live wires electrocuting my genitals.  Handcuffs and rapes over and over again.  These two people grooming me to be their lookout inside the store.  I was only 9 years old and the serial killers were much older.  They are famous.  \nI tried to tell a woman who was in the store what was going on but she frowned and just ignores me.  Later I realized it was Adam Walsh's mom.  \nI tried to talk to some of the kids at the gaming area that there were serial killers leading me to get inside the store and that they were waiting outside for everything I was worth but they just shut me down.  Long story short we made such a ruckus we all got kicked out of the place and were told to leave.  \nThey were waiting for us outside.  Sadly Adam Walsh was kidnapped by myself and the other serial killers.  \nI don't know who to tell.  I barely made it out alive.\nIt's on my conscience...",
    "score": 0,
    "created_utc": 1746038222.0,
    "subreddit": "confession",
    "id": "1kbnvu5"
  },
  {
    "title": "arguing with strangers, friends, or partners turns me on.",
    "text": "this has been a thing since i f(23) was a kid. i remember when id argue with other girls in school or even go back and forth online, it excited me. i thought this meant this person must like me because they’re entertaining and giving me attention. this is when i realized tension wasn’t just tension in my head. even when i had “beef” with other girls i still imagine making out with them sometimes instead of fighting. even when i didn’t like the girl. \n\nnow as an adult in the rare instance that i do go back and forth with a stranger online or someone im dating, i tend to say things that bounce off of what they say. i try to find clever replies and when they react to it, i get excited- almost like we’re writing a poem together . i do not enjoy bringing turmoil to others. but after a debate with even someone i may not know online, i be wanting to text them after and hold conversations. often times i get the thought “is this person flirting with me” which i laugh it off. but i can’t help but to feel a little intrigued or turned on going back and forth with other people. gender doesn’t matter and i don’t even have to know what the person looks like. if lm (sleeping with, dating, talking to, focused on, etc), to someone i can easily feed into the drama and drag things out, for the tension to me appears as sexual tension. luckily i have a strong mindset and i don’t personally argue anymore due to my anxiety. but sometimes i can’t tell when im trolling too much and actually bothering people. idk if it matters but i am pansexual so it doesn’t make a difference who im talking to really. \n\nidk if this makes sense. but this is one of those odd ass traits of mine that i can’t just go without telling someone. \n\n(edit: i wonder if anyone understand or goes through the same thoughts)\n(edit 2: i never said i enjoyed starting arguments, on the contrary i’ve specifically stated that i prefer to not argue. it’s just in the instance that i do argue, im more eccentrically equipped) ",
    "score": 157,
    "created_utc": 1745869880.0,
    "subreddit": "confession",
    "id": "1ka4svw"
  },
  {
    "title": "I’ve lied and gotten away many times about being a twin to people who I’ve just met.",
    "text": "\nI’ve lied and gotten away many times about being a twin to people who I’ve just met. I have told countless people over the course of my life I am a twin. I am indeed not a twin. But every time anyone would ask me if I was a twin to someone they saw, I would say yes and never tell the truth. \n\nYou see, I am of mixed race. 50/50 black and white. I don’t see many people like me in my day to day life. In school growing up, it was rare to be in a class or even in a school, with someone who had my exact skin complexion and hair texture. But whenever I did, people would instantly think me and whoever was also biracial, were related. \n\nMy classmate (later friend) and I were sitting in the same group the first day of school when someone asked if we were twins. I instantly said yes but that we have different last names because our parents divorced and decided to surrender full custody of one of us and move away to make it fair. He ran with it and we never told anyone. Even the teacher thought we were telling the truth. I’ve done this numerous times with other biracial people who I encounter and get to know using random lies that sound almost unbelievable but not quite. No one (who didn’t actually know me) has ever suspected me of lying. I do feel bad about certain lies I used because some of my lies were actually kind of dark and happen in real life. I don’t do that joke anymore since I’ve discovered that the real world is not so funny. \n\nEdit: I shouldn’t say I was never suspected by anyone because truly I don’t know that but I was never called out on it if someone did suspect is a better way of saying that. ",
    "score": 219,
    "created_utc": 1745862609.0,
    "subreddit": "confession",
    "id": "1ka1u80"
  },
  {
    "title": "odio mia madre e odio anche il cibo, mi voglio deprimere",
    "text": "che due palle, non ho voglia di fare tutto il contesto perché mi viene solo da piangere e deprimermi, però purtroppo un po' lo devo fare.\n\nsono una femmina di 14 anni, nella mia famiglia SPECIALMENTE CON MIA MADRE, anzi praticamente tutto per colpa sua, c'è un brutto rapporto con il cibo, spesso fa commenti su quello che mangio e le quantità.\n\nsono una persona che comunque un po' ci soffre per queste cose, ammento che odio il mio fisico e farei di tutto per cambiarlo.\nsono abbastanza sicura di avere un disturbo alimentare, collego la fame alle emozioni, quando sono nervosa mi abbuffo e lo stesso succede se sono triste o in ansia.\ndopo le abbuffate mi è capitato di vomitare varie volte.\n\nspesso mi vergogno, e quindi lo nascondo, del cibo che mangio, per esempio se faccio merenda al pomeriggio, cerco di non farlo notare a mia madre o comunque in generale alla mia famiglia.\nmi crea disagio sapere che nella famiglia sono quella che mangia di più(dopo mio padre), e mi crea disagio sapere che mia sorella più grande, è molto più magra di me e ha un fisico perfetto.\n\noggi è il suo compleanno e siamo andate a fare shopping insieme. quando ci stavamo provando i vestiti,\nlei si alza la maglia e mi rendo conto di quanto io sia più in carne di lei, non me ne ero mai resa costo veramente, però oggi mi sono sentita veramente male a vedere la sua taglia di pantaloni in confronto alla mia, e la cosa peggiore è che lei se ne era accorta che ero a disagio e non sapeva come fare, ovviamente io ho cercato il più possibile di non farlo notare, e lo stesso lei, però ero veramente triste di questa cosa.\n\nquando siamo tornate a casa, io ero veramente triste, al centro commerciale sono riuscita a prendere solo un jeans, che tra l'atro non mi convinceva neanche, tutte le cose che avevo provato mi stavano malissimo, non riuscivo ad essere felice e ho paura che mia sorella l'abbia notato.\n\nstavo quasi per mettermi a piangere dentro al camerino quando mi stavo provando l'ennesimo top per l'estate.\n\nquando torniamo a casa sono dovuta andare a ritirare la sua torta di compleanno, e insieme mia madre mi ha detto di prendere le mandorle pralinate, (non so se si chiamano così, ma nel caso sono quelle mandorle avvolte dallo zucchero/caramello) e io ne volevo troppo una, ma questo significava che dovevo aprire io il sacchetto per prima, e mi vergognavo troppo, quindi ho deciso di aspettare.\nquando arriva mia sorella lo apre e ne prende una, così io  colgo l'occasione e ne prendo qualcuna.\n\ndopo un po' ne prendo un'altra, e un'altra ancora (intanto mia sorella se ne era andata, c'era solo mia madre) e mia madre mi dice \"smettila di mangiare quella roba, fa malissimo\" e io non rispondo, di solito quando mi dice queste cose non rispondo mai, faccio finta di nulla.\ndopo un po', tipo 15 minuti, ne prendo unam\nstavo guardando il telefono quindi non me ne ero accorta subito, infatti ho realizzato dopo, però poi mi sono accorta che quando ho alzato la testa dal telefono mia madre non era più nella stanza, ma vedeneola uscire dalla stanza ho visto che si stava mettendo il pacchetto nella tasca, come se volesse portarlo via da me, per evitare che lo mangiassi....ci sono rimasta veramente di merda. \n\nl'ha fatto come se fossi una ragazzina in sovrappeso da salvare...ok che non mi piace il mio fisico, ma so distinguere una persona sovrappeso da una persona LEGGERMENTE rotonda, non mi reputo grassa, le persone grasse sono altre, e sarei un ipocrita a definirmi grassa, ma di sicuro non sono magra, ho un po' di pancetta e le cosce grosse, ma mi sembra molto esagerata la reazione di mia madre.\nla odio sempre di più.\n\n",
    "score": 1,
    "created_utc": 1745951193.0,
    "subreddit": "confession",
    "id": "1kav54i"
  },
  {
    "title": "I sh*t and threw up all over myself at college in the public restroom, naked.",
    "text": "Throw away because no one must ever know. I was in college suffering from food poisoning in my freshman year. After tossing and turning for hours, struggling with cold sweats and stomach cramps I finally fell asleep. Suddenly at about 4AM I woke up with the instant need to go. That night my boyfriend was over so I decided to just sleep in my underwear since my roommate was not in the room that night. I was against the wall on those god forsaken twin beds and threw myself over him. Before I could find where I had thrown my shirt it was already too late. I could feel it coming out and there was nothing stopping it. I decided to make a bee line to the bathroom, fortunately I was right next to the public shared rest room. I ran into the big handicap stall to give me as much room as possible. I sat on the toilet and before I could react I threw up all over my already soiled underwear, the floor, and myself. By the time it all subsided I started panicking. I was now in the public restroom, covered in vomit and diarrhea, completely naked. After listening for anyone in the hallway, I made a mad dash over to the showers. I cleaned myself off as fast as humanly possible, listened for anyone again, peaked out into the hallway and upon seeing the coast was clear sprinted to my dorm room. I practically slammed the door shut and flicked on the lights. My boyfriend then sprung to life just to see his drowned rat of a partner, shaking like a leaf, sobbing. He asked what happened and I broke down. He helped me dry off and made sure I was ok before he let me leave, fully dressed this time, to go clean up the floor (I’m not a monster). While cleaning I buried my underwear at the bottom of the industrial trash can and cleaned up the rest of the mess. After being utterly traumatized we decided to have me sleep on the edge fully clothed just in case.  ",
    "score": 1087,
    "created_utc": 1745809700.0,
    "subreddit": "confession",
    "id": "1k9lqvb"
  },
  {
    "title": "I pretend to talk on the phone when I walk past people because I'm too awkward to say hi.",
    "text": ">",
    "score": 40,
    "created_utc": 1745871471.0,
    "subreddit": "confession",
    "id": "1ka5ge2"
  },
  {
    "title": "My type was influenced by a childhood friend I had",
    "text": "Pretty much what the title said, I had a friend back in year 6 who was a lot of things, I find myself comparing everyone to her and it’s been 6 years since we last spoke and we’re both 20 now lol",
    "score": 20,
    "created_utc": 1745880771.0,
    "subreddit": "confession",
    "id": "1ka91c8"
  },
  {
    "title": "Claire and Thomas where the opposite is up to you to see what you think about it",
    "text": "\n\nCLAIRE – Before him\n\nI was coming out of two long relationships. One too lukewarm, the other too chaotic. I had learned to protect myself. I read a lot about emotional dependence, narcissistic perverts, manipulation mechanisms. I wanted to be “lucid”, no longer fall into the traps of disguised passion.\n\nWhen I installed this app, it wasn't to find love. I just wanted to talk, maybe find some human warmth. I wasn't expecting him.\n\n⸻\n\nTHOMAS – Before her\n\nI was coming back from a breakup that had drained me. I spent months recovering. I did therapy. I read everything I could about attachment, relationships, the mistakes I had made. I was ready to love again, but this time, differently. I promised myself to say what I feel, not to play anymore, not to hide.\n\nWhen I saw Claire, I knew it wouldn’t be a meeting like any other. She had a light. An intensity. And a dark side, too, that I recognized in her as in mine.\n\n⸻\n\nClaire's voice\n\nI met him on a Thursday evening, on an app. From the first messages, there was a kind of rare fluidity. In two hours, we already had private jokes, we shared our dreams, our childhood wounds. He said very beautiful, very profound things, and I had this strange feeling: “Either he’s the man of my life, or he’s going to break me into a thousand pieces.”\n\nThe first meeting, two days later, was perfect. He looked at me like I was the only woman on Earth. He was attentive, funny, attentive. He walked me home. He took me in his arms. I felt seen. And it's been a long time since I felt like that.\n\nBut very quickly, it became… invasive. Messages from morning to evening. “I miss you” from the second week. Discussions about “our future”, as if we had been together for months. And when I told him that I needed time to breathe, he got upset. He told me that I was putting up walls, that I was afraid of loving.\n\nI asked myself: is he manipulating me? Is he flattering me just to have me under control? He told me about his exes who “hurt him”, how he was “too nice”. I read articles about love bombing. Everything coincided. And then one day he exploded because I canceled a dinner. He told me that I wasn't invested, that I was playing a game. There, I said to myself: that's typical of a narcissistic pervert. He made me feel guilty, even though I was just setting a limit.\n\nSo I ended the relationship. And I was left with this bitter taste: how could something so beautiful become so suffocating, so quickly?\n\n⸻\n\nThomas' voice\n\nWhen I met Claire, I had a shock. She was brilliant, funny, intense. We talked for hours. She knew right away where to touch me. It was like she already knew me.\n\nI wanted to give him everything. I wanted her to know that I was sincere. I wrote him spontaneous messages, I shared my thoughts, my memories, my fears. She responded enthusiastically at first. Then I felt a change. Less present. Less demonstrative. I thought she was moving away. I was scared.\n\nSo I insisted. I told myself that if I did more, she would see that I was there for real. But the more I tried, the more it closed. One day, she told me that I was “putting pressure on her.” That I was doing “too much”. Yet I just wanted to show her that she mattered.\n\nThen she started to doubt everything. She once told me that my compliments sounded fake, “like learned scripts.” She asked me if I often manipulate women like that. I was shocked. Hurt. It wasn't a technique. It was me.\n\nAnd when she canceled that dinner, I broke down. I felt rejected, humiliated. So yes, I reacted strongly. Too strong. But I didn't want to lose her. And she left. Without another word.\n\n⸻\n\nWeek 1 – The obvious\n\nCLEAR\nEverything happened very quickly. The messages were so fluid, funny, deep. He spoke to me as if he had known me forever. He knew how to ask words, questions, listen. He told me I was “obvious”. I smiled, but deep inside I felt a shiver. Who says that so quickly?\n\nTHOMAS\nShe captivated me from the start. Each exchange made me want to know more. She spoke to me with lucidity and modesty, a form of restraint that was beautiful to observe. I let myself go. I said what I felt. I wanted her to know I wasn't playing. That I wanted to build, not just consume.\n\n⸻\n\nWeek 2 – Intensity\n\nCLEAR\nHe called me every evening. He wanted to hang out, all the time. I was flattered… then a little worried. He told me “I adore you”, then “I feel like we could live together”. I raised an internal flag: This is love bombing. It's too much, too soon.\n\nBut at the same time, he was so sincere. If present. So I said to myself: give him a chance. And I fell a little more.\n\nTHOMAS\nShe was more distant, sometimes. She took a while to respond. I told myself she was scared. I wanted to reassure her. Show him that I was stable, reliable. I told her that I thought of her often. She responded, but less and less warmly.\n\nI didn't understand. I was afraid she would move away. So I put more energy into it. No more words. Maybe too much.\n\n⸻\n\nWeek 3 – The changeover\n\nCLEAR\nI started to feel oppressed. He told me that I was running away from intimacy. That I had “walls”. He got worried whenever I took a step back. I had the impression that he was monitoring my silences.\n\nOne evening, I read an article about toxic relationships. It ticked a lot of boxes. I panicked. I said to myself: What if he was an unconscious manipulator? One of those who love intensity but hate the freedom of others?\n\nI didn't want to go back to being that woman who gets lost.\n\nTHOMAS\nI felt it slipping through my fingers. I just wanted us to really talk. But she was elsewhere. I insisted. I told him I was scared. She said I was projecting too much, that I was invading her.\n\nI felt betrayed. Rejected for my sincerity. I wondered if she was emotionally available. If she wasn't the discreet manipulator, who gets attention then shuts down as soon as she gets it.\n\n⸻\n\nWeek 4 – The breakup\n\nCLEAR\nI canceled a dinner. He reacted very badly. He criticized me for “running away from love”, for not being ready. He said I hurt him on purpose. I heard: you are guilty of not loving me the way I want. And then I knew I had to leave. Because I couldn't breathe in this bond anymore.\n\nI told him I needed space. That it wasn't against him. But he didn't want to hear. So I ended it.\n\nWith a strange feeling: that of having fled a danger... or an ill-born love.\n\nTHOMAS\nShe told me I was too intense. That I was suffocating him. She left me by message. I sat there like an idiot, reviewing our conversations. I didn't understand. I reread everything with a cold gaze. And I saw what people call love bombing. I was afraid: What if I was that without knowing it?\n\nBut deep down, I know not. I know that I loved as best I could, clumsily but with heart. And that she also did her best\n\nWhat they didn't see\n\nClaire and Thomas were two sincere souls, but each carried an invisible bag on their back, filled with old wounds, doubts, old terrors. And it is these bags, heavy and silent, which dictated their story as much, if not more, than their true desire to love.\n\nClaire grew up with the idea that love could confine, suffocate, control. Perhaps because she experienced relationships where admiration quickly turned to possession. Perhaps also because we loved her for her visible qualities (her beauty, her intelligence) but rarely for her flaws, her hesitations, her silences. She learned to be wary of those who “want too much,” because, in her experience, wanting too much necessarily meant wanting to change her, or to possess her.\nSo, when Thomas showed himself to be demonstrative, expressive, full of shared desires, Claire did not see a man who clumsily tried to love her; she saw potential danger. His brain didn't hear \"I care about you\", it heard \"I'm going to grab you\".\nShe did not see that she herself, by moving away to protect herself, was amplifying Thomas' anxiety - which led him to insist even more.\n\nThomas has what psychologists call an anxious attachment. When he feels the connection becoming important, his insecurity rises. He said to himself: “If I don’t prove right away that I am worthy of being loved, she will leave.” He does not seek to control; he seeks to reassure, clumsily, through excess presence, through words that are too big, too quickly.\nWhen Claire began to take a step back — which was a healthy way for her to preserve herself — Thomas did not perceive it as a simple need for space. He experienced it as an imminent abandonment. And in his panic, he did exactly the wrong thing: he squeezed harder.\nHe didn't see that Claire didn't need more attention; she needed time, air, trust left at a distance.\n\nBoth, prisoners of their interpretation, missed the essential:\n\t• Claire did not see that Thomas was sincere in his awkwardness, that he did not want to invade her but only to be reassured.\n\t• Thomas failed to see that Claire was not cold or disinterested, but cautious, slow to trust, and that she needed to experience her freedom in order to love.\n\nThey read each other's signs not with their hearts, but with their scars.\nThey put modern words to their ancestral fears: narcissistic pervert, love bombing, toxic relationships, even though they were just two poorly tuned humans, each frightened in their own way.\n\nThey have not understood that love, sometimes, begins precisely where it is scary.\nWhere we should learn to say:\n\t• “When you move away, I’m afraid. But I want to respect your need for air.”\n\t• “When you invade me, I close myself. But I don’t want to reject you, just feel free.”\n\nBut neither of them knew how to put these words together in time.\n\nThen, in the silence of their unspoken fears, the budding love was extinguished.\nNot for lack of feeling. But by excess of misunderstandings\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "score": 0,
    "created_utc": 1745959381.0,
    "subreddit": "confession",
    "id": "1kayelt"
  },
  {
    "title": "I may have manipulated a guy into loving me and change his life as well",
    "text": "Apologies in advance as this might be a mess. TempThrowaway acc obv. I'm afraid my partner would find this but I really want to let this off of my chest.\nDuring 2023 while I was browsing on MRM (myreadingmanga) website where a porn ad came thru and that's where something weird happened. I saw a guy that looked really familiar on the intrusive webcam ad and i clicked on it to find out it's my high-school bully. Mind you he's not bully bully but jus annoying, childish, name calling, pulling my pants down kind of bully. At first i couldn't believe my eyes like it can't be him but his username and His IRL name is similar (like Chris XXXson). I watched for a while where he pleasure himself while interacting with the viewers. At first I jus wanted to mess with him a bit but then I was really drawn to him to the point that I created an account, interact with him and even spend money. He's not a big camboy or whatever it's called. Usually it's 2 digits to jus a couple viewers but i was obsessed with him and everytime i got off work. I would look him up, chat with him, send coins. Throughout this I confirmed it's really is him but I was already obsessed with him. After some months later, I learn about him alot and I really want to reach out to him but scared that I would come off as a creep so I tried to reconnect with my old friends to find out about him. After sometimes, i figured out thay he's unemployed, staying with his sister and whereabouts. I hang around his area to see him and i did. I've always thought of myself as a loner who would grow old as a single uncle but seeing him was like something reachable, within my grasp if I make my moves right. I've never had that kind of confidence in anywhere and it felt good. I remember i was shaking with excitement and I knew I gotta do it. And so i did. I try to bump into him at his usual go to convince store and act all surprise and guilt trip him into buying me beer for bullying me in high-school. He was sincerely apologising and all which i find it very cute. I got that beer bar date. There I planned it all out. Joking about old times, reminiscing about high school and all the fun things and then got him to go for a walk in a park with more beer cans in hand with me. I had it all. We couldn't stop talking about everything including his life and where he's been which I already know ofcourse. I comforted him and the next thing i know, he got all emotional and we were making out on the bench at night. I walk him back to his home where his sister is worried sick. The next day, i text him and hit him up. One thing i had to lie at that time was how i knew his number and his address which i got all from a friend. I jus swept it under by saying he was too drunk when he give it to me. From that day on, I hit him up IRL and on that cam website. He always chat about life and whatever topic he has on his mind when there are very few viewers but I was always there. On there as an online stranger, i tried to push him into my way. A lot of things happen during that until one day he really went out on a proper date with me. I was pursuing him in IRL but subtly. I learned more about him during our 2 months where i learn he has a passion for baking but never really got into so I encourage and put him as apprentice in a local bakery using my connections which he is very thankful for. After a while, he announced on the website that he's turning a new leaf and leaving the cam site and I even congratulated him and send him a final tip. He never mentioned about the website to me IRL tho. 8 months of dating in and I had him move in with me, where he would bake breads and pastries for me. We are head over heels for each other. We celebrated 1 year anniversary like 5 months ago and now we're planning to save up money to open up his own shop. My house smells of bake goods and he is trying his best for the shop. Sure i feel like such a manipulator sometimes but I love this man so much. His sister loves me too. It's a little family i got. I aim to marry him next year if all goes well. From jus wanted to mess with him to him making a mess out of me everyday. I want to let this whole thing out to him but i don't even want a single dent in my relationship with him. I cherish him and he knows it. God this was the single bravest thing i ever did and I'm loving it everyday. I sometimes feel like I litreally went with my gut like a villain, a mastermind. I still would love to hear what you guys have on your mind.",
    "score": 199,
    "created_utc": 1745834009.0,
    "subreddit": "confession",
    "id": "1k9rptg"
  },
  {
    "title": "My roommate meal preps and sometimes I take a few bites  out of each Tupperware and have a full meal and he has no idea",
    "text": "I’ve only done this a few times but it feels so naughty  ",
    "score": 0,
    "created_utc": 1745979830.0,
    "subreddit": "confession",
    "id": "1kb5q6w"
  },
  {
    "title": "I took money from my parents and don’t know if I should tell them and how to",
    "text": "I (17M) have taken a significant amount of money from my parents over the years my conscience is telling me it is terrible to do but every time I do it I get an Endorphin rush from taking it and purchasing things with it. I don’t know if I am aiming for attention as i have 4 siblings or just am an overall bad person. But, I recently took $4000+ and am unsure if or how to tell them. I have been caught before and the latest time I was caught my parents told me that I would be not allowed to go to the summer camp I work at and have already signed my contract of employment where I will be paid enough to give the money back. What do I do?",
    "score": 8,
    "created_utc": 1745898802.0,
    "subreddit": "confession",
    "id": "1kaewot"
  },
  {
    "title": "I regret this so much. I know I can't make things right.",
    "text": "I made a girl fall in love with me and I never spoke to her again. ",
    "score": 22,
    "created_utc": 1745867927.0,
    "subreddit": "confession",
    "id": "1ka40pb"
  },
  {
    "title": "stole money from my students$$$$$$$$$$$$$$$$$$$$$$$$",
    "text": "i always stay late in a school of RKs.  one night i noticed a small purse with 7o$. i was struggling if im gonna “keep” it or not. i thought these kids wont even notice. if they did then it wont really be a big deal financially. so i KEPT it and nobody cried abt it",
    "score": 0,
    "created_utc": 1745969015.0,
    "subreddit": "confession",
    "id": "1kb23uz"
  },
  {
    "title": "Mi esposo habla con una amiga que yo le borre hace años, casualmente se volvieron a encontrar y ahora hablan todos los dias.",
    "text": "",
    "score": 6,
    "created_utc": 1745886249.0,
    "subreddit": "confession",
    "id": "1kaay60"
  },
  {
    "title": "I once faked having a twin brother for three months just to ghost a girl I didn’t know how to break up with.",
    "text": "I (29M) honestly don’t know why I’m thinking about this today, but it’s been eating at me for years.\n\nWhen I was about 23, I dated this girl I met at a party. She was super into me way faster than I expected. After two weeks, she was already talking about moving in, naming our future kids, getting matching tattoos — full speed ahead.\n\nI didn’t have the guts to just tell her it was too much.\nInstead of ending it like a normal person, I made the worst decision of my life:\nI pretended to die.\n\nKinda.\n\nI created a fake Facebook profile pretending to be my “twin brother” (let’s call him “Jake”) and messaged her saying that I had tragically passed away in a “freak hiking accident.”\nI literally googled a photo of a random mountain and posted it like it was a memorial.\n\nShe was devastated. I felt kind of bad… but also a little relieved.\nI thought that would be the end of it.\n\nNope.\n\nShe reached out to “Jake” constantly. At first it was condolences. Then it was weird things like, “I think you’re the only one who understands my pain,” and “Can we meet to mourn him together?”\n\nIt got so bad that I had to fake “moving across the country for a fresh start” just to shut it down.\n\nI kept up the lie for THREE MONTHS before finally just deleting everything and disappearing.\nTo this day, she probably still thinks I’m dead.\n\nSometimes I wonder if karma is going to destroy me for it.\nHonestly, I deserve it.",
    "score": 6549,
    "created_utc": 1745749866.0,
    "subreddit": "confession",
    "id": "1k90wiw"
  },
  {
    "title": "I described my current self in some words that pop up on my mind.",
    "text": "I've been on earth for 8093 days — or 22 years, 1 month, and 26 days — or 265 months and 26 days.  \nWell, there are infinite ways to describe how long I've been living, but they all amount to the same thing in the end: a mere measure of how close I am to the end — to death.\n\nWhile writing this, I'm listening to music (\"Hello\"). It's been about 3 days since the last time I prayed.  \nToday, I watched porn and masturbated.  \nToday, I didn't work.  \nToday, I spent the whole day lying down.  \nToday is another terrible day, where the version of me I hate the most takes over.\n\nThis isn't clear to the people around me.  \nMaybe I look almost the same every day from the outside, but deep inside, I know the truth — and God knows it even better than I do: I'm doing worse than ever before.  \nThis addiction to watching that filth...  \nThis relationship that is Haram...  \nThis wasted time I spend watching random movies...\n\nI don't know what kind of \"me\" I am creating for the long term.  \nI don't see the big picture — in fact, I don't see any picture at all.  \nMaybe, in the long term, this suffering is making me into the best version I could ever be — or is it?\n\nDoes being the best version of myself necessarily mean I must always do the uncomfortable, unwanted things, moment after moment, simply to be alive?  \nMaybe that's what it should always be: to choose, at every moment, not the easy and comfy path, but the hard one.  \nWhy?  \nBecause life is short — *very* short — unexplainably short.  \nLike the blink of an eye, years pass.\n\nAnd looking back, the question arises:  \n**Was it the best way I could've spent those years?**\n\nI believe in God.  \nI believe in the afterlife.  \nAnd it's the most uncomfortable thing I can think about right now, because it's exactly what I'm running *against* — running *from* Allah, instead of running *to* Him.\n\nIsn't this our life?  \nA run toward the inevitable — toward certainty — toward death — toward Allah?  \nBut this life is, indeed, the biggest proof of whether we deserve the right kind of eternity or not:  \nEither an eternity of pleasure, of learning, of growing, of getting closer and closer to Allah — an eternity of gaining knowledge, infinite knowledge...\n\nWhen I now think about it, all of this life seems minuscule.  \nIt makes me question every single thing I do:  \nWhy not just leave everything behind — escape to a faraway land — and pray to Allah until death?\n\nAt the very first moment of eternity, all this life will be forgotten.  \nI have already forgotten most of the life I have lived.  \nOnly some moments remain in my mind — and those moments were captured not just by me, but by others, by things, by beings.\n\nBut Allah sent us the Prophet (peace be upon him) to teach us that this is *not* the way He intended for us to live.  \nAllah wants us to live together, to make the earth a better place, to wonder at what He has created, to marvel at the complexity, to try to understand it, even to try to mimic it — only to realize that we are, indeed, created.  \nTo see each other.  \nTo accept how different — and yet how similar — we are.  \nWe are, indeed, surviving.",
    "score": 6,
    "created_utc": 1745881868.0,
    "subreddit": "confession",
    "id": "1ka9fl7"
  },
  {
    "title": "If Hell is a place, I'm absolutely gonna get sent there",
    "text": "It all started with a holiday dinner, about 15 years ago.\n\nI took my oldest girls to the store to get the stuff we needed for dinner. While we're there, they start play fighting in the store. They were being really rough, and they knocked into a couple displays and had to pick up stuff. \n\nIt was getting crazy because it was so crowded already, and they were acting like they had no home training. Which they definitely did, but they were in test limits mode because teenagers. \n\nAt one point, I got really frustrated with them. I exaggerated my speach to make it seem that I was somewhat slow, and started soft yelling at them about how they were acting. \n\nThey started laughing uncontrollably, and the people around us were mortified!!\n\nBut they stopped messing around and we got out of the store shortly after that.\n\nBonus: They stopped messing around in the store when they went with me after that. I would just ask if they want a repeat of the holiday shopping event. \n\nI definitely would not do that again now, but it was the only way I could think of to get them to stop acting like fools back then, and it lasted for a while as a threat to make them act right. ",
    "score": 218,
    "created_utc": 1745804056.0,
    "subreddit": "confession",
    "id": "1k9k0di"
  },
  {
    "title": "I paid my niece 20 GBP for doing the dishes and stole it.",
    "text": "I have been at my sister's place for a week now visiting, and helping out with her daughter. Two days ago I paid my niece 20 GBP for washing dishes but stole it later that night while she was asleep. She has to be aware that crime rate is high. She was lucky I didn't mug her on her way to the bedroom. \n\nAnd because I'm her aunt, I helped her search for it the next morning.       ",
    "score": 0,
    "created_utc": 1745940167.0,
    "subreddit": "confession",
    "id": "1kaqlhn"
  },
  {
    "title": "i forgot my mom's birthday today because i was high",
    "text": "i was really stoned when my mom called me. i asked her \"hii why are you calling\" and she answered \"well you should know that\". geez, i completely forgot it was her birthday today. a week ago, she had asked me to come over today and i forgot. i feel really bad abt it because i moved to my dad which was also hurting her. damn it how does one fix this?",
    "score": 525,
    "created_utc": 1745780560.0,
    "subreddit": "confession",
    "id": "1k9bmyb"
  },
  {
    "title": "Purple is not my favorite color, but I’m in too deep now…",
    "text": "Years ago, someone handmade me a blanket that was purple - it took them hours upon hours to make it, and a lot of love went into it. They chose the color purple because they thought it was my favorite color - it isn’t. I didn’t want to hurt their feelings, and aside from the color, I love the blanket, so I’ve never said anything. And the problem is, to keep from hurting their feelings, I’ve had to continue telling others through the years that my favorite color is purple. Now I’ve amassed many purple gifts and trinkets from friends and family - clothes, flowers, picture frames, tote bags, etc. - and I don’t like purple, but I don’t know how to get out of this!!",
    "score": 178,
    "created_utc": 1745800906.0,
    "subreddit": "confession",
    "id": "1k9j0yd"
  },
  {
    "title": "Debating making myself puke because I apparently cant control my food cravings",
    "text": "What it says in the title. Ive debated it before but this time I made it halfway to the bathroom before I changed my mind and decided not to do it. I am overweight (170lbs at 5 foot 3 inches) and it shows. I have always had very strong cravings for particular foods since I hit puberty, and as you can imagine it made me gain weight. I always feel hungry and have issues with not wanting to waste food if I have some left on a plate, so I tend to over eat while justifying it in a number of ways. Ive debated making myself puke out of guilt for eating so much but I dont want to waste good food or the money I spent on it just because I cant control myself. \n\nI havent made myself puke yet but I think I would have just now if I wasnt at work. I dont want my coworkers to potentially hear me. Im scared Ill do it when im at home, and justify it and make it not a big deal when I know its technically a symptom of an eating disorder",
    "score": 0,
    "created_utc": 1745914232.0,
    "subreddit": "confession",
    "id": "1kaiqyn"
  }
]