[
  {
    "title": "We have persistent scammers preying on this community",
    "text": "Folks, a reminder that [Rule 3](/r/offmychest/about/rules) focuses this community's scope on providing emotional support only. We do not allow solicitation or material offers.\n\nThis means OPs cannot hint at or ask for money, and community members cannot offer money or food. There are local services that can verify and address a person's situation better than any of us can (and many services will not turn people away if they are asking for it). A kind community member offered a scammer a job and that is okay.\n\nThis community is read by millions of people, and scammers around the world know this. We have cultivated an empathic community so we know it can be hard to resist offering material help. It takes only one person to make it worth it because it costs nothing to post. That is why the rules are strictly enforced.\n\nThere are many signs of a scammer. They will present a financially desperate situation often with a highly emotional component. They are likely to mention payment services. They may have payment services in their Reddit profile and ask people to look at their profile. They will ask people to privately message them. All of these behaviors may be obfuscated with weird spacing and other ways to evade detection. If they evade detection it's up to the community to report it. Do not call out OPs, report only.\n\nThank you for your cooperation.",
    "score": 1229,
    "created_utc": 1649991613.0,
    "subreddit": "offmychest",
    "id": "u3ydaq"
  },
  {
    "title": "American government mega-thread",
    "text": "Hello everyone!\n\nSince the election, many people have felt a lot of things about their lives, their futures etc.   \nIt's entirely understandable.\n\nBut the threads are so many and routinely devolve into rule breaking, so we've decided to make a mega-thread for the topic\n\n**Even here, though, sub rules apply, meaning (among other things) that this thread is not a political debate thread.**\n\n---\n\nSub rules:\n\n**Rule 1: We are good to each other.**  \nWe respect each other. If you encounter someone breaking this rule, disengage and report them.\n\nWe do not insult, antagonize, interrogate, invalidate, or criticize the original poster (OP), even when not directly addressing OP.\n\n**Rule 2: No oppressive attitudes and language.**    \nWe do not tolerate oppressive attitudes and language. This includes but is not limited to content we determine to be sexist, racist, homophobic, transphobic, classist, ableist, or intolerant of non-dominant religions.\n\nSlut-shaming, victim-blaming, and body-policing are unsafe actions.\n\nSuicide guilting is not allowed. Follow best practices when encountering people at-risk.\n\nNo proselytizing.\n\nPromoting, supporting, and recruiting for groups that oppose our goals will also result in a ban.\n\n**Rule 3: We stay on-topic.**   \nThis is a support community.\n\nPosts must seek emotional support for matters directly related to OP and expressed in a way for people to provide it. Any matter OP cannot easily tell or get support from people they personally know is allowed.\n\nPosts should be entirely self-contained text and contain no links.\n\nAll comments must constructively support OP. Do not give advice on posts flaired No Advice Wanted (NAW).\n\nIf a megathread exists, all related posts should be placed there.\n\n**Rule 4: We reject harmful behaviors.**    \nNo personal information.\n\nNo harassment. We do not mention non-public people, fellow users, or other subreddits.\n\n**Rule 5: We cooperate to build this community.**    \nModerators err on the side of safety. For all concerns about the community moderators will discuss it privately in modmail.\n\nBeing uncooperative is a distraction for OP and will be remediated in modmail.",
    "score": 53,
    "created_utc": 1741168687.0,
    "subreddit": "offmychest",
    "id": "1j3zokp"
  },
  {
    "title": "I hate this younger generation",
    "text": "I(29m) swear to fucking god if i hear another child say “6-7”, “ChIcKeN jOcKeY”, “thats so ohio”, or whatever fuckin trendy tiktok skit; i might actually lock myself in a fucking mental institution. Social media has RUINED our children. Remember when we were kids, i had to wait until i was 16 to get a phone. Now as soon as these kids pop out the cooter their idiot parents throw a fucking screen in front of their faces and set them up for a sedentary lifestyle full of brain rot, addiction, depression, anxiety, and predation. Maybe if these new parents actually took some parenting classes they would learn how to raise their children rather than letting youtube/tiktok raise them. That’s what’s wrong with this world. Kids forgot how to be kids because our parents failed us. ",
    "score": 1356,
    "created_utc": 1746104367.0,
    "subreddit": "offmychest",
    "id": "1kc83tp"
  },
  {
    "title": "My partner confirmed my worst fears, so I left.",
    "text": "After months of denying it, my partner confessed that he no longer finds me sexually attractive after giving birth to his child.\n\nIt hurt knowing that after putting my body and health through hell for nine months, he no longer wants to touch me. He said \"there comes a point in pregnancy and after birth, where you no longer find it attractive\"\n\nThe worst thing is I already knew. I could tell by the way he looked at me, the way his kisses changed, the lessening of physical affection.\n\nHe says his libido had decreased after becoming a parent, but he didn't know why. Then after we were intimate on Valentines Day, he realised that it was because he no longer finds me sexually attractive.\n\nMy friends are outraged for me, but I'm not angry because you can't help how you feel. \n\nI'm just angry that he lied to me for months, denied it to save having the awkward conversation. He made me feel like I was going crazy for thinking it. He made me doubt myself and what I was seeing/feeling. \n\nHe broke my heart, so I left. I did the hardest thing I've ever had to do and told him we're over.",
    "score": 881,
    "created_utc": 1746111937.0,
    "subreddit": "offmychest",
    "id": "1kcazf8"
  },
  {
    "title": "Is it weird that I get anxious making small talk even with people I've known all my life?",
    "text": "This might sound dumb af to you guys, but I’ve been noticing it more and more lately. I get super anxious making small talk even with people I’ve known for literally all my life. Like chatting with a coworker at lunch or running into an old friend while grabbing coffee. It’s not that I don’t want to talk, I just feel this wave of nervous energy kick in and my brain starts scrambling for something “normal” to say.  \n  \nWhat’s extra frustrating is that I can handle deep conversations just fine. If we’re talking about something real like I’m totally comfortable. But if someone goes, “How was your weekend?” I immediately freeze, or give the most painfully boring answer possible, then spiral afterward wondering if I sounded weird.  \nLike, this past weekend I did a few errands, caught up on laundry that I've been literally pushing away for the last 2 weeks and cleared out some old stuff I ended up selling online, but I still hesitated when someone asked me what I’d been up to. It’s like I assume no one actually wants to hear the real answer, so I end up second-guessing myself and giving some short, awkward reply instead.  \n  \nDoes anyone else deal with this? Is it a social anxiety thing? Am I just overthinking something most people don’t even notice?",
    "score": 145,
    "created_utc": 1746115886.0,
    "subreddit": "offmychest",
    "id": "1kccl91"
  },
  {
    "title": "A random thing totally turned my day around",
    "text": "I was having one of those meh Thursdays like nothing seriously wrong, just that kind of flat, boring ass vibe. I went to the store which is right next to my flat and while I was choosing some stuff for the lunch that I was about to cook, a girl came to the aisle where I was and picked something up right next to where I was standing. We randomly started talking and I ended up in a conversation with someone I didn’t know (wasn’t even planning to talk to anyone really), and we somehow got on the topic of weird comfort foods from when we were kids.  \n  \nWhat started off casual turned into a surprisingly fun exchange like so nostalgic, kind of random, but oddly grounding. We went down this rabbit hole of old-school snacks and bizarre lunchbox combos, and it made me laugh way more than I expected. I didn’t think much of it at the time, but afterward, I noticed I just felt full of life.  \n  \nIt made me realize how often those tiny, unscheduled interactions sneak in and completely change the tone of your day. Just wanted to share this very nice (extremely rare for me) interaction that I had today.  \n",
    "score": 139,
    "created_utc": 1746116866.0,
    "subreddit": "offmychest",
    "id": "1kcczhu"
  },
  {
    "title": "After being lesbian for a decade, I realized I'm bisexual because of a vending machine.",
    "text": "My girlfriend and I broke up before I started college and there at college there was this man who was literally everything I was.\nIt started when I noticed how funny he was, his humor was the same as mine. There was no attraction yet.\nThen, one day I noticed just how alike we were.\nDown to the speaking mannerisms.\nHe was tall.\nHe was patient and protective of me.\nOne day, I got a soda from the vending machine and he just so happened to notice it got stuck so he lifted this huge ass machine off the ground, shaking it, took it out for me and handed it to me with a wink.\nThere, at that moment, I accepted that there was no way I wasn't attracted to men, because he existed and as long as he existed I was some type of bisexual.\nI was taken aback by his strength and it was then I noticed he had my eyes but they were softer, kinder.\nSo, there I sat, red in the face and having it slowly sink in.\nI'm probably not gonna come out to anyone except here because I know it will never happen but I know it is possible now.\nThat is all.",
    "score": 1157,
    "created_utc": 1746072884.0,
    "subreddit": "offmychest",
    "id": "1kc01le"
  },
  {
    "title": "My husband is getting fired right at this very second",
    "text": "My husband is about to get fired. We have no other source of income. We have a special needs child. My husband's in the meeting right at this very second. Getting fired. I'm at home. Crying and hopeless. My god, what are we going to do? Will we end up homeless? ",
    "score": 80,
    "created_utc": 1746124781.0,
    "subreddit": "offmychest",
    "id": "1kcg6y9"
  },
  {
    "title": "I am shocked at how many zoomers can't use computers",
    "text": "I guess it comes from growing up in the 90s but I have always seen and heard computer literacy being linked with youth. All the time growing up I'd hear about how us kids just naturally took to computers and they were right. I remember teaching my mom how to set up her first email account when I was like 9 years old. Then years later showing her how to out music on her ipod etc. Everyone my age was proficient with computers right away and being bad at technology was seen as an old people thing.\n\nWell now I'm in my 30s and it's like it's reversed. The younger employees where I work all have to be taught how to do very very basic computer tasks like logging in to windows, using Microsoft Word, using a browser to go to websites etc. And don't get me started on the chicken pecking typing, or using caps lock instead of shift.\n\nThey only know how to use phones and the app store. If there isn't an app for some web service they just straight up don't know how to get there.\n\nTeaching them to use the computer at work feels exactly like teaching the boomers how to use the computer. What is going on??\n\nAnd don't tell me they just know how to use different technology that I don't know how to use. Yes I do. I know how phones work and don't need any help doing anything on them.\n\nI see on reddit all the time people not knowing they can go to reddit on their browser instead of the app.\n\nI listen to 4chan greentext stories on YouTube while I do my paperwork and I've seen comments from people asking how to get the \"4chan app\"\n\nDoes nobody have a laptop or whatever any more? I know that PC gaming is more popular now than ever so young people are definitely getting computers. High end computers at that. Is their whole computer experience strictly limited to Steam and the games they buy there? Do they know about the browser? If they had to, say, download and then open a PDF would they be able to do it?\n\nAre zoomers the new boomers? Don't they teach computer basics in school anymore? ",
    "score": 149,
    "created_utc": 1746108726.0,
    "subreddit": "offmychest",
    "id": "1kc9q0x"
  },
  {
    "title": "My mom came to my brother’s graduation but is skipping mine (which is today) — and I’m hurt.",
    "text": "I (F) live in the U.S. and I’m about to graduate today from college. Ive been working hard for 4 years and this is very important to me. I told my mom (who lives out of the country) my graduation date a year ago so she could plan ahead. A few months ago, we found out my brother (who also lives in the States) is graduating a week before me. She said she’d go to his graduation, then travel down to mine, and fly back home the day after.\n\nFast forward to a month ago — she asked me to pay for plane tickets for her, my sister, and my stepdad, saying her card wasn’t working. (That’s always the excuse) I told her I couldn’t help because I was already tight on money with graduation expenses and bills. She said she’d pay me back within the week, but she has a pattern of borrowing money and never paying it back, so I was hesitant anyway. I also heard she asked someone else for money for plane tickets. Not surprising\n\nNow she’s saying she can’t come to my graduation because our elderly dog (who lives with her) is sick and she needs to go back for him. For context, the dog had already been sick before my brother’s graduation, and she still traveled to see him. Someone is caring for the dog back home, so he would’ve been fine for the extra few days it would’ve taken to attend mine too.\n\nI get it — the dog is family. But if she could leave him to go to my brother’s, why not mine? She was already in the states. I gave her a year’s notice, and it just feels like she didn’t make any real effort. It hurts to feel like I’m not a priority",
    "score": 100,
    "created_utc": 1746104709.0,
    "subreddit": "offmychest",
    "id": "1kc88jy"
  },
  {
    "title": "My “bridesmaids-to-be” planned a girls trip without me. Now I don’t know if I even want them at my wedding.",
    "text": "TLDR: My close friend group (potential bridesmaids) went on a trip without me. Sensing I’d be upset, the planner of the trip called after to “check in” to explain why. Now I’m questioning the friendship and their place in my wedding.\n\nI’m struggling with how to move forward after this. I have a group of five close friends who I’ve always considered my core people—so close that they’d likely be my bridesmaids for my 2026 wedding (I haven’t officially asked, but it’s been understood).\n\nRecently, one of them—let’s call her Anna—planned a weekend trip because her parents let her invite friends to the place they were renting. She invited everyone from our group except me. One girl even flew in from out of state. I’ve been talking for months about wanting to do a weekend trip with all of them, and I had no idea this was happening. I only found out when they started posting on our shared private story that I’m still in. I was literally the only one not there.\n\nWhen I distanced myself afterward (short and delayed responses after I understood where I stand in this friendship), Anna called to “check in”—something she’s never done before. When I brought up the trip, she claimed it wasn’t intentional exclusion, just that it came together that way, and gave excuses about me being “always busy” and the trip being overwhelming with them number of people coming.\n\nI told her honestly that it felt like they just didn’t want me there—that’s how it comes across when everyone in your friend group goes and doesn’t even tell you. She kept trying to defend it and said they’d “never intentionally hurt” me. When I asked her to imagine being in my shoes, her response was literally, “I hope you can also understand my position.” I ended the call politely and thanked her for reaching out, but it just felt like excuses.\n\nLater, she followed up with a text that said something like, “Thanks for chatting, I value your friendship and I’m glad we could talk through it.” I didn’t respond directly—just gave it a thumbs up. To me, it felt more like damage control than accountability. Especially since she knows exclusion is a sensitive subject for me from a past incident. It feels like she reached out just enough to say she tried, in case anyone asked—but I’m still sitting with the fact that none of them thought to speak up for me.\n\nWhat really stings is not just Anna organizing it—it’s that none of the others pushed for me to be there either. These are supposed to be my bridesmaids.\n\nI’m trying to figure out how to move forward. Do I talk to the rest of them? Let it go? Reevaluate this entire friendship? Right now, I’m leaning towards cutting off. I’m not sure how I’d respond if they reached out asking to see me again. I’d love any advice or perspective.",
    "score": 794,
    "created_utc": 1746061417.0,
    "subreddit": "offmychest",
    "id": "1kbwiqh"
  },
  {
    "title": "Porn is fucking up how we see relationships",
    "text": "Porn has fucking wrecked the way people see relationships. Straight up. It’s shoved sex into every goddamn corner of human connection where it never fucking belonged. Now everything’s sexualized — every bond, every glance, every moment that used to be innocent is fair game for someone’s sick fantasy. And it fucking destroys me to see how normalized this shit has become. You go on Reddit or Twitter or whatever, and people are just casually dropping confessions about having sexual thoughts about their own family, their coworkers, students, teachers, neighbors, and their partner’s fucking parents — like it’s nothing. Like it’s funny or hot or some dark little quirk to share. What the actual fuck? Is nothing off-limits anymore? Is any relationship still sacred?\n\nAnd what’s even more fucked up is how so many people act like it’s no big deal — like as long as they don’t “act on it,” it’s somehow okay. Fuck that. That’s such a weak-ass excuse. Just having that shit in your head already means something’s broken. It's not just harmless fantasy — it’s a sign of rot. It shows how deep porn culture has infected people’s minds. They’ve been so desensitized that they genuinely believe they can sexualize anyone around them and it’s totally fine, as long as they keep it to themselves. That’s delusional. That’s dangerous. That’s fucking disgusting.\n\nAnd let’s be real — this isn’t just about what someone jerks off to. It’s about how they see people. They stop seeing human beings and start seeing body parts. Roles. Fucking categories. Their whole view of relationships gets warped until every person they know becomes just another character in their porn-soaked imagination. That’s not normal. That’s not “kinky” or “dark” or “just fantasy.” That’s some mentally twisted shit. And it’s everywhere. It’s eating away at people's ability to love, to connect, to respect others like actual fucking humans. People are so deep in this shit they don’t even notice how far gone they are.\n\nAnd no one’s calling it out. No one fucking talks about it because everyone’s either too scared to offend someone or they’re just as far gone. So the sickness keeps spreading. It becomes the default. It gets passed down. Kids grow up in this hypersexualized, boundaryless hellhole and think it’s normal to be turned on by a fucking stepmom or a cousin or a classmate. That’s not edgy, that’s not taboo — that’s fucked up. It’s cultural rot on a soul-deep level.\n\nAnd honestly, it makes me wonder how many people have had to deal with that gut-wrenching feeling — when someone close, someone who should’ve been safe, looks at them in that wrong fucking way. Not a stranger. Not some random creep. But someone they knew. Someone who should never have had those kinds of thoughts. That shit fucks with your head. It stays with people. And it’s exactly the kind of quiet, hidden damage this porn-soaked culture creates — damage no one wants to admit is real because it’s uncomfortable or inconvenient or makes them look in the mirror.",
    "score": 28,
    "created_utc": 1746125405.0,
    "subreddit": "offmychest",
    "id": "1kcgfsp"
  },
  {
    "title": "I'm a victim of COSCA.",
    "text": "I'm 15, turning 16 this year and was dating a boy who now is 14, but was 13 when he raped me. I know it was rape because I kept saying no, no, stop, but he wouldn't. He held me there and covered my mouth while he raped me. I'm scared to tel the police because what if I get sent away? I am the older one after all, or what if no one believes me?",
    "score": 119,
    "created_utc": 1746095232.0,
    "subreddit": "offmychest",
    "id": "1kc5f21"
  },
  {
    "title": "I learned how to draw as a kid because I wanted to see boobs",
    "text": "Ok, don’t judge me right away. I grew up in a  Christian conservative home where I didn’t have access to any kind of explicit material. \n\nSo I drew it myself. \n\nI got kindof good at it. I used anatomy reference books and studied sculptures to learn the human figure. All because I was horny. \n\nNow that I’m perusing a carrier in art, people ask me how I started drawing and of course I lie. But that is the honest truth lol",
    "score": 747,
    "created_utc": 1746057350.0,
    "subreddit": "offmychest",
    "id": "1kbv5tn"
  },
  {
    "title": "My boyfriend shamed me",
    "text": "I had a fight with my boyfriend last night and at the end he shamed me for my bodycount. We were talking about raising kids and how it’s hypocritical if you teach your kids not to hit or be abusive against other people and then you get into fights that could be avoided at a bar etc. He then said that why do you have to tell your kids everything and that it would be the same as me telling my kids that i had for example a bodycount of 6… I was really taken a back by this… How is he comparing fighting and being abusive to having sex when you’re single. Then he started to talk about how it bothers him that i have slept with other men before our relationship and continued to compare the fighting and the bodycount… I am just at a loss for words. Idk what to do and i’m thinking if i’m over reacting by being so sad about this… There were other thing he said about the bodycount that were super hurtful but i can’t remember them, i think my brain is blocking me from remembering",
    "score": 66,
    "created_utc": 1746103002.0,
    "subreddit": "offmychest",
    "id": "1kc7nt4"
  },
  {
    "title": "I just love my wife so fucking much.",
    "text": "I know a lot of people, especially now, struggle with finding someone to go through life with. To have a partner, to depend on and be depended on. To thos people still out there: I feel for you, and I hope you can find what you're looking for.\n \nI'm just happy that I'm with the person I'm with. I'm just grateful for her, and that I feel appreciated back. It's just such an amazing feeling that I fear is so fleeting to most. I've been married for 3 years this October, but we've been together 13 years this last month. And I'll keep renewing this every time, I'm not tired of any of this yet. We've gone through troubles, sure. But she's had my back and I've had hers. She's the only person I'd do literally anything for.\n \nI don't have a point to this post. It'll get buried, probably. But I think we have something special. Something other people could take something from. A piece of wisdom or advice. But no one ever asks, though after looking around I really think they should. Though anything I'd say is easily dismissed as anecdotal, I think I'd have something to contribute.",
    "score": 72,
    "created_utc": 1746097743.0,
    "subreddit": "offmychest",
    "id": "1kc62dd"
  },
  {
    "title": "Update to: My girlfriend (16F) sleep(16M) with my best friend (16M) while we were apart ¿What I do?",
    "text": "I wanted to thank you all for the messages of support I've received. I know we were in a time of separation, but for me, time is about getting better, not meeting new people, or in this case, sleeping with whoever you want. I also appreciate the advice.\n\n\nI cut off all communication with José and my ex, blocked their numbers, and also unfollowed them on all possible social media.\n\n\nOn Tuesday, an unknown number started calling me. I'm not one of those people who answer unless they have a registered number, so I let it ring. Suddenly, I get a message saying \"boy, answer.\" I don't know if it was her uncle or her dad, since they both called me \"boy.\" I left it on read and stopped bothering her. I thought it was all over.\n\n\nOn Wednesday, I was in bed and suddenly I heard a knock on the door, and when I opened it, it was my ex saying he wanted to talk to me. I told her I didn't need to talk to her. She started crying, and I told her to come in. I just let her in to get a little more information.\n\n\nShe started off by saying she slept with José because she was scared. I told her to stop lying. She didn't sleep with me out of fear. She told me she did it out of spite to see if she could forget me, but during the time they were doing it, she was thinking about me. She tried to manipulate me by saying that I had a bigger one, that I knew how to move, etc., but I told her that I didn't care who was better in that regard. I asked her who knew that she slept with José, and to my surprise, all our mutual friends knew.\n\n\nI asked her what day she slept with José. She was a little hesitant, but she said it was the first week, Thursday to be exact. I didn't want to continue with this anymore, but she told me she regretted it while they were doing it, that she loved me, and that it would get better for both of us. At that moment, I interrupted her, saying that if she wanted to improve, she should improve for herself, not for me because I didn't see a future with her. At that moment, she started crying. I told her that when she finished calming down, she could leave. She calmed down a short time later. She tried to kiss me, but I pulled away.\n\n\nI told her I didn't want to hear about her or José like that anymore. Now I'm trying to distract myself by doing several things. I'm thinking about signing up for swimming. I decided to focus on my studies. Also, as an extra hobby, I decide to go for walks in the early morning. I feel like things are going to get better.\n\n\nTldr: My ex came to my house and tried to get us back together but I rejected her.",
    "score": 18,
    "created_utc": 1746121993.0,
    "subreddit": "offmychest",
    "id": "1kcf2cw"
  },
  {
    "title": "I'm so sad",
    "text": "Every single night this week I've had debilitating panic attacks that have stopped me from sleeping. Idek what's wrong with me. I've been sleeping in, working from home and just fiddling with my mouse to look like I'm doing something. It's getting beyond a joke. I don't know how I can continue. \n\nIt's midnight now and I'm too anxious to sleep. My fiancée is sleeping in the other room and I cannot rest. I'm trying to not bother her with this, I know it upsets her. \n\nI've got a bottle of whiskey sitting in front of me, hopefully that'll help me get some rest tonight. ",
    "score": 35,
    "created_utc": 1746107698.0,
    "subreddit": "offmychest",
    "id": "1kc9bhw"
  },
  {
    "title": "I broke up with my boyfriend because he called my best friend a predator",
    "text": "TL;DR: boyfriend doesn't want to meet my best friend and calls him a predator. Verbal abuse and aggressive behavior towards me. I break up and want to leave, he asks to be roommates because he can't afford rent on his own.  \n  \nI (F24, Italy) and my boyfriend (M25, US) live in Switzerland. He moved to my place last November, because we were having a good relationship and it's a way to save money with the crazy renting cost in this city.\n\nI have a dear best friend from my hometown, we basically grew up together since we are the same age, were neighbors and our parents had a good relation. We went through primary, middle and high school in the same classroom and always hung out together during university. After I moved abroad, we still kept in touch by texting and we saw each other every time I went back to visit my family.\n\n*^(This has nothing to do with the current issue, but I still think it needs to be said: we NEVER had any kind of romantic or sexual feelings for each other; every partner we had always understood this.)*\n\nSo, last month my friend told me he was taking a trip to France with his girlfriend. Since I live in the French-speaking part of Switzerland, we decided that they should definitely stop here for a couple of days on their way back to Italy. I was really happy to see him and his girlfriend again, and my boyfriend was also glad to finally meet this guy.\n\nTwo days ago they left for France, and my boyfriend asked some basic questions to already know them better before meeting. He got curious on how long they've been together, and I said 5 years.  \n\"Oh, so they met in college?\" I said no, she was in high school. He got very cold and asked how old was she. I said 17, why?  \nHe started to freak out. Asking if he ever did anything weird or creepy to me. I got quite upset at that, because this friend is one of the persons I trust the most in the world. Then my boyfriend started raising his voice, yelling that my friend is a predator, a pedophile. I'm like, what? I tried to explain that not only is the age of consent in Italy 14, but it's totally normal to see high school students having a relationship with 18, 19, even pushing to 20 year olds. Of course the majority of relationships happens between students around the same age, but still, it's normal. But he wouldn't have any of it, mumbling stuff like \"these fucking r-word societies\". At that point I got really annoyed and said that we treat teenagers as people capable to have basic responsibilities, make their own choices in order to learn and enjoy life, not as stupid children who need constant protection and repression. When I was 16 I also had a FWB thing with an 18 years old for a few months.\n\nAnyway, he said that he's not going to meet my friend because he feels disgusted. I said that he's a very important person in my life, so I don't want to stay in a relationship in which there's going to be so much tension with my best friend and hostility towards him. He said \"Whatever, I don't fucking care\" and left.  \nI needed a backup plan, so I immediately contacted a friend living in here, because she's going abroad until the end of the year and is looking to sublet; she said that if I confirm, I can already move my stuff in there this weekend and sleep on the couch until she leaves on the 12th.\n\nWhen my (ex) boyfriend came back he kept insulting both my friend and me again and started knocking stuff from the table and the furniture (nothing broke, even though my headphones were some of the things that fell on the floor). At that point I told him that we're done and that I already found another place. I'm obviously paying half the rent for May, since my name is still on the contract. He said I cannot do this to him, that there's no away he can afford paying the rent on his own and that finding a new apartment takes a long time and is a very difficult process (true). So I told him I can stay here (I can afford it), but he needs to move out ASAP, he can find a cheap sublet or a friend's couch for the time it takes him to find another place. He said no, that it would be \"degrading\", so I said that I'm going away, not my problem.\n\nNow he says that I'm overreacting (he's the one that kept yelling and that showed an aggressive behavior), that we can be roommates until he finds a place, promising that he's going to keep his distance and limiting the interactions to a minimum. I'm slightly inclined to trust him, after all it's the first time he acted this aggressively with me. But part of me is saying \"don't risk it\"; plus, I wouldn't be able to hang out with my friend and his girlfriend in a calm place.",
    "score": 28,
    "created_utc": 1746109417.0,
    "subreddit": "offmychest",
    "id": "1kc9zk9"
  },
  {
    "title": "I got cold feet at a brothel the last second and I do not regret it",
    "text": "I think that a lot of young men like me (20M) browse through these Subreddits. Young men who haven't had sex yet and wish to do so. If that applies to you and you're considering to take a shortcut, please listen to my story. \n\nJust a few hours ago, I was a stuttering mess. I politely declined her advances, let her keep the money, and left peacefully. I did not do the deed, I did not. And looking back at it: it was the right decision. But please let me elaborate. \n\nBefore I booked that appointment and went to the location, I had this feeling that it was \"high-time\" I did this. I wanted to \"be a man\" and imagined myself much happier after the entire endeavor, finally reaching that status that I could flaunt. I figured that other people did it and turned out fine, so why couldn't I do it? Well, those are the thoughts that led to me booking it all. \n\nI even jokingly went to the chapel and prayed, asking that nobody shall catch me and that I can simply get away with it. Currently, a lot of people I know are not in town right now. I deliberately waited until this moment, knowing it'll make things easier. I prepared a route and a time, I really did my homework. \n\nAnd then there I was, thirsty in the room. It was then and there that I looked in the mirror and saw myself: a young man who was about to commit a mistake. In that moment, a phrase came to mind: \"The process is just as important as the result.\" \n\nFrom there, it dawned on me. I didn't want this. I didn't need this. It doesn't define me as a \"a man\". I do not need to do this. I shouldn't. I don't want to face the people I love knowing that I paid for such a thing. How did I ever think I needed to be here to prove anything? It's bullshit. It's not who I am and what I do. It's fine. \n\nSo I ended up drinking some water and asking to leave, as I stuttered a lot. And I ended up doing just that. \n\nAnd you know what? I do not regret it, one bit. I just knew that if I had pulled through, I would have deeply resented myself.\n\nInstead, I went to a restaurant and bought a burger. It was a really tasty burger. It had a familiar taste that brought me back down to earth. And now, I just feel . . . .  a bit bad. I feel bad for ever considering it at all. I don't have to. This is not my way. And adding onto this: I can't tell you when I will get intimate. And that is fine. All I can ask you to read through this story, if you are in a similar place, and listen to me: you are not any less of a man because you haven't had sex yet. You are more than that. Never let anyone or anything pressure you, not even yourself. \n\nRight now, I am just glad to be at home. I am writing this, despite feeling uneasy about the whole thing. I just hope that the Father saw me avert the deed before it was sealed. I just hope that I can take this experience and turn it into a catalyst for self-growth and development. And I hope that whoever is reading this can learn from my mistakes and avert the process entirely. ",
    "score": 26,
    "created_utc": 1746108665.0,
    "subreddit": "offmychest",
    "id": "1kc9p64"
  },
  {
    "title": "At thirty I'm coming to terms with never seeing my father again",
    "text": "In a few weeks I'll be thirty. During this time each year I fear the sadness anticipated on my birthday. Each year I have one secret wish—I wish my father would call.\n\nMy memories of him has started to fade. He used to be an Englishman in a foreign city. Clean-shaven with Doc Martens. Listening to reggae and Ian Dury. Smoking cigarettes and talking about art. Painting, reading and discussing politics and West Ham. Nowadays I'm not even sure I'd recognize him. It's only in the mirror where I can make out his face.\n\nThe last I heard was that he left the city fifteen years ago. Three years earlier he promised me that he'd meet me at a certain spot at a certain time the day after. I sat there alone for three hours. I was twelve and my mother had just met another man, the man who I now introduce as my father. For three more years he lived here, and then the he left and is nowhere to be found. No online presence, no relatives I can speak with, nothing.\n\nMy whole life I've been chasing my idea of his acceptance. I studied art, books became my primary hobby, my record collection is from what I can remember of him. Everything I've done, all my achievements and my goals, everything has been in an attempt to please him. But he's never been aware of it.\n\nFor my twentieth birthday I made a promise to myself—if I hadn't heard anything in ten years I would leave the memories behind. I'm getting married in a year. We're discussing children. He won't be a part of their lives. I'm just now accepting this.",
    "score": 13,
    "created_utc": 1746123753.0,
    "subreddit": "offmychest",
    "id": "1kcfrz8"
  },
  {
    "title": "I found my dads old note; I think hes a psychopath. Help?",
    "text": "I’m a 23M living with my mom (48F) and dad (59M). Today I found something on his laptop that made me physically sick. It was a notepad file but when I opened it, it read like a journal or a manifesto. It’s too explicit to post here in full, but to keep it short: he’s been cheating on my mom since I was in high school. Not just once but weekly. New women, over and over.\nALOT of which I recognize.. \n\nMy mom has a Reddit account, so I’m posting this from a throwaway. I just don’t know what to do. The file talked about how he’s been with dozens of women since his early 20s, but he always told me my mom was his first. That part was already bad enough; but then I read more. Stuff about how he enjoyed hurting girls emotionally. Said he’d do it just to watch their reactions. He was proud of it.\nNow I feel like my whole life has been a lie. I don’t know if I should tell my mom or just pretend I never saw it. There’s more in that journal, a lot more. It honestly scared me. I cant post the full excerpt note here as theres some personal information and is too explicit for this sub. But if anyones curious I can post it on a google doc once its scrubbed of identifying details like names, locations, etc.\n\nHelp.\n\n-ConcernedSon\n\n\n\n\nUPDATE POST !!!\n\nFor those of you wondering, I took the advice this morning and told my mom all about it. She's a mess right now but I'm helping her packup some stuff because she doesnt believe she's safe living with my dad anymore. \n\nAnd for clarification, I don't believe it was fictional/fantasy because the details are too specific and the time gaps actually line up to our real lifeso I don't think its just smut he wrote.\n\nAnd I've got some messages about the note, and I'll try making a google doc of it later on today if I'm not too busy.\nAnd I'll probably have to scrub off a lot so I doubt I can post it in full, as I'm not sure about this subreddits policies but there is a lot of homophobia, racism, and misogynistic remarks..\n\nThank you guys for your advice, I'll give an update once this all clears out. And yes, my mom's making an appointment to get checked for any STI's.\n\n-ConcernedSon",
    "score": 920,
    "created_utc": 1746038497.0,
    "subreddit": "offmychest",
    "id": "1kbnzs5"
  },
  {
    "title": "My wife threatened to kill me while she was drunk",
    "text": "We were together at an event, where vendors and customers find each other to hopefully create new business.\n\nAfter a long day and after dinner, a group decided to go to a party. Most people of the group were not sober anymore.\n\nIt was a mix of people from the event and other clients who were staying in that hotel.\n\nAt a certain moment, I (male) was going to get a drink and a lady from one of the suppliers started talking to me and offered me a drink.  \nMy wife came to me to interfere. Later another lady was talking to me (also from the event) and this was also not to the liking of my wife.\n\nBack at the hotel room where the ambiance was already dark, she started about why I was talking to ladies, and why I didn't talk to her and I said that they were the vendors from the event. I even said to the ladies from the vendors that my wife was standing there so if they wanted to hit on me, they knew that I have a wife already. I also explained this to my wife but it was not enough.  \nThis all escalated and she was hitting me, scratching me, and saying that she was going to kill me.\n\nI was getting my stuff and wanted to walk away. She stopped me and we were pushing and pulling, She started to cry and apologize.\n\nIt was in the middle of the night so we cooled down and slept in the end. The next day she apologized again. The fact that she hits me and threatened to kill me wories me. Also because I know that she has connections from the past. People from other countries that kill without losing a night of sleep.\n\nI moved from the Netherlands to Spain for her, but this is really scary, and make me wonder if I should not move back.",
    "score": 41,
    "created_utc": 1746098490.0,
    "subreddit": "offmychest",
    "id": "1kc69wn"
  },
  {
    "title": "my girlfriend was brought into this world filthy rich and it frustrates me",
    "text": "i love her so much and it’s so frustrating that she’s not aware of her extremely privileged upbringing sometimes. sometimes, she’ll get bored and go shopping and spend thousands of dollars in a day. whereas, i’m struggling to pay a bloody phone bill every month and have contemplated how i’m going to afford catching the bus with only $5 left in my pocket.\n\ntoday, i voiced out a frustration. i can’t get a root canal treatment done and see my psychologist at the same time because i simply can’t afford it. it’s one or the other. and she offered to pay, said take it one step at a time and it’ll all work out in the end.\n\nwhich sounds so nice now - but at the time, i was frustrated and told her she has the ability to say things like that because she has never had to worry about having food on the table and that she has never lived through the daily burden of simply just existing. \n\nshe brings me to fancy restaurants all the time and pays for all of our holidays when i’ve made it really clear that one trip a year, with the budget of a backpacker, is all i can afford. we’ve fought over me refusing expensive things from her on random times. she bought me a macbook one time when my old one was working perfectly fine.\n\ni know what i sound like. it’s ungrateful. i just can’t explain how i’m feeling. it’s like…i’m studying and working everyday so i can have the means to live a somewhat decent life…while she was born with it? it’s not her fault, i know. it’s just sometimes, i don’t think she even remembers that i grew up dirt poor in a third world country. \n\ni’m not built for luxury. the financial inequality must be so frustrating for her even. i’m sure she would love to be with someone who can afford everything she deserves. \n\nedit: i will be talking to her about all of my feelings and everything i have said in this post. \n\nhowever, some of you are unbelievably just horrible and clearly grew up privileged too. i can’t believe i have to explain that there is a difference between being poor in a developed country and being poor in a third world country. \n\nmy dad was hardworking enough to put himself through a trade school which gave us the opportunity to uproot ourselves away from poverty.  to be able to leave, we leased our souls to very rich people in my country. we are still paying it back to this day.\n\nmy ma cleans the toilets you people shit in and my dad fixes your cars. i’ve seen them get belittled. i’ve seen my siblings with wounds all over their feet because we couldn’t afford shoes. \n\nso forgive me if i’m being ungrateful when my girlfriend flaunts me her generational wealth without asking for anything in return. from my point of view, i see my mother scrubbing clothes tucked in a wet and dark room all day for $4. i see my dad coming home with rice, salt and soy sauce with cuts and dirt all over his hands. and it makes me think, what have i done to deserve this? what have i worked for? \n\ni’m glad none of you had to go through that, but please do not invalidate how i feel when you’ve never been in my shoes. thank you.\n\nedit 2: she has seen all of this post and all of your comments. i’m looking into her being able to come into one of my therapy sessions so we can work through this together. it’s tmi, but the sessions are mainly for the things i had to go through when i was a child. so this’ll be a completely different level for me, with her being in the room. \n\nfor all of you saying that she should leave me, she says she’ll politely decline your “strange internet request”. we have been in each other’s lives for awhile and she plans on staying with me for the rest of it. thanks everyone. :)",
    "score": 1814,
    "created_utc": 1746022833.0,
    "subreddit": "offmychest",
    "id": "1kbhpn8"
  },
  {
    "title": "This is messed up, I want to abandon my daughter",
    "text": "F21, mother of a 7 month old.\n\nNow the story is crazy and bizarre.\n\nBaby daddy is 30M, we’ve been together since I was 18. A few years into the relationship I found out he has a pregnancy fetish, i deliberately missed my shot and fell pregnant. I kept the baby because his fetish really messed with my brain. Now baby is here, I’ve realised harsh reality that I wasn’t ready for this, and I was really messed in the head.\n\nI want to walk out. No life will never be the same, I can’t just forget that I have a daughter. But I also feel so young and that my youth is ruined just because I dated/date  an older man. ",
    "score": 1901,
    "created_utc": 1746018789.0,
    "subreddit": "offmychest",
    "id": "1kbg5t4"
  },
  {
    "title": "I’m starting to hate the idea of romantic love",
    "text": "Lately, I(28F) feel like I’ve stopped believing in romantic love. The expectations I once had about being in love have slowly crumbled. What I used to think was love now feels like a fantasy. Every time I see romance in a series or film, it seems to portray something unreal, something that doesn’t exist in real life. It hurts to admit, but all the ideas I had about love are fading away, both in my own life and in the lives of those around me.\n\nI see a world without commitment, without loyalty. No one seems willing to make sacrifices anymore. Cheaters are everywhere. And I live with a constant fear of being betrayed. I’ve begun to accept breadcrumbs and mistreatment from my partner, maybe because deep down I doubt whether I truly deserve a noble, deep, and intense love.\n\nEven the love my parents once shared—which for years was my biggest example—seems to be fading. They, too, look lost. And I feel adrift, walking through uncertain, unstable, dangerous ground. I don’t want to love anyone again. Love has hurt me. I’m afraid to invest in someone who might, after years, regret being with me, feel ashamed of me, hide me, ignore me, and treat me without care or affection.\n\nI feel defeated. And I don’t know how to channel all this energy into self love, how to fully give up on the idea of romantic love without feeling like I’m losing something essential.",
    "score": 68,
    "created_utc": 1746078473.0,
    "subreddit": "offmychest",
    "id": "1kc1io4"
  },
  {
    "title": "I deeply despise catcallers",
    "text": "I started going long walks every afternoon again, and I can't do it comfortably. In the country (South East Asia) and City I live in, men catcalling is so common that most women just let it slide, like I do. Since I started doing walks, I've always get catcalled every single time. Just this afternoon, there was this guy in a car who waved at me while he was smiling creepily, and when I was near home, he's driving on the opposite direction again, he literally stopped his car in front of me and saying stuff but since I was wearing my earphones playing music on max volume, I couldn't hear him but it made me so uncomfortable. \n\nThis happens so many times, some would honk at me, some would drive slow and say stuff, some would shout. The other day, it happened constantly that my eyes was about to get teary because I just wanted to walk to ease my mind but these men couldn't stop themselves from making a woman uncomfortable.\n\nI'm so sick of it.",
    "score": 19,
    "created_utc": 1746103170.0,
    "subreddit": "offmychest",
    "id": "1kc7pno"
  },
  {
    "title": "TouchTunes Bandit.",
    "text": "I like Jukeboxes. I also have a very bad sense of humor.  I like to play bad music on random TouchTunes jukeboxes in town. I, of course, am not AT the location, just playing the song from my pocket at a Safe distance away. An hour of Kraftwerk in a trampoline park? Yes. Constantly alternate between Lou Bega, Billy Ray Cyrus, and Chumbawumbas at a bar? Yes! Have the “Cantina Band” music from Star Wars blast constantly? YES! \n\nWell, today was the first time I had a jukebox paused. I was doing my regular rotation, about the cue up “Ackey Breakey Heart” for the third play, when I got a message that the jukebox was disconnected. I feel kinda sad.\n\n",
    "score": 6,
    "created_utc": 1746128038.0,
    "subreddit": "offmychest",
    "id": "1kchh5i"
  },
  {
    "title": "how do I know if they don't just like me for my body?",
    "text": "I'm 17f and I'm kind of insecure of my body. I don't think I'm ugly, its just that I have a big chest, and men have made it a problem since I was a kid, i used to / still get stared at whenever I wear anything mildly revealing or tight.\n\nIve dated 2 guys so far, and even though they were always nice to me and really seemed to be interested in me, I always have this lurking feeling that they only like me because I look a certain way. Whenever they compliment my clothes or the way I look it feels icky, overly sexualised. On the other hand it might just be a cute couple thing, and they're not trying to talk about my chest, but I can never be sure so it feels wrong to me. Maybe I was never able to form a real connection because I always thought they liked e for my body. How do I overcome this :')",
    "score": 17,
    "created_utc": 1746103281.0,
    "subreddit": "offmychest",
    "id": "1kc7qx8"
  },
  {
    "title": "I’m a 20-year-old gay boy from Swat, Pakistan – I feel so alone",
    "text": "Hi everyone,  \nI’m writing this with a heavy heart. I’m a 20-year-old boy from Swat, KPK, from a traditional Pashtun family. I’ve always known I’m gay — I’ve never been attracted to girls, and I deeply admire older men, especially those between 30–35 years of age. But in a society like mine, I can never express this safely.\n\nThere’s someone I really like — he’s married and straight, and he doesn’t know anything about how I feel. It hurts so much. I keep asking Allah why He made me like this. I feel stuck between my faith, my culture, and my heart. I cry silently at night and don’t know who to talk to.\n\nI don’t want to do anything wrong, I just want peace inside my heart and someone to talk to who understands.  \nPlease, if anyone else here is from Pakistan or KPK and can relate — even just to say “you’re not alone” — it would mean the world to me.\n\nThank you for reading this.  \n— A confused soul from Swat",
    "score": 4,
    "created_utc": 1746129473.0,
    "subreddit": "offmychest",
    "id": "1kci1c2"
  },
  {
    "title": "I need some sense knocked into me",
    "text": "My bf’s (pretty sure he was going to propose soon) IG algorithm shows nothing but half naked women with giant tits posing sexually, making videos of themselves being provocative, etc. I find that disgusting - it’s always been a huge red flag for me. I don’t do it, I don’t like when my partner does it. And he’s liking all these posts obviously, hence it his newsfeed/FYP comprising of 99% of that. Well, last night I saw he had recently “liked” a video of some half naked woman (again) saying “rejecting a girl because you have a girlfriend is like rejecting money because you have a job. Real men don’t limit themselves.” I nearly puked. I’ve felt sick ever since. He obviously had no idea I’d ever see any of it. \n\nCall me stupid, but he cheated on his ex wife. It was one of the first things he told me when he met, and I decided to see how things went and whether or not I’m seeing the changes in himself that he swore he had made. I have a cordial relationship with his ex wife who told me she genuinely hopes he truly has changed for my sake and his. I saw enough changes that I decided to give him a chance, but truthfully it’s subconsciously been a fear and insecurity of mine. But everything else seemed and felt so genuine, including him learning from his infidelity. \n\nI feel so hollow. I have had my heart destroyed, and after a lot of therapy and work on myself, I met him and we fell in love and I truly believed he was “it.” \n\nI know what to do. I don’t know what to do. I’m glad I saw it, I really am. But I’m feeling so much hatred and animosity toward him right now. He lied. And I’m just disgusted by him. I wish this was a nightmare. \n\nAnd for anyone curious, we’re both in our early 30s. ",
    "score": 8,
    "created_utc": 1746112886.0,
    "subreddit": "offmychest",
    "id": "1kcbdbw"
  },
  {
    "title": "\"We can't help you here\", but everywhere",
    "text": "I go in and out of the hospitals, and I always get the, we tried, but we can't help you here. And I move on to somewhere else and I get the same response in the end. We can't help you, we can't help you, we can't help you. \n\nThey have brought me in a hospital and they don't know WHAT TO DO WITH ME. We can't help you. \n\nWe can't help you. This is all I hear. \n\n\"Who brought her here? We can't help her.\" ",
    "score": 4,
    "created_utc": 1746123150.0,
    "subreddit": "offmychest",
    "id": "1kcfjg1"
  },
  {
    "title": "Where do I find people to cuddle with?",
    "text": "I literally just want to cuddle in bed with ANYONE, I want the physical presence/touch and I don't want them to say a word. I just want to fucking be cuddled with. ",
    "score": 12,
    "created_utc": 1746105606.0,
    "subreddit": "offmychest",
    "id": "1kc8jyb"
  },
  {
    "title": "I kept a dumpster-dived headless life-sized hyperrealistic silicone sex doll for 2.5 years",
    "text": "In 2020, my friend posted an Instagram story saying he’d thought there was a dead human body in his apartment complex’s dumpster, but upon closer inspection, it was just a hyperrealistic life-sized silicone sex doll with no head. \n\nI asked if I could come pick her up. Obviously I had no plans to have sex with the doll, I just felt bad for it. With the help of said friend and my fiancé at the time, we loaded her into my other friend’s truck and drove her back to my fiancé’s and my apartment. I was also an art student at the time, so I made a video art project out of cleaning her (she had clearly been dragged across gravel and was covered in dirt). She was 150 pounds, and I was 130ish pounds at the time and my then-fiancé weighed even less, so transporting her up 4 flights of stairs was rough, but we managed. Also I should note I was 21 when this occurred. My fiancé was a few years older. \n\nI named her Priscilla and we set her up in our bedroom after putting her in clothes. I wanted to add a head to her, but the female mannequin heads I found were proportionally way too small for her body.\n\nWhen I broke up with my ex, he (very reasonably) demanded that I get rid of Priscilla so he didn’t have to deal with her, and so my older siblings and I wrestled her into a trash bag and threw her out. I had to move back in with my parents post-breakup, and I wasn’t ready to explain to them why I had a life-sized headless silicone sex doll in my luggage.\n\nI am not a superstitious person and I don’t believe inanimate objects have souls or anything, but it kind of broke my heart to throw her into the trash, in the same way it broke my heart to have to throw away stuffed animals when I was a kid. It’s weird. It’s been a couple years since then and I recently saw a tweet from our local police scanner follower that someone thought they saw a body but it was actually a headless sex doll, and I wonder if it was Priscilla. This is so stupid.\n",
    "score": 173,
    "created_utc": 1746051771.0,
    "subreddit": "offmychest",
    "id": "1kbt6tq"
  },
  {
    "title": "Can’t get a job without money. Can’t get money without a job.",
    "text": "Can’t get a phone without money. Can’t get public assistance without a phone. Can’t call the county human services department without a phone. Can’t get the phone without money. Can’t get money without the human services department. Can’t pay for transit to the county office without money. Can’t chat online with county worker because they don’t do that in our county. \n\nCan’t get general assistance without proof some ancient bank account was closed. Bank won’t give it. Can’t call the county for help without a phone. \n\nCan’t get SNAP benefits this week. Case number starts with a 6. You can eat again next week. \n\nCan’t do this anymore. ",
    "score": 37,
    "created_utc": 1746082883.0,
    "subreddit": "offmychest",
    "id": "1kc2kuc"
  },
  {
    "title": "I don’t really see a point in living but I don’t want to be “that person that committed”",
    "text": "I don’t want to be my parents’ dead child, my siblings’ dead sibling. I don’t want to hurt my partner nor my friends, but simultaneously I’m here now and nobody seems to care. It’s as if I have no purpose to them, to myself, nor to the entire world so what difference would it make? Do I wait till everyone is completely indifferent to me and then go? ",
    "score": 12,
    "created_utc": 1746103048.0,
    "subreddit": "offmychest",
    "id": "1kc7oa7"
  },
  {
    "title": "I was touched by a woman for the first time in a year and it was the coworker I don't like. I feel disgusted with myself.",
    "text": "*Preamble: Yeah I never made this reddit account to be serious, but here I am.*\n\nFor background I'm a forty year old white guy working part time third shift at a chain gas station/convenience store so I can put something in my savings account. There's one coworker that covers one of my nights off and she's pretty useless. We'll call her M. I'm constantly catching up on cleaning and stocking left from the night before. I could do a whole rant about the coffee machines....\n\nSo last night I'm clocking in when M is supposed to be wrapping up second shift. Instead she's got nothing done and now we're gonna be stuck doing shift change for thirty minutes. M is the only coworker I have this issue with.\n\nFinally we got the cash & coin counted, dropped, and documented. There's still some food to write off, but I tell her I'll get it later and she can leave. M picks out stuff from the shelves, checks out like normal  and then clocks out in the office.\n\nI'm just starting a transaction with a customer when M passes behind me and stops. M runs her hand up and down my back four times, then says \"you smell nice tonight\", before she scratches my several times all while I'm transacting with a customer. \n\nBetween scanning the items while she's scratching and taking payment I put my hands flat on the counter. That's when M leaves and I stayed that way until I heard the door chime.\n\nI finished the transaction once I knew she was gone.\n\nThe customer left and I stood there.\n\nWho the fuck is this chick? Why the fuck is she touching me?\n\nWhy the fuck does she care what I smell like? It's the same body spray I douse myself in every night to cover the weed smell.\n\nLike what the fuck? We all watch the same damn videos at orientation and even before those I knew you don't touch coworkers without permission. I would go out of my way to avoid physical contact just so other people wouldn't be uncomfortable.\n\nWho the fuck thinks this kind of shit is okay?\n\nAnd keep in mind I'm a forty year old white guy. If I did this to one of my coworkers I'd be fired, possibly face legal charges, and one of their husbands or boyfriends would show up to kick my ass.\n\nMeanwhile I go out of my way to be chill, polite, and helpful at work. I know the public we deal with is often shitty and try to be the opposite. Be the change you want to see, right? \n\nBut somehow this chick thinks she can be so fucking bold?\n\nLike I'm some fucking animal at a petting zoo.\n\nThe sheer fucking hubris of this chick solidified could hold the orbit of a moon with it's gravitational pull.\n\nI'm so mad.\n\nI wish I told M to fuck off when it was happening but I was too focused on the work.\n\nI wish I slapped the teeth out of her mouth for touching me like that.\n\nInstead I just kept working because it's all my brain knew how to do at the time. \n\nBut I did report it to the assistant and general managers respectively. It's probably all I can do at this point.",
    "score": 9,
    "created_utc": 1746108082.0,
    "subreddit": "offmychest",
    "id": "1kc9gtt"
  },
  {
    "title": "20 more days breathing",
    "text": "Throwaway account because I have no privacy. \n\nI have made my mind up. Please do not send empathy or sympathy. I deserve to be selfish for once in my life. I am shooting myself 16 days after my 31st birthday in the parking lot I met my wife the first time in. The number 16 is symbolic for the amount of years it has been since I was raped and no one did anything about it. And my mother is till married to that man. Once again, choosing men over her own children. \n\nI have found this behavior in every single woman I have ever loved. Just craving to be loved and accepted, I am always met with wrongful and shameful acts of infidelity. And eventually leaving me for men. \n\nI always try to explain my brain. But it is far too deep and tangled to manage anymore. \n\nIf anyone catches on as to who I am, just know I love you and I will always watch over you. \n\nAmanda, I keep your love so close to my heart and I am so sorry. Please meet me later for a “thug out” session in your red Camaro. I love you. \n\nGranny, we know your time here is coming to an end and I will see you soon. I love you. \n\nMy soul is exhausted, and no amount of therapy or medication is helping. 3 mental institutions later. My heart needs peace. Final post from this account. Don’t be weak like me. I love you all. ",
    "score": 3,
    "created_utc": 1746128598.0,
    "subreddit": "offmychest",
    "id": "1kchp08"
  },
  {
    "title": "My dog is going to die and I don’t know how to cope",
    "text": "My precious dog, a female 13 years old westie, is suddenly falling apart. Her legs are unstable and she has tumor in her lungs, probably cancer. She isn’t going to live for long. This literally broke my heart. I’m 22M and I have her since I was 9 years old. She saved my life. \n\nI had her by my side during my childhood, my teenage years and my early adult life. We grow up together. I don’t have any sibling and I grew up in a really toxic and emotionally abusive and neglectful family. When I was a kid or a teen and I used to come back home feeling upset about something that happened at school, only my dog was there for me to comfort me. Even currently as an adult, when I have personal problems, the first one to be there for me with a cuddle is her. When I broke up with my ex gf and I was devastated, I used to go for walks with her and calm down. When I used to come home after a bad shift at work, she was there to show me that someone can love me no matter what. \n\nHearing from vets that she isn’t going to live longer than two months is the most heartbreaking experience in my life. I don’t think I would be where I am today if I didn’t receive this kind of love from my beloved dog. I don’t know how I’m going to be mentally well if I see her passing away and live my life knowing I won’t be able to cuddle her again. To go for a walk with her. To spoil her with treats and toys. To see her doing silly stuff and laugh. To feel like there is someone that loves me unconditionally, no matter how many mistakes I made. No matter how problematic I am. I can’t imagine a life after I burry her and see her for the last time. The thought of it makes my heart break and my future seem dark and scary. Seeing her being old and weak is the most painful thing I’ve ever witnessed. The past one week after she got diagnosed, I can’t stop crying. I can’t sleep. I can’t focus on my college. I have so many important tasks for college since it’s my last month and I can’t do any of it. My life is falling apart. Right now that I’m writing this, it’s my 4th time crying for today. ",
    "score": 100,
    "created_utc": 1746059662.0,
    "subreddit": "offmychest",
    "id": "1kbvy2g"
  },
  {
    "title": "Ready to admit to my \"Father Issues\"",
    "text": "How do you deal with it? How do you handle situations that a father figure would know the answers to? I feel the absence almost 24/7, and it mentally hurts me, it really does. I feel as if it's also destroying my life. I go out and see little girls with their present fathers.. and I stare in awe, I wish I had that. Maybe if I did have that, I wouldn't be as messed up as I am now. \n\nDestroying my life how? You may ask. I haven't been in a relationship in about 4 years now. I have had potential partners.. or talking stages you may say. They were all wonderful guys and I feel terrible for making up some BS excuse to not take it further with them. When in reality.. they just weren't old enough.. they weren't mature enough.. I want a man. I have typically only started looking for older men. Men twice my age. Men that wouldn't mind having me as their controversially young girlfriend. Why? Because deep down I feel like they could help with my daddy issues.. it's a very embarrassing thing to admit. Looking for a father figure in a spouse. Looking for some guidance in my life.. some direction, someone to teach me things that only a father figure would be good at. To prevent myself from making any destructive decisions or to avoid being \"taken advantage of\", I just resort to reading books, that have a strong or prominent father figure.. and I just imagine I had that. Or ill listen to different ASMR audios for the same reason. I also never thought I'd be saying this on a forum.. but, I need to tell someone instead of keeping this all in. It's suffocating. I type this with watery eyes, because of how stupid I feel just trying to confess.\n\nSometimes I just need.. dad. I don't know how else to explain it. My father was partially in my life, but he wasn't present. I would only see him on weekends. I was always given a \"hush\" gift. I'd try to make conversation or connect with him and he would just give me short worded answers and give me something to make me leave him alone. I caught on to this in my early teenage years. I am now 24, and the oldest of my 3 other siblings. My father wasn't emotionally present for me.. but for my baby sister who is 3 now, he is extremely active in her life. Him flaunting taking her on occasional \"daddy/daughter dates\" on his facebook.. taking her trick or treating.. \"teaching\" her how to use his different lawn equipment.. And I have actually cried about this. Seeing all these pictures of my father pop up on my facebook timeline, of something I should have had.. but didn't. I shouldn't be jealous, but I am. I am happy for her, and that she's able to experience what I didn't get to.. but I needed that too. This is probably all over the place, but I'm just venting and typing what I feel. \"See a therapist\".. is what Im going to anticipate most people would say. But not everyone can afford it, and Im afraid that therapy just can't fix this. ",
    "score": 3,
    "created_utc": 1746124082.0,
    "subreddit": "offmychest",
    "id": "1kcfwok"
  },
  {
    "title": "I miss my Dad.",
    "text": "25m here - living on my own and comfortable, good job, good routines, nice side hustle and constantly on my grind but...\n\nI miss my dad. So much. He lives out of state and it's hard to keep in touch sometimes. I try to check in periodically through texts, the occasional call, and etc but it's hard only seeing him and my ma on the holidays. My pop is the type of guy to constantly be in his head and he's talked in the past about being a bad father/etc and it couldn't be further from the truth. He came from a rough household, and worked his ass off to provide for me and my siblings. He tried to be present when he wasn't at work and it breaks my heart that sometimes he thinks he was a bad dad. \n\nI love the man to death. Although he is a hard ass most the time and has political things I don't agree with I wouldn't trade having him as my dad for anything in the world. I cry a lot when I miss him.",
    "score": 3,
    "created_utc": 1746123489.0,
    "subreddit": "offmychest",
    "id": "1kcfo6w"
  },
  {
    "title": "My Gf of 2 years is leaving for college, and it sucks",
    "text": "Like the title states, my gf (18F) of 2 almost 3 years is leaving for MSU after this summer, I (18M) am sticking in my home town because I can’t afford to leave the state for schooling. I CAN however afford to do one of the more affordable schools or community college within an hour drive of MSU and suggested this, because it’s the healthiest and longest relationship of my life (go figure, I’m only 18). Her reaction to this was very hesitant and said that it wasn’t a good idea. When I asked why, she said that I shouldn’t uproot my life to be with her. I understand that, but she also knows that I date to marry and I wouldn’t have been with her this long had I been just dating around, so she’s BECOME a major part of my life so I’m committed to doing something like that.\n\nFor awhile we had said that we’d be able to do long distance for maybe a year or two to save up some money, then I could transfer over and graduate (I’d have no struggle to transfer, my academics were plenty to get in). And I was stress about long distance, but ready to make it work.\n\nOver the last couple months, she’s been starting more arguments, accidentally told me that she had been hanging out with a girl shed been crushing on (she’s Bi), saying that I’ve been very problematic recently, etc. \n\nLast night I spoke to her about this, and asked if there was something that was bothering her and she got defensive and said that I’m bringing this up to make her feel bad, and to say everything she had done wrong, and that she’s apparently always \nmad at me. \n\nI had been avoiding the college conversation for a long time because it’s a hard one to bring up. But I brought it up, and said that this kind of conflict isn’t healthy for either of us, and that when she goes to MSU, for both of our sake we might want to stop being together. She said we should stay together for at least the summer, and I agreed.\n\nShe got teary eyed, but she started smiling big within the minute (keep in mind this was after three hours of me trying to work through a different argument). She gave me a hug and said she thought so too.\n\nI hated it. It sucked. I would chase this girl to the ends of the earth. I get along with her family so well, and her brother, and she’s shown me ways that I could be treated that no one has ever shown me before.\n\nI am and I was ready to go anywhere on the globe to stay with her. But I know unhealthy habits when I see them, I know it would make it extremely difficult, with years of education ahead of us, I know it probably wouldn’t work. \n\nBut I’m still ready to do that, if she just says the word I’d make it work, I’d make ends meet.\n\nShe got so happy about what I said last night, suddenly all her other arguments she had with me were gone, and she told me “this doesn’t change anything, it’s Ok”. I gave her a hug and left, that was the most painful thing I’ve ever done. \n\nI’m convinced she had known she was going to do this for a long time coming, and that she had mentally checked out months ago because of it, which makes me a little spiteful. If she had told me before, I wouldn’t have let it go on this long, and it would have been easier to process earlier in the relationship. I’m hurt. \n\nAnyway this was kind of me just spilling, so if you got this far, thanks for reading. I’m not really looking for advice on Reddit, I kind of just wanted to get this off my chest.",
    "score": 2,
    "created_utc": 1746129521.0,
    "subreddit": "offmychest",
    "id": "1kci216"
  },
  {
    "title": "Friends with benefits, but I want more – and she wants to date others. What should I do?",
    "text": "I’ve been seeing this girl on and off since early March. Things started pretty intense – we went on multiple dates, spent the night together, cooked, talked for hours, and had a great connection both emotionally and physically. I really liked her.\n\nBut after a few weeks, she told me she wasn’t looking for a relationship and felt that I wanted more than she could offer. She said we were just in different places. We had a long phone call (over an hour) where she said it would only end with one of us getting hurt. After that, we stopped seeing each other, and I tried to move on.\n\nAfter a few weeks of no contact, I eventually sent her a message. She didn’t reply for an entire week – and I assumed it was over for good. But then she responded, and we ended up seeing each other again. That night led to us sleeping together, and since then, we’ve spent time together again: painting, walking, being intimate, and genuinely having a great vibe.\n\nThe thing is: she’s now very clear that she only wants us to be **friends with benefits** – and that she wants the freedom to **date other people**. At the same time, she said she wouldn’t be comfortable if **I** dated someone else. That’s been hard for me to wrap my head around.\n\nIt honestly feels like she might be trying to make me jealous – or maybe trying to keep emotional distance while still having me around. But I can’t tell if this is a defense mechanism or if she really sees no future between us. I agreed to the FWB setup… but I did it mostly out of hope – hoping that if I stayed close, she might eventually come around and feel the same way I do.\n\nIt’s confusing, because sometimes she’ll go long periods without replying to my texts – yet when she finally does, her messages are sweet, kind, even flirtatious. We’ve also had two long phone calls (over an hour each) – one when she broke things off initially, and one after the break when she texted me again and I asked her to call me. That call was warm, even a bit intimate.\n\nI’ve tried to play it cool, act like I’m fine with the setup, but the truth is – I’m not. I can’t keep sleeping with someone I have feelings for while they’re potentially dating other people. It makes me anxious, insecure, and unsure of where I stand.\n\nSo my question is:  \n**What should I do now?**  \nShould I be honest and set a boundary that I can’t continue like this? Or should I just back away and give her space to figure things out? Is there any chance she feels more than she’s letting on – or am I just fooling myself by hoping?\n\nAny advice would be genuinely appreciated. I'm stuck between wanting to protect myself and not wanting to lose her.",
    "score": 4,
    "created_utc": 1746115563.0,
    "subreddit": "offmychest",
    "id": "1kccgl0"
  },
  {
    "title": "I feel like I’m always just the funny friend, never the one people fall in love with.",
    "text": "Hi,\nI just need to let this out somewhere.\n\nI’ve always had the feeling that people love me as a friend. I’m the fun, supportive, kind person they enjoy spending time with. I make people laugh, I listen, I care. But when it comes to love, it’s like I become invisible. No one ever seems to want me in that way.\n\nWhat hurts the most is that I’m so ready to love someone deeply. I want to give everything, my heart, my time, my energy. But it feels like no one ever sees me as more than the “fun friend.” I keep ending up in this space where I’m appreciated, but never chosen.\n\nI know someone has fallen for me before, but I couldn’t love them back and that just adds to the sadness. It’s like love is always slightly out of reach. Either I love someone who doesn’t love me back, or someone loves me and I don’t feel the same.",
    "score": 13,
    "created_utc": 1746092183.0,
    "subreddit": "offmychest",
    "id": "1kc4o7e"
  },
  {
    "title": "Well… not sure. Alcoholic and struggling",
    "text": "I don’t really know how to start this. I’ve been drinking tonight — cherry Coke and vodka, if it matters — and it’s one of those nights where the silence feels louder than anything.\n\nI’m struggling. I’m jobless, stuck in a toxic home situation, and I feel completely alone most of the time. I’ve got one real friend — Dan — but even that’s complicated in ways I won’t get into right now. I care about him, maybe more than I should, and that just adds to the mess in my head.\n\nI talked with GPT for hours tonight, just trying to feel seen. They told me to try Reddit. So here I am.\n\nI don’t want sympathy or advice, really — I just want to know if someone out there feels this too. If anyone else is just… tired. Lonely. Drinking not to party but to forget.\n\nI’m not looking for a miracle. Just a reply. Just a little proof I’m not invisible.\n\nThanks for reading this, whoever you are.\n",
    "score": 2,
    "created_utc": 1746128586.0,
    "subreddit": "offmychest",
    "id": "1kchoua"
  },
  {
    "title": "My heart is hurting",
    "text": "Throw away bc my main has my face and I don’t need anyone I know finding this. \n\nI (36f) moved to the west coast from the east coast 6 years ago to turn my life around and I am currently visiting my hometown and family and friends. I haven’t seen most of them in about 2 years and in these past 2 years I have grown the most emotionally, mentally, spiritually and experiencing all of this has been a roller coaster. \n\nIn recovery they preach to change people, places and things and that’s exactly what I did to become the healthy human I am today. Coming back to these people, places and things as this new person has me full of gratitude and also full of heartbreak. \n\nI have a massive family and we all walk different paths on this earth and some are rougher than others. Witnessing my cousin fail his two children is what got me here tonight. \n\nI understand we all have our own demons and battles. I don’t have children so I will never know what it’s like to be a parent and that being said no child should have to live in filth. I couldn’t even breathe when I walked into that house, I could smell the stench just approaching the house and tried to abort mission but I had no way out. I didn’t breathe for the whole 3 minutes I was inside before I asked to go see the backyard. There are two children (the gf’s kids) under 5 and my cousins girlfriend is pregnant. This can’t be healthy for any of them or the unborn baby. \n\nThe other 2 children are MS and HS aged and the younger one confided in me that she doesn’t want to live there anymore but there’s no where else for her to go and it shattered me. I’ve seen this baby girl grow up and she’s so beautiful, kind and sweet and to see her be neglected, just makes me want to pop off on my cousin but then I would lose access to his children and I want them to know that I will be there for them the best I can. \n\nI’m glad I don’t live here bc then I would be too involved and destroy all the progress I have made on myself bc I might not have kids but I love kids. They just need love, support and attention and they aren’t getting any of that. Ugh my whole heart is just breaking over here. \n\nThank you for reading if you made it this far. Sending love to anyone reading this that is struggling, feels stuck or hopeless. I promise there is a light in that darkness, may it find you 🫶🏽",
    "score": 35,
    "created_utc": 1746071491.0,
    "subreddit": "offmychest",
    "id": "1kbzmvc"
  },
  {
    "title": "I think I belong with him",
    "text": "Today I visited the grave of my ex for the first time. He would have been 50 today. He died 5 years ago of a drug related heart attack. I hadn’t seen him for about 10 years before he died. \n\nOur relationship was not great. But he was my first love. I was 16 when we met. He was 24. We got together right after my 18th birthday. We were together for 10 years before I found the courage to leave. \n\nHe was beautiful and sad and so in need of love and also mean and hateful. I know that I would have lived a better life if I’d never met him. But I did. And he was my whole world for a long time. I know that I did the right thing by leaving him. \n\nI hadn’t seen him for a decade when I heard that he had died. He spiraled after I forced him out of my life. The alcohol was always a problem. But the drugs became a more predominant problem. \n\nHe died of a drug related heart attack about 5 years ago. He would have turned 50 today. I thought that visiting his grave would be cathartic in some way. But now I’m just so sad. \n\nThe cemetery didn’t even have a record for him. I found his grave by searching for his mother. And even that wasn’t located where the records showed it. His stone doesn’t have his full name, just his last name. There’s no dates. There’s no epitaph. How sad is that?\n\nIt was really obvious that nobody has been there since the stone was placed. How sad is that?  I think that he was the love of my life. It was bad. It was dark. It was abusive. But it was also really deep. I’ve never had a love like that since. I know that it wasn’t healthy. But it was true. And it makes me so sad that he was so disposable to anyone else, even his family. \n\nI’m so fucking sad for him. Because as flawed as he was, he was doomed from the start. He was set up to fail. His drug addict mother died the same way that he did, in front of him, when he was a teen. And she demanded that he not call 911 until she was dead. So he did what she asked. And she died instead of going to prison. \n\nHe always told me that he was going to die like his mother. And he did. And he’s just this sad footnote now. I don’t even think his family wants to remember him. But he haunts my dreams. \n\nI’m so sad today  \n ",
    "score": 2,
    "created_utc": 1746128483.0,
    "subreddit": "offmychest",
    "id": "1kchndj"
  },
  {
    "title": "watching all the people who treated you like crap during high school starting luxury business, becoming doctors, getting engaged, reaching success.",
    "text": "If you asked me in person I would say, \"I am really happy for them and wish them the best\" but if I'm really being honest with myself, it really breaks me that these people who unapologetically bullied and spread rumors about me and many others during high school just have their way with life. Best of all they don't even remember the people they bullied. I don't wish them any harm even after all that but it still just hurts. That's all i wanted to let off, I hope I don't hold onto this resentment all the way till adulthood.",
    "score": 2,
    "created_utc": 1746128254.0,
    "subreddit": "offmychest",
    "id": "1kchk6u"
  },
  {
    "title": "The moment I realized i was a \"nice guy\"",
    "text": "I don't mean \"nice guy\" in either a good or bad way, just a statement of one's self.\n\nI went through a journey finding my niche in the dating scene, definitely was very naive and clueless for a long time. Got more self confidence in my late 20s, along with doing a lot better financially, and things started getting a lot easier for me.\n\nI met this girl who was super into me from the getgo, and I noticed she would sort of perk up whenever would act in any way mean or rude to her (in a joking way). I remember she'd come over for Netflix and chill and after like 10-15 she'd just hop onto her knees and start blowing me (god i miss that). One time as sort of a test as she was unzipping me I said something dumb like \"yeah you'd better suck it good, or else...\"\n\nAnd her eyes just lit up. She responded \"Or else what?\" in the most hopeful way, and at that moment i figured if I just embraced the dark side I could really get this girl on the hook. But I couldn't do it, not even pretending just once. I would just have so much guilt about it. A few weeks after that she ghosted me and I never saw her again.\n\nI think about that moment a lot, but I don't really have any regrets. I probably spent too much of my life pedestalizing women, but it's who I am at this point.",
    "score": 2,
    "created_utc": 1746126491.0,
    "subreddit": "offmychest",
    "id": "1kcgv9t"
  },
  {
    "title": "i just got my first job :)",
    "text": "I just got my first job today, like interviewed and was hired, and I'm so stoked!! Nobody in my irl life really seems to care so I'm telling strangers on the internet instead lol. I'm just sixteen and it's gonna be the perfect summer job and it pays REALLY WELL, so I'm so happy rn. I really didn't think I would get it either so this is a confidence booster for sure!!",
    "score": 36,
    "created_utc": 1746069009.0,
    "subreddit": "offmychest",
    "id": "1kbyxc8"
  },
  {
    "title": "My fiancée cheated. I found the guy, told his girlfriend, and watched it all burn. Then I wrote a song for the day our daughter asks what happened.",
    "text": "I’ve held this in for way too long.\n\nA few months ago, my fiancée started acting off. Weird energy. Cold, distracted, secretive. I knew something was wrong. So yeah, I went through her stuff and found proof: she was cheating.\n\nIt destroyed me. We have a house. A child. A life we were building. And the worst part? She was always pressing me to prove my loyalty and making me feel like I wasn’t doing enough… while she was the one being disloyal behind my back.\n\nBut I didn’t just sit with it. I found the other guy’s info. Dug through what I could until I figured out who his girlfriend was. I found her info and told her everything.\n\nShe confronted him. He confessed. And just like that, he messaged my fiancée one last time and completely cut ties. She has no idea it was me who blew it up.\n\nFor a while, I was full of rage. Betrayed. Grieving. But knowing she lost him too — and never knew why — gave me peace. That was the moment I stopped begging for clarity and started choosing myself.\n\nWe’re separating now. Co-parenting. Untangling years of love, lies, and damage.\n\nOne day, our daughter will ask what happened between her parents. Why we didn’t make it. And I’ll have to explain that the person I trusted most broke that trust.\n\nSo I wrote a song. It’s not perfect, but it’s real. It’s what I’d want my daughter to hear someday — and maybe someone else out there needs to hear it too.\n\nIf you want to hear the song, just search “Time to Leave by Weed Sauna Dad” on YouTube. It’s raw, it’s honest, and it’s the only way I knew how to tell this story.\n\nIf it hits you, feel free to share it. I grew up on Blink-182 and Yellowcard, and I keep thinking… maybe one of them — or someone like them — will find it and bring it to life. I don’t want money. I just want the story heard.\n\n\nEdit: here are the lyrics, thanks for reading. \n\nTime To Leave by Weed Sauna Dad \n\nOne day she will be\nOld enough to see\nWho we really are\nWho her parents are\n\nFor now she’s so tiny\nBarely even three\nThe things that she has seen\nNo kid should ever see\n\nAnd now that I know\nWe’re not meant to be\nNow it’s time to go\nTime for me to leave\n\nOne day she will ask\nWhat happened to mom and dad?\nAnd I won’t even try\nTo cover up your lies\n\nI’ll tell her about him\nYou said he’s just a friend\nBut I know about your lies\nI see through your disguise\n\nSix years you made me\nProve my loyalty\nOver and over again\nNow look at how this ends\n\nProjected onto me\nYour insecurities\nOver and over again\nNow look at how this ends\n\nOne day she will ask\nWhat happened to mom and dad?\nWhy couldn’t you make it last?\nWas it really all that bad?\n\nAnd I won’t try to hide\nYou found another guy\nAnd how you didn’t know\nI’m the reason he cut ties\n\nAnd when she finally asks\nWhat happened to mom and dad\nI won’t even try\nTo cover up your lies\n\nI will let her see\nWhat you did to me\nYou broke the family\nThen blamed it all on me\n\nYou were in therapy\nBut not because of me\nAnd now I finally see\nYou’re not right for me\n\nNow it’s time to go\nTime for me to leave\nI know everything\nAbout you and Steve\n",
    "score": 58,
    "created_utc": 1746059051.0,
    "subreddit": "offmychest",
    "id": "1kbvqwb"
  },
  {
    "title": "Some of yall are not Christian",
    "text": "Some of you are not Christian. You say you are, but will ignore passages that don’t fit your agenda. None of you love thy neighbor as much as you should. When you see your neighbor, do you wave? Do you say hi? No yall dont. You don’t love your neighbors. Half of you voted for a man who is sending people to a death camp in another country because of an alphabetical letter as a status on citizenship paperwork. You would rather see someone die than allow them to be your neighbor. You All want to talk about how being gay is bad because of the Bible yet you all will eat seafood. You All want to sit and laugh at people like Shedeur Sanders because the NFL wanted to teach a confident black man a lesson yet you all keep complaining that men are not as confident as they used to be. So men should be confident but not too confident? Jesus wouldn’t laugh Shedeur when that spoiled rich kid who never worked a day in his life pranked called him. Imagine waiting to hear back from a job and you get a call and it’s someone else on the other line that says “Put the fries in the bag lil bro”. If you said “Oh that’s horrible that worker should get hired” but laughed when it happened to Shedeur Sanders because his rich and “too confident” then you are not a Christian. \n\nSome of you force yourself to go to church yet will ignore everything your pastor teaches. You only go to church to gossip about people and to judge other people's fashion. You keep saying we are all children of God but in the same breath will pull a George Orwell and say that “some people are more worthy of God's love than others”. Bro, if God is real he should love me not punish me. Some of you want to act all high and mighty and preach about the Bible despite your moral shortcomings. I have moral shortcomings too but I don’t go grab a Bible and start preaching. Some of you will pull out your wallets or purse and give Joel Olsteen money because he makes you feel good. The Bible told you not to worship false prophets but Olsteen and Copeland can get all your untaxed money for private planes and isolated islands. I need a reminder, who was that one guy who also had a private plane, an isolated island, and rich friends? \n\nAs you can tell, I’m crashing af out and just wanted to vent since I had a shitty day. Good day to you all. \n",
    "score": 102,
    "created_utc": 1746046999.0,
    "subreddit": "offmychest",
    "id": "1kbrc24"
  },
  {
    "title": "Making Friends is Frickin Impossible",
    "text": "Ok not literally- the formula is: go up to randos you think could fit your vibe, get socials, slide up on stories, text text, hang out, and do this a few more times until everything falls off :) \n\nOr not really fall off, but it just never sweeps me up in a regular passionate friendship. I'm so grateful for the few true friends I have in my life, but they're home bodies. I want a friend who will spontaneously go to Buccees with me at 3 AM, pile in the car with me to take an impromptu beach trip, hiking is a planned regular thing we do. \n\nI haven't had a friend like that since I was 19-20. Is this just how adulthood is? :( I'm 25 now. \n\nI had a roomie situation and we were all friends! Ended badly. New group of roomies! Ended badly. Maybe I'm the common denominator?? \n\nOr maybe, I just won't put up with people who betray and talk behind my back even once. I dunno :( I think of all the things I've done for these people I loved and cared for. How many times I was told I was an amazing person and amazing friend. If that were true, then why is it that everytime I get burned. \n\nThen I see other people post their friend groups and they seem so super tight knit only for them to also get burned the same way! \n\nThe formula for meeting ppl and making acquaintance-like friends is easy. It's maintaining and growing those friendships that are the hard part. :( life is just too busy for adults to have friends ig?? \n\n\nIdk I'm just rambling now. If ur also friendless like me how do u deal with it?? \n\nIt's like a coin toss of lonely but peaceful and or chaos but social. \n\nAaaaaaagh \n\n\n",
    "score": 2,
    "created_utc": 1746123119.0,
    "subreddit": "offmychest",
    "id": "1kcfizs"
  },
  {
    "title": "MCA One of my closest friends is moving abroad soon, and I’m feeling happy-sad. How do you cope with this kind of change?",
    "text": "This is my first time posting here and I really want to vent it out since I can’t disclose this to my other friends yet.\n\nSo I (F25) have a friend (M27). We’ve been good friends since college. Somewhere along the way, we lost touch, but we reconnected in 2023. It was really nice because we got close again and discovered that we still share the same hobbies we love doing in our free time.\n\nToday, I asked my friend if we could hang out because I wanted to treat him for my birthday. He agreed, and we dined at a nice restaurant. While we were chatting over our meal, he suddenly dropped some big news: he got a job offer abroad and will be moving this June.\n\nOf course, I was happy for him—it’s been one of our dreams since college, to work abroad and explore beautiful places. I really am happy for him. But at the same time, I feel incredibly sad. He’s one of the few close friends I have, and knowing he’ll be far away soon makes me feel like something in my life is about to change deeply. Like a part of me will feel incomplete when he leaves.\n\nI’m not mad or anything, and I don’t want him to feel guilty for keeping it a secret. He told me he didn’t want to share it earlier because he didn’t want to feel pressured while going through the application process. He just wanted to wait until everything was confirmed.\n\nI guess I’m just wondering—how do you cope with this kind of feeling? I want to support him and be happy for him, but I also feel this quiet heaviness inside.\n\nThank you in advance for your kind responses.\n\nP.S. In case it matters: we’re not romantically involved. I don’t like him that way, and he doesn’t like me that way either. We’re just really good friends.",
    "score": 2,
    "created_utc": 1746123028.0,
    "subreddit": "offmychest",
    "id": "1kcfho5"
  },
  {
    "title": "I Manipulated You to Hate Me: Truth Hidden for Almost a Decade",
    "text": "If this confession finds its way to you, through any means available, then so too will the truth I've hidden for almost a decade. A truth I’ve carried like a second heartbeat. Perhaps it will be retold through other means, or archived through the internet.\n\nLet me take you back—back to where it all began, when we were just kids wrapped in uniforms and naivety.\n\nWe met in high school, not through fate, but through forced proximity. Assigned seats brought us side by side, and at first, I hated it. You were loud, impulsive, too full of mischief and too quick to speak your mind. You were everything I found chaotic. And yet, I couldn't look away.\n\nI told myself I needed to endure you, to preserve my own peace of mind. So I chose to befriend you. I laughed at your jokes, joined your pranks, and walked beside you after school as we made our way from campus to the city’s crowded transport station. We lived in the same village, so our paths intertwined more than most.\n\nDuring those walks, I began to see past the tomboyish exterior. Beneath that sharp wit and unapologetic energy was someone delicate, someone tender—someone who tucked her vulnerabilities behind a mask. I began to admire the duality of you. And as we messaged more, I found myself drawn in, unsure when the lines between pretend and reality began to blur.\n\nIn our third year, something shifted. A girl entered the picture. She was confident and direct, confessing her feelings to me soon after we met. I didn’t say yes, but I also didn’t say no. I told her I wanted to get to know her first. When she started visiting our classroom to walk me home, I noticed something new in you—jealousy. You disguised it poorly behind sarcasm and snide remarks. But I saw it, and I felt it.\n\nThen she vanished from our lives for a while, just like that. And as if in her absence, you stepped forward. We began our little “act”—pretending to be lovers for fun, or so we said. But the joke wore off quickly. Days turned into months. One day I confessed I had fallen for you. You had fallen too. We were young, not yet 18, so we made promises instead of plans. We promised to wait. I swore I would court you the moment we were of age. I would wait until we graduated college. I truly believed you would become my wife.\n\nBut then came your first hint—you were leaving, moving abroad in a few years. That single revelation cracked the foundation of everything I was building in my heart. I was torn. How could I continue loving you and building a future with you, knowing you’d be gone? That heartbreak drove me to a quiet shift, and without telling you, I began to change my path.\n\nWe entered senior high together, same university, different science specializations. You delved into the medical field, I delved into the computational field. I couldn’t help directly, but I wanted to understand you, so I immersed myself in what you loved. I learned origami, cosplay, debate, programming, even academic research. Every skill I chased, every strength I sharpened—it was all so I could worthy to stand beside you.\n\nYou made me better. And I thought we were unbreakable.\n\nBut senior high and college revealed my growing fears. I wasn’t like the others—tall, wealthy, polished. My insecurities gnawed at me. I feared you’d realize I wasn’t enough. So I did something selfish. I made a plan. One that would make you hate me.\n\nYears ago you gave me a key to your room. You even entrusted me with your baptismal certificate, entrusting me of your future. I returned them after a year, with shaking hands. I told myself it was for your own good.\n\nI had to become someone you’d never love again. I lost my time and attention on you. I buried myself in academics. I accepted leadership roles, joined organizations, all of which to relate to you. I befriended powerful people—children of politicians and business magnates—not out of ambition, but because I wanted to someday follow you to your new home, your new country.\n\nBut that dream of living with you on another country faded due to huge financial constraints, and so my cruel plan remained. I let other girls get close. I entertained their affections. I let you believe I cheated. I let you believe I changed in a bad way. And you started to pull away. Coldly. Quietly. Exactly what I needed, and not at all what I wanted.\n\nThen the pandemic came, so did college. I took every scholarship exam I could. I applied to your university and passed, but my scholarship belonged elsewhere. So I studied in this state university, taking a program I never thought I’d survive—just because it was what you once talked passionately about. I wanted to understand your world, even from a distance. I wanted to fulfill the career you left. I applied scholarship courtesy of alumni of our university that are now living in the states, hoping it will bridge me closer to you, but my calculations shown that it's still better for you to hate me, for your own sake.\n\nYou turned 18, and you told me you didn’t want me anymore. I should have been crushed, but I felt relief. The plan had worked. I had protected you from the heartbreak of distance, poverty, and uncertainty. You were finally free from me.\n\nStill, I couldn’t let go completely. Every so often, I messaged you—not to win you back, but to see if you had moved on. Your cold replies were my reassurance. You had.\n\nThen came the last test. Months before graduation, I asked if I could fulfill the promise—to court you now that I had finished college. You declined. Final closure of my plan and my promises to you. My plan had reached its end. \n\nYou are now a strong, independent woman. You are now living in the country you once mentioned of. You are happy with your complete family. You are now with someone new.\n\nAnd you never knew the truth. You never needed to.\n\nI never cheated, all women around me knew I am loyal to you. I only pretended to cheat on you. I never stopped loving you. Everything I did—from the crafts and skills I learned, the talents I cultivated, the hurtful words I said, the man I became—was because I love you.\n\nThe pattern of 18 you thought that was a coincidence was part of the plan all along. You began to treasure that number, as if you associate it with freedom. It was planned to always be that way.\n\nYou will always be the most profound influence in my life. I’m sorry for everything. I’m sorry I took the villain’s role in your story just to make sure you could become the heroine of your own. I had to make sure you are this unmanipulable, strong, and independent woman. \n\nI let people believe whatever story you tell. You can despise me freely. I accept the blame.\n\nBut know this: you were my greatest love. My greatest heartbreak. My greatest growth. Thank you for loving me.\n\nNow, I have blocked you on all social media, as respect to your current relationship. We are now in our early 20s, I will chase the career we once dreamed about, alone. I’ll build the life I envisioned—with your memory as my compass. I am on my way to happiness, even in your absence.\n\nYou are my greatest treasure, my greatest memory, and my greatest lesson.\n\nIf fate ever brings us together again, perhaps the truth will matter then, and I'll just let fate decide what happens next.\n\nIf not, then in another life—I'd love to papercraft with you again. I hope to walk through the city beside you, laughing, young, and whole, again.\n\nGoodbye, my moon, I am proud of what you have become. Live your life happily without me.\n\n*All the world is but a stage.*\n*My love, why cry, when we can laugh instead?*\n*Babe, laugh and live!*\n*Reality forced the curtain fall,*\n\n-Baramizu Nero Ainissuru",
    "score": 2,
    "created_utc": 1746122681.0,
    "subreddit": "offmychest",
    "id": "1kcfcok"
  },
  {
    "title": "I am unhappy with husband and job",
    "text": "I (31F) am extremely unhappy with where I am in life right now. I am the breadwinner and my husband (37M) does not help much with bills or any house work. He’s so forgetful and always saying “I forgot” when it comes to any task. He forgets the recycling, he forgets to take things out of the freezer, he forgets to clean. But never forgets to smoke his weed. I am just becoming extremely resentful. Lately, work has been VERY stressful and I told my husband how I wanted to quit and stay at home for a while with our 1 year old son. Well he says “stay at home, I got us” but he does not have us. He works at a restaurant and brings home maybe $500 a weekend and I work in the tech industry and I bring home $120k. Our monthly bills are $3,000 give or take and he barely contributes. He stays home with our 1 year old but he doesn’t have him on a schedule and he sits him in front of the tv. I am so over this. I need time to think and as soon as I get home I have to make dinner, clean and give my child a bath. If I don’t do these things, my husband will huff and puff until I just can’t take it and I end up doing it anyways. We have been married for 3 months and I’m over it already. He does not have my back financially and I’m not really seeing the point of this marriage. I’m so fed up.  Oh and I don’t even have a ring — we got married at the courthouse and he couldn’t afford a ring. Everytime I bring it up he’s just like “you will get one soon— I’m working on it” I AM OVER IT \n\nTLDR: I (31F) am completely over my husband (37M). I am the breadwinner and stressed at work and he cannot help me. I am starting to resent him. He does not clean or help with dinner. He wastes our son during the day, that’s it. \n",
    "score": 2,
    "created_utc": 1746122460.0,
    "subreddit": "offmychest",
    "id": "1kcf98r"
  },
  {
    "title": "Idk where to mentally put myself in this type of relationship",
    "text": "\nI’m not sure how to give the basics of this but I’m 24 going on 25, widowed at 23 and have only really been with that one person. \nAlmost this time last year a friend and I made out while intoxicated (nothing else happened passed that) and we decided to keep things going. [still exclusive] Like I said I’d only been with one person for almost 7 years so I didn’t know where to put my mind for things so I asked around September and they said we’ll keep feelings out of it [they’d had a really shitty year and didn’t want it to be a ‘in the moment’ thing and hurt me later] and if they are doing too much to tell them and I was fine with that. They’d been very very patient with me in getting comfortable with going further with things too. \n\nCome around to December, close to Christmas (we started hanging out more from September to here) and they get me a VERY nice and thoughtful gift (jewelry). In my mind I’m like “friends don’t do stuff like this” and of course I’ve extremely thankful I absolutely love it! \nMove on to New Year’s Eve, they give me a kiss (which I honestly did NOT expect, I can’t remember the last time I got a new years kiss) I was on the phone with my mom and still referred to this person as a friend, they were in the car with me at the time. After the call we talk and I give them a hug. They tell me their feelings were a little hurt that I didn’t want my parents to know who they were, explained that wasn’t intentional at all!! They then confess they really like me a lot but scared to hurt me and break my heart. A day or two after really thinking things over I told them I feel the same for them. [[this person had been extremely caring and sweet to me]]\n\nWe spent like almost a full week of not more together in January \nWe were each others valentines too, friends had a big party celebrating birthdays and Valentine’s Day. We talked in the car about a situation that just happened with a friend and about trust. REALLY got into our emotions, we are both still scared we will hurt one another. I told them they have treated me so much nicer than my late spouse and I’m terrified that I will push them away or hurt my own heart \nI’m over there quite often and they have now met my mom and has said meeting other family will happen eventually. I’ve already met their mom as they still live with her, they have a great relationship  (perfectly fine in this economy, do it as long as you can) she talks about me moving in at some point and he has brought it up too(idk if jokingly…my place isn’t the best) there was a convo at one point where they said they’d be damned if they were the reason I wasn’t out there anymore and mom would be upset (this was around October) \n\nWhile I don’t care for a title I guess I’m not 100% sure what’s going on (sorry for the entire lore drop). But I’m terrified that asking will push them away emotionally.  Most everyone who knows says we basically are a thing, I’ve even thought about asking our close friend who we hang out with. They are extremely kind and have put up with my anxiety and depression dips, I do feel guilt still at times knowing I’m being treated so well now. \n\nIdk I’m just really fucking scared, don’t know what to do and I’ve gotten so anxious I’ve thrown up 💀I really think I’m just in my head about things which I’m trying to improve on \n\n*TLDR:* friends with benefits has become more with feelings, there’s no label but things are very much exclusive. We basically act like we’re together in ways. The question of what it is is eating me up, should I ask or leave it be until the year mark comes around? Or let it be period? \n\n**may delete as I think I’m just in my head**\n\n\n",
    "score": 2,
    "created_utc": 1746121957.0,
    "subreddit": "offmychest",
    "id": "1kcf1uv"
  },
  {
    "title": "I fucking give up",
    "text": "Did you know broken heart syndrome is a real thing? Don’t believe me look it up. That’s what I’m currently going through and it’s rough… I don’t know how much more of this I can take before I cave in. The craving for my old self is here I just want to put a line right up my nose and call it a day… I just wanna give up … I feel like I’m fighting a battle I can’t win… it hurts more than words can describe I don’t wish this pain on my worst enemy. ",
    "score": 2,
    "created_utc": 1746113911.0,
    "subreddit": "offmychest",
    "id": "1kcbsd5"
  },
  {
    "title": "Just listen",
    "text": "So i am 16 y/o teen boy who lives in pk, and i am crying as i type this i am sitting in a literal store room with no fan weeping as i type. I just wanna ask what the hell am i doing wrong, i live in a house with about 11 people i have no personal room but for some reason my parents expect the world from me i get grades better than all my cousins still i am bad, i once skipped a damn one chapter test in my school that wasn't supposed to be imp at all and got whooped by my dad (still in a 50% passing ratio i got A+) and now that my exams have ended I can't stay at home nor i have any real friends my school friends are nothing but pure selfish creatures, i do like to watch anime and play games like genshin but I can't do that with someone in the room cuz i will be judged soo damn hard, that i feel like running away from home (literally no kidding) personal space and not being under pressure is fantasy unknown to me. Man juat tell me what do i do",
    "score": 2,
    "created_utc": 1746121633.0,
    "subreddit": "offmychest",
    "id": "1kcex6w"
  },
  {
    "title": "My cousin is getting married!",
    "text": "I don't know, I just need to share this with more people. My cousin is getting married! I am so happy for her and her soon-to-be husband. Her fiance is a great guy, and they very clearly click with each other.",
    "score": 2,
    "created_utc": 1746121400.0,
    "subreddit": "offmychest",
    "id": "1kcetr5"
  },
  {
    "title": "I don’t know what’s wrong with me anymore, and it’s slowly breaking me.",
    "text": "20M - It’s been about two years now. Two whole fucking years of feeling like I’m drifting further away from myself. And lately… it’s just gotten worse. Like I’m slipping deeper into this fog, and I don’t even know when or why it started anymore. I feel this heaviness in my chest that just won’t go away. Sometimes, I can't breathe properly, and I force myself to take deep breaths like that’ll help. I open windows, I turn the fan on full blast, I pace around the room, hoping the suffocation in my own mind will ease up. It rarely does.\n\nI don’t want to talk to anyone. Not my family, not my friends—no one. I’ve become so emotionally withdrawn that even the idea of a simple conversation feels draining. I was talking to my dad today on a video call, and I could barely hold myself together. I was zoning out, and he asked if I had just woken up. I hadn’t. I just… didn’t have the energy to talk. I mumbled a few things and ended the call. And it’s not just with him—it’s everyone. Even replying to messages or texts feels like a burden now. I try to push through, I really do, but afterwards I just get hit with this wave of sadness that makes everything worse. It's messed up, right? Like, I actively avoid talking to anyone, but deep down, I feel this desperate need for someone to just get it, for someone to connect with. It's a total contradiction.\n\nI used to love music, movies, games, chess, photography, even nerding out on physics stuff. I poured my heart into building my dream PC once—it was a whole thing for me. But I didn’t abandon it because I moved or got busy. I lost all interest in it long before that. The passion just… died. And that scares me. Because these were things that used to define me. I don’t even recognize myself anymore.\n\nAnd oddly enough, when I’m around people physically, I can manage. I can keep myself composed. Those emotional waves don’t crash as hard. But the second I’m alone? It all comes back. Tenfold. That heavy chest feeling, the emptiness, the pressure behind my eyes like I’m about to cry without knowing why. But then, once I get through that wave, it feels like… I don’t know, like nothing happened. Like I was just being dramatic. Honestly, I was all teary when I started writing this post, and now by the end of it, I feel like this is such bullshit.\n\nI’ve never talked about this with anyone before. Not friends, not family, no one. But here I am, typing it to strangers, because what the fuck else can I do? I don’t think I’m suicidal, but the urge to escape is strong. Not to die, just to vanish. To press pause on everything for a while. To not have to pretend I’m okay, or be expected to function, or explain this invisible weight to anyone.\n\nAnd yeah, the idea of therapy crossed my mind. Mostly because that’s what people usually say helps. But honestly? I’m still pretty cynical about it. I’m not sure how talking to someone—someone I’m paying—is really supposed to help me understand something I can’t even put into words. Sure, I could ask my parents to help out, and they probably would without hesitation, even if I didn’t explain everything. But honestly? That conversation feels too heavy for me right now. I just don’t want to open that door—not yet.\nSo yeah. I’m stuck. I’m tired. I’m writing this because I don’t know where else to go.",
    "score": 2,
    "created_utc": 1746121384.0,
    "subreddit": "offmychest",
    "id": "1kceti2"
  },
  {
    "title": "(77m) My 79-year-old sister, whom I loved dearly, died two weeks ago after falling and breaking her hip. In spite of the love I felt for her, there's a very deep reservoir of anger intermixed with my grief. I'm angry because she allowed her only child to destroy her reasons for living.",
    "text": "Becky was always a caregiver. When I was little, it was up to her to watch over me while our parents both worked. Back in those days, few parents could afford to pay for childcare.\n\nAs I grew into adulthood, she was always the more responsible one. If I had a financial emergency, she was always there to help bail me out with a check. Later on in life, when I had become the more prosperous one, it was my turn to lend her a hand - which I did gladly. Over time, she became more than my sister - she was my best friend.\n\nShe had her only child, a daughter, relatively late in life. She was 42 when little Nancy was born. By then, I'd had three children of my own.  Almost from the start, it was clear that little Nancy was going to be spoiled rotten. Showered with 100% of her parent's attention and indulged in every way possible, she grew up to be entitled and irresponsible. In her parent's eyes, she could do no wrong.\n\nShe was 18 when she first became addicted to meth. Her addiction led her to cash a stolen, forged check for $500 at her parent's bank. Arrested and charged with a felony by day's end, Nancy's life of addiction related crime was just beginning. She spent the next thirty years in and out of jail and rehab. Moving from meth to heroin and finally Fentanyl. She had a daughter along the way - a daughter virtually raised by my sister because Nancy was too fucked up to deal.\n\nThe entire time, my sister could never bring herself to stop giving Nancy whatever Nancy demanded. Three years ago, as Nancy's father lay dying, my sister gave Nancy permission to move in with them. She needed Nancy's help and support. Nancy brought her boyfriend. At this time, both Nancy and the BF were hardcore Fentanyl addicts.\n\nWhile her dad was in his last days, Nancy and the BF were busily hauling off everything of value they could find and selling it for drug money. They broke into my sister's safe, stole all her cash, maxed out her credit cards to the tune of thirty grand using her stolen ID and emptied her savings account of $30,000. By the time my sister realized what had happened? Her husband was dead, and she was out $60,000.\n\nSo, why am I angry? I'm angry because she indulged her entitled daughter her entire life instead of saying no. I'm angry because she refused to turn her daughter in for the crimes she'd committed against her. I'm angry because I could never share my true feelings with her for fear of destroying our relationship.\n\nBecky told me that she was afraid that if her daughter was arrested, that she (Becky) would lose custody of her only granddaughter. The two junkies were allowed to continue living with her and preying on her - eating her food and taking her car without her permission. It took two more years and even worse carnage, and the loss of the granddaughter who was no longer in her custody,  before Nancy was finally forced to move out.\n\nThree years later? My sister wanted more than anything to die and be done with her life. I knew before she fell and broke her hip that her depression had reached the point that dying was the one thing she craved above all else. Two weeks ago, she got her wish. My wish for her, as the brother who loved her during her entire life, is that she refused to allow her daughter's addictions to destroy her own life. If she'd managed that? She might still be alive.\n\n\n\n\n\n",
    "score": 228,
    "created_utc": 1746028274.0,
    "subreddit": "offmychest",
    "id": "1kbjv05"
  },
  {
    "title": "I hate snark subreddits with all my heart",
    "text": "The amount of miserable people who take time out of their days to shit on other people’s lives is eye opening. Idgaf about influencers, but the way these psychopaths would talk about how miserable other people’s lives are or go way too deeply analyzing why someone is actually a bad person with nothing to back up their claims, all while being in a cesspool of racism, misogyny, and bullying is one of the most the most self-unaware things on the internet. They’re out here calling people wastes of Oxygen, and while I do think influencers are useless, they contribute more good to society than a snark frequenter ever will. All you do is instill insecurities in other people to feel better about your own. Fuck yall. ",
    "score": 43,
    "created_utc": 1746059889.0,
    "subreddit": "offmychest",
    "id": "1kbw0re"
  },
  {
    "title": "I want to go home",
    "text": "\n\nSo today at 2pm we went to my in law’s house to help her clean. She bad a major back surgery and can’t do a lot of stuff at the moment. My husband and my kid were there as well. So u was doing cleaning, i was vacuuming the floor and honestly it was dirty. \n\nAfter i was done I mopped the floor, my in law’s have comments about this being dirty or whatever even when i didnt even start the electric mop. I was already irked because it was not her only comment since i started cleaning. It felt like she thinks i dont know what i am doing. So anyway fast forward i was finally down to the last room and it’s her bedroom. \n\nFloor was dirty and her room has a door leading outside so she was sitting there outside next to her room window with my daughter and my husband pulling weeds. She said that it’s enough because it’s already clean. Now I don’t really like cleaning especially after having such a busy day, worked as kitchen help. (Story for another day) when i clean i make sure it’s clean, not clean-clean but proper clean. \n\nMy head is always all or nothing. I dont know why but this us how im wired. So i stopped mopping. The way i do it is vacuum-mop-let it dry-vacuum because after mopping there tends to be dirt left, just to make sure that it’s thoroughly clean. I appreciate tht after cleaning we are going out to eat, so in my mind okay… but then in law said we are gonna take a half an hour walk and no one is staying in the car. I am tired from work yesterday and I cleaned at her house and now apparently i am obliged to go walk with them, now my husband knows I don’t even like walking, it’s hot outside, humid and sticky. \n\nSo i said i am staying in the car and will just relax, my in law proceeded to say no one stays in the car everyone will go out and walk—- like excuse me i am 29 years old and i can decide if i want to or not. She then said but look at the view it’s wonderful blah blah and i still said the same thing. \nI came from a third world country and a very poor one at that so i think in her head i am very ignorant with a lot of things that are normal to her. \nBut i did know things and i had a decent job before i got married. \nAnyway now i feel like i soured the mood for dinner. I don’t feel okay now and just wants to go home but i need to stay because husband and kid is here waiting for food. \nRight now i dont even know what i am typing i feel that like it’s all over the place. ",
    "score": 3,
    "created_utc": 1746112347.0,
    "subreddit": "offmychest",
    "id": "1kcb5h7"
  },
  {
    "title": "I share every reel I enjoy to myself instead of friends, it’s become a bad habit",
    "text": "this is very redundant, but basically, you know how some people have friends that they can share reels to? well over time, my friendships have dwindled, probably because I was the only one considering them my friend. in any case, I made a fake account and when I feel compelled to share something with someone, I just share it again to myself. I think Instagram knows that I’m one of the top people interacting with the content that I come face-to-face with because not only do I like it, but I always share it, so I find myself getting a lot of videos by bigger content creators right when they’re posted because more than likely not only I’m going to like the post, but I’m gonna end up sharing it at least once.\n\nthis might seem like a stupid thing to make a whole post about, but I just feel like I can’t be the only one who’s doing this.. Is there anyone else out there who tries to mitigate their loneliness by pretending they’re actually sharing fun and cool stuff with other people?\n\ntldr; lonely af lol\n\n",
    "score": 3,
    "created_utc": 1746112194.0,
    "subreddit": "offmychest",
    "id": "1kcb37t"
  },
  {
    "title": "It’s very difficult for me to accept that no matter how much work I do nothing is ever promised",
    "text": "How can I be okay with the fact that no matter what you do wtv you want is never promised.\nI also have a dream of being a global pop star I’m obsessive wjth Beyoncé I get to work I’m learning how to dance, sing, musical production, doing theatre, plays, getting into acting to boost my career, but all this work could literally go in vain my dream isn’t promised and I’ve stopped working for jt because it’s so scary, expensive and time consuming. \n\nI’ve been struggling with everything but mostly with accepting that no matter how much you grow, work on yourself, be the best version of yourself you could possibly ever be, it doesn’t mean you’ll get a partner or anything you desire at all. And to me this is very painful because one day I want someone to have children with, share all types of yk personal stuff. And no matter what you do it doesn’t mean anything. But the point of this post, is that I’m looking for advice on how to keep going on with everything knowing this possibility, how can I be okay with this like actually happy with this, because I don’t wanna turn into those bitter women who are nasty, jealous, and hurtful to those who can get it. I wanna be okay with it no negativity in my heart at all just pure peace. \n\nI want love so much because it makes me feel seen, valued, worthy, appreciated and happy I’m full of love even in my darkest moments. I love children even tho I got a lot to work on before I get to that point. But children need mom and dad, like on a psychological level they do, they need both parents healthy and present. I don’t wanna be selfish and have a kid that doesn’t have a dad and long for one and it creates issues. It wouldn’t be right to bury my desire, or be ashamed of it. How can I deal with it and being okay, even if my friends have what I want still celebrate and support them.\nBtw guys I’m 16 and I’m still in highschool but this is eating me up \n\n\nThank you for reading, have a awesome day. ",
    "score": 2,
    "created_utc": 1746119604.0,
    "subreddit": "offmychest",
    "id": "1kce36k"
  },
  {
    "title": "Female Friend doesn't want me but wants to keep me close",
    "text": "This girl who I became really good friends and eventually developed feelings for kept giving me mixed signals that she also had feelings for me. She texted me every day, would FaceTime me for hours, sent me drunk texts saying she missed me and loved me, and got upset when I didn’t notice things about her. She even drove an hour one night at 2 a.m. just to sleep over and cuddle. All of that to say she didn’t want a relationship and that she basically didn’t like me. Maybe I’m crazy and totally misread things, and we were just close friends. Who knows at this point. But for anyone worried that she’s being manipulative (as I’ve been told by some), I cut her off recently. So now I’ve lost both my friend and my crush. I just wish I hadn’t caught feelings brah.",
    "score": 26,
    "created_utc": 1746069993.0,
    "subreddit": "offmychest",
    "id": "1kbz7iv"
  },
  {
    "title": "Not every cancer patient deserves a miracle.",
    "text": "I am a doctor who takes care of cancer patients. A lot of my patients either already have or turn to religion after their cancer diagnosis - they approach death largely (in my experience) in two different ways: the first say “I am going to be with God now- I have fought this cancer hard but  I have lived a good life and this is God’s will.”  These patients die peacefully- surrounded by family and friends on their own terms. \n\nThe others: “God will give me a miracle.” They will be actively dying in a hospital bed, and any intervention would be futile — and I mean ANY.. they are on death’s door- I have spent HOURS preparing them for this moment, we have exhausted EVERY avenue,.. but still they say “God will find a way, God will give me a miracle.” They leave this world kicking and screaming- traumatizing their family and the people around them, leaving behind a long trail of devastation, medical bills and financial confusion because they didn't think about getting their affairs in order in advance (even when being told to). \n\nLast week I had a patient and his family who had a stage IV cancer.  Halfway through his initial treatment he decided to stop for no reason, and didn’t come back. Six months later he came back with widely metastatic disease, weak, unable to eat, expecting a miracle from God. Well- if God exists- then God gave you that miracle in the form of upfront cancer treatment that could have significantly prolonged your life- even with a stage IV diagnosis.  And you ignored the call. In fact, the whole family did, and now are blaming the medical system for not being able to treat him because he is just too sick. \n\nLess than 100 years ago there was NO treatment for the disease you have, and now we have many lines of therapy that can prolong your life… but no.. that is not miracle enough. Somehow God giving us the science to understand cancer and help treat it for many people is just not miracle enough. God needs to give you your own miracle to treat only your cancer because for some reason you deserve that attention? No.. absolutely not. What makes you so deserving? Have you live an exemplary life in the service of others? Have you performed miracles for others?  Did you follow the exact teachings of the Bible (if that is your book of choice)? By what moral code did you live so perfectly that you now expect God to focus a miracle on you? Have you helped many hundreds of people? Have you helped even a few? I do not know. It does not matter. A miracle was offered to you… and you blew it. \n\nThere is only one group of people in my mind that truly deserve miracles- innocent children. . The rest of us? We live in too much sin. ",
    "score": 1885,
    "created_utc": 1745985448.0,
    "subreddit": "offmychest",
    "id": "1kb7g9b"
  },
  {
    "title": "I found out, via an Instagram post, that my maternal grandmother died. No one in my family has reached out to me to let me know. It's been 2 weeks.",
    "text": "To be fair, I'm (32m) estranged from most of my family, but I do still talk to my older sister (35f) and younger brother (29m). Albeit in a limited capacity, but we text often enough.\n\nI haven't spoken to my parents in almost 5 years. Our relationship has been... rough for the last 14 years. That's how long my wife (33f) and I have been together. I fought with my parents quite a bit early in me and my wife's relationship because my wife is black and my parents didn't like that too much. They cussed me out, cussed her out, called her every racial slur they could and eventually kicked me out of the house for standing up against them. \n\nThis caused my wife and I to move in together pretty quickly which led to us getting married very young. But honestly, I wouldn't change anything but the trauma we went through. My wife is my best friend and I don't know what I'd do without her and I'm confident she feels the same way. Later this year we will be celebrating our 14th wedding anniversary.\n\nFor the first few years after my wife and I moved in together, late 2011 to mid 2013, I didn't speak with my parents. It wasn't until my wife got pregnant in 2013 that we decided to let them know that they were going to be grandparents for the first time. We invited them to the baby shower, but my mom blew us off because she was attending the baby shower for one of her friends instead. We invited them to the hospital when my son was born. I remember them saying they were on the way, they only lived 20-30 minutes from the hospital. My FIL got there faster and he had a 6-hour drive, same with my MIL but in the opposite direction.\n\nWe tried to make a relationship with my parents work. We tried to attend family gatherings and dinners and holidays. But every interaction left a bad taste in our mouths and eventually we would just make excuses for why we couldn't go. \n\nAs our son got older, he was diagnosed with level 2 ASD at age 4 or 5. At this point he was completely non-verbal and only just getting the hang of using the toilet with quite a bit of assistance. Our son became the excuse to dip out early or to avoid events entirely. We didn't always lie to get out of stuff, but between the bad vibes involved with going to my parents' house and my son's unpredictable meltdowns, we'd rather just stay home most days. Why mess with our peace and my son's comfort? \n\nFast forward to the summer of 2020. Black Lives Matter protests are in full swing. My wife and I are in it. Attending protests, sharing information about how to be safe during protests and also arguing with people on the internet and sharing things related on social media. My mom decided that this would be a great time to say some racist things about the movement and then say that racism doesn't exist in the same breath. \n\nWhen we confronted her about it, bringing up the history we've had with her racism, she conveniently has a selective memory, says she doesn't remember saying any of the things she said to me or my wife. My dad defended her, my aunt (her sister) defended her, my younger sister (26f) defended her and even my former best friend who I considered an adopted brother defended her. I blocked all of them on Facebook, which is where most of this arguing took place, and I blocked their numbers. I deleted Facebook shortly after this as well.\n\nI blocked everyone in my family initially and only recently started talking with my older sister and younger brother within the last few years. So far, they have respected my wishes to not be involved with my parents or younger sister.\n\nI grew up most of my childhood at my paternal grandmother's house and was always around my dad's side of the family. Today, I still speak with my paternal grandma and my dad's sister. After my other grandma passed, I've been hesitant to call anyone but I'm compelled to call the one grandma I have left. \n\nI never really had a real relationship with my maternal grandmother. According to my mom, she didn't always get along with her. That, combined with her living in a different part of the country, didn't cultivate a strong foundation for a relationship. I could have tried harder to build a relationship but I didn't and now it's too late.\n\nMost of my memories as they relate to my grandma are negative because of what my mom has said about her. But as a kid, the few times I did meet her (could probably count on one hand the actual times I've seen her in my life), it was positive! She always sent me music related gifts for Christmas or my birthday. I'm a huge fan of rap music too this day and my grandma bought me my first ever rap album, BowWow's \"Unleashed\". I know, I know, gimme a break, I was 12. She also gave me my first radio to play my CDs on, which I still had when my wife and I moved in together. \n\nBut even these memories are sullied by my mom. The year I got that BowWow CD, we had actually went to grandma's house for Christmas, drove from LA to Missouri. As soon as we got back home, my mom took the CD and cracked it in half. \n\nI started using Instagram a few years ago to help promote a small business I started in 2023. When I downloaded the app, it had most of my Facebook friends already on there. To my surprise, this included people I had blocked on Facebook. As soon as I realized this, I blocked my parents and my sister. Didn't really care to block anyone else at the time, didn't seem worth the effort. What this meant was that I would still see posts from people like my mom's sister, I just wouldn't interact with them and just kinda lurk. Still, I don't use the app much these days. The business has always been a side hustle and I don't rely on it or push it nearly as much as I used to. \n\nI opened up Instagram a week or so ago to scroll out of boredom. The first thing I see is a post from my aunt. It was a recent photo of my grandma. She looked the same as I remembered her, but her hair was long and flowing to her shoulders. As a kid, when I had seen her, she always kept it very very short. It looked pretty. I don't open Instagram often, so this post was almost a week old. In the body of the post my aunt explains that her mom has passed after a battle with cancer, which they only found out about less than a month prior. \n\nI froze. I felt numb and in a way I still do. Maybe it's the lack of a relationship I had with her, or maybe it's the way I found out, or maybe it's anger at my mom for everything. It's probably all of it.\n\nI know that it's unfair to expect my brother or my sister to bear the responsibility of telling me when someone dies, but given the circumstances it is their responsibility. If the shoe was on the other foot, I know in my heart that I would have told them. \n\nSo yes, I blame them for not telling me. I blame my parents for being such shitty people that I can't have a normal relationship with them. If I had, then maybe I would have developed a relationship with my grandma. I'm angry at everyone and I don't know what to do. \n\nI tried to look up my grandma's obituary or funeral information but haven't come up with anything. She's been married and remarried a few times, and with how everything has been, I don't even know what her last name is anymore. I had 3 possible last names, but they all turned up nothing. I'm not even sure she lives in the same city I knew her to live in 20 years ago. She wasn't on social media at all. I'm heartbroken that this person that I didn't know, never had a chance to know, is gone and I can't even pay my respects without the possibility of facing people that I want nothing to do with. I'm afraid that they will make this about them if I reach out. That they will blame me for isolating myself for the last 5 years. I feel like a fucking teenager all over again and that's pissing me off too.\n\nI think I'm gonna call my other grandma. I know she doesn't have ties with my mom's family, she probably knows about my other grandma but I don't want this feeling of regret tied to her when she eventually goes. \n\nBefore I go, I want to address something before anyone else does. I recognize the irony that I'm angry with my mother for instilling a negative view of her mother onto me in my childhood. My mom is entitled to feel however she has felt about her mom, and I'm entitled to feel how I feel about mine.  Call it generational trauma, idgaf, I know damn well that I'm doing a better job at raising my child than my parents ever could and that's good enough for me.",
    "score": 2,
    "created_utc": 1746118649.0,
    "subreddit": "offmychest",
    "id": "1kcdpe9"
  },
  {
    "title": "Sometimes I feel lame cause I was a late bloomer as a teen",
    "text": "I’m now 20 and due to COVID, shyness, strict parents, and a drop of autism I was definitely a late bloomer. I had my first kiss at 14 ( or 9 if that actually counts playing house as a kid) and I had my first boyfriend freshman year too. But I wasn’t allowed to date so it was all sneaking around in the hallway and detention after school. During covid which was 15-17 pretty much I didn’t date at all and had like two friends. All the “dating” I did was online. So no dates, no parties, no drinking, no sex nothing\n\nI didn’t go on my first date until senior year and then I met my now boyfriend of 2 years after on SNAPCHAT. I wanted to lose my virginity to another virgin and we didn’t date until 5 months after we met so I was 18. I was upset he lost his vcard a few months before we met (at 17 so jealous of that) and we dated for like a year and a half before I lost my vcard right before I turned 20 once I gave up on my pipe dream. I love him and trust him so I figured I’m ahead of most people when it comes to losing their virginity and finally did at 19. I also started drinking at 19 which is still technically illegal and a teen but it’s still not a traditional teen drinking thing as I was legal in most countries AND my parents let me drink with them or on vacation at 18 so I had tried champagne and a pina colada already. They don’t know I drink with my boyfriend or at the one party I’ve been to this past year but it just feels so late. I wish I had more rebellious, cool teen years to look back on. ",
    "score": 3,
    "created_utc": 1746103585.0,
    "subreddit": "offmychest",
    "id": "1kc7uj0"
  },
  {
    "title": "I’m pursuing a career in mental health, but sometimes it feels like my own struggles hold me back.",
    "text": "I’ve always wanted to help others who are struggling with their mental health because I know what it feels like to feel completely lost in the dark. I’m currently studying psychology with a focus on addiction, working toward becoming a crisis/trauma counselor. But here’s the thing – every day, I still fight my own mental health battles. I struggle with anxiety, cPTSD, and depression.\n\n\n\nI often feel like a hypocrite, like who am I to guide someone through their pain when I’m still trying to figure out how to handle my own? But I also realize that my journey through these struggles gives me the empathy and understanding that I could never get from a textbook.\n\n\n\nI guess I just need to remind myself that healing doesn’t mean being perfect. Maybe part of my purpose is to show people that it’s okay to not have everything figured out, as long as you’re willing to keep trying and growing. Does anyone else here feel like they’re constantly trying to balance helping others while still needing to help themselves?",
    "score": 3,
    "created_utc": 1746103501.0,
    "subreddit": "offmychest",
    "id": "1kc7thy"
  },
  {
    "title": "I'm an awful friend and girlfriend",
    "text": "As the title says, I'm an awful friend and girlfriend.\n\nI never text back on time, rarely have time for meeting up my friends or going on dates with my boyfriend, and I am extremely bad at keeping any regular kind of social contact. I honestly don't know what's wrong with me and why it is so overwhelming, it just is. I constantly feel like I have thousands of things on my plate at any given time, and I constantly fail to prioritize the people around me, who I actually love!\n\nBut honestly, who believes me if I'm such an asshole, and is that even real love? I don't know what's wrong with me. I'm a grown ass adult at the age of 26, and I feel like I went back to being a teenager, feeling misunderstood and intellectually lonely. I cannot say that I am depressed because I still very much enjoy reading and writing, being exposed to new ideas, art and my cat's company, and I also enjoy spending time with my friends most of the time. I just somehow cannot manage it until it comes to that point, and I don't know why. I am just constantly socially exhausted and overwhelmed without even having much socializing, which is awful.\n\nI'm anxious that everyone around me will leave me one day, and yet cannot seem to do something that would prevent this.",
    "score": 3,
    "created_utc": 1746109059.0,
    "subreddit": "offmychest",
    "id": "1kc9uly"
  },
  {
    "title": "Need acknowledgment before I leave",
    "text": "I can’t do this anymore (31/F). No one will hire me. I apply for designer work every day and interviews never get past the 1st call. \n\nCredit cards are maxed and I don’t even have the money to file for bankruptcy.\n\nI’ve contacted my state’s job center support and still, I’m stuck here jobless. I lost my job at the end of last year and it was devastating, since I was promised to be moved into a full time role from my contract gig, especially after all the all-nighters, double-nighters, and TRIPLE NIGHTERS that I’ve pulled. My god, do I regret that now.\n\nMy life is a mistake, I shouldn’t have been born. I can’t handle the pressure anymore so I’ve been foraging for lethal/poisonous mushrooms in my area and putting together a farewell note.\n\nI just can’t see a way out and I can’t live with this shame and guilt of the pathetic person that I’ve become. My life won’t get better and there’s no way that I’ll pull myself out this time.",
    "score": 1,
    "created_utc": 1746130284.0,
    "subreddit": "offmychest",
    "id": "1kcid47"
  },
  {
    "title": "I miss intamacy",
    "text": "Ive been in amazing relationships with truly beautiful people but lately ive just hit a slump.  I was in a 3 year relationship with someone who i thought would be my forever and that just turned out to not be the case.  Ended up in several short unfulfilling relationships until i tried again with that person and we turned into the sterotypical toxic off and on relationship.   Even after all the hurt, and terrible shit i just wish it worked, because i dont feel a sense of connection with anyone else ive met.  Now I just feel doomed to a loveless life, ive tried dating apps on and off for the past 2 years and nothing ever went very far, some of the people i thought i would be most compatible with ended up living in other states (im on Long Island so Connecticut and New Jersey get included depending on how big you make your radius) and im an introvert so i dont like going out to bars or anything, i dont know what spaces i can go to to meet people.  At age 28 it kind of just feels like i am fucked.  And i just have this terrible yearning, wishing i could get the feeling of cuddling with someone who i feel vulnerable and trusting with, i want to go on dates, i want to share myself with someone but i cant find that person.\n\nIt almost feels pathetic, honestly it might be\n\nIve talked to some friends about this in the past and i get kind, affirming words. \"Youre good looking youll find someone\" but, i dont feel like i will, and when the night comes, and the loneliness hits, i wish i had something more than kind words to hold onto yk?\n\nThank you for reading",
    "score": 1,
    "created_utc": 1746130091.0,
    "subreddit": "offmychest",
    "id": "1kcia9k"
  },
  {
    "title": "I am too much for people",
    "text": "Hey \n\nSo, I am a parentified eldest daughter, fixer, counselor, electrician you name it and i can do it. People from all walks of life come to me, with their help I build them back up and then they leave. Recently had a potential partner encounter with a casual work friend of 6 years and that made me realize, I maybe too logical emotionally, I do listen to people rant for hours but i dont just let them be, I give them advice and help them build themselves back up too. Sometimes, when i care too much i push a little harder because i can see the potential they carry.\n\n  \nHe broke it off with me and immediately ran to his friend of 10 years to practically propose to her because she would just let him be. She let him grow on his on pace and that comfort made him choose her over me. Maybe that's why I am single, people who are attracted to me for being smart, comforting, intellectual when it comes to bringing those qualities home, i scare them. He kept saying \" He was scared of me\". Maybe i demand too much, i should stop trying to fix people and just let them be, I shouldnt break down everything for them so they can understand the root causes and then help themselves. \n\n  \nSo, nobody runs from me, maybe I am not a good listener or maybe i made them feel judged even though everyone says, I have gotten close to you in 3 months more than i am to my bff of 8-10 years. I couldn't have told her all of this etc etc but now all that feels like a lie.\n\n",
    "score": 1,
    "created_utc": 1746129872.0,
    "subreddit": "offmychest",
    "id": "1kci73g"
  },
  {
    "title": "I'm sending my dog over the Rainbow Bridge next week",
    "text": "I have to send my baby girl Mary over the rainbow bridge next week.\n\nI adopted her back in 2012. I was 21 and she was 2. I'm now 34 and she is 15. I tried my best to give her a wonderful life. The rescue group I adopted her from said they found her on the street. The moment I saw her picture on their website I knew she was coming home with me. It took her several weeks to warm up to me. For the first few weeks she would stay under the dining room table. I was starting to think I made a mistake because she wasn't coming out of her shell--not even a little bit. One night I was sitting out on the porch and I left the door open in case she wanted to come outside with me and she finally did.\n\nOne of my favorite memories was when I took her on a camping trip--it was more like glamping LOL. One of our friends had a camping spot along a river about 4 hours away from us. My friend's brother had a camper so we had a fan for our tent. We went hiking and floated the river on inner tubes. We had a blast.\n\nAnother time I had cut our yard and accidentally left the gate open. Normally she waits on the porch to come inside. After about 30 minutes, I noticed she wasn't waiting so I went looking for her. Y'all!!! I walked around the yard and found her waiting at the other door LOLOL.\n\nLast year during her annual vet visit, they advised me that \"comfort care\" would be on the horizon. We started Mary on low dose pain medicine for her arthritis.\n\nDuring this years annual visit, the vet said that she had lost some weight and wanted to X-Ray her and do bloodwork to see if something else was going on inside to cause the weight loss. Well, it turns out she has a big mass that is more than likely cancerous, her liver is failing, she is anemic, fluid is starting to build up around her heart, she has a 4/6 heart murmur, and her arthritis is pretty advanced. The doctor advised that I could take her to an out of town vet for an ultrasound and surgery on the mass but at 15 it's risky, plus with her other ailments--well I could extend her life but the quality of her life wouldn't be the best.\n\nOf course, I was a mess. I asked the doctor if I would be terrible if I took the rainbow bridge route as opposed to extending her life. She and the techs were so kind and understanding. I've been knowing this was coming but man it still hurts so bad. I'm cooking us some steak this weekend with extra butter and got her a cheeseburger with fries yesterday. I'm so sad y'all, I don't want to do this but I know it is the right thing to do. If you made it this far, thank you for reading <3.",
    "score": 1,
    "created_utc": 1746129837.0,
    "subreddit": "offmychest",
    "id": "1kci6lj"
  },
  {
    "title": "Weird kink",
    "text": "So I basically fantasize about being raped, and I genuinely can't help feeling aroused by the thought even though it definitely makes me feel disgusting.\n\nTwo days ago a friend confided in me about their abuse and I tried to comfort them about it but I just felt grossed out by myself the whole time. I'm aware of how horrible rape is and how it can mentally affect someone, so I don't know why my brain is messed up to the point I feel turned on by this. ",
    "score": 195,
    "created_utc": 1746026818.0,
    "subreddit": "offmychest",
    "id": "1kbja39"
  },
  {
    "title": "Raped by slightly older girl when I was a kid",
    "text": "So when I (19M) was 8 I was raped by a girl a little older than me. Here is the longer story. When I was in 2nd grade there was a girl I liked, but I didn't want to fumble it, so I thought \"let me try with another girl first and then try with her after\". So I told the girl who sat behind me, who didn't have many friends (I think she was 9 or 10), that I liked her (which was a lie) and if she wanted to \"go out\" or something. She said yes, I was quite popular in the class, so I did also expect her too. Anyways, a couple of days later we were at my house and in my room. She was like \"let's try something\" and I thought \"okay well she knows about relationships, so sure\". She and I then kissed, but not like a peck, no no no. It was french kissing with tongue. I will also clarify that I had 0 idea on what was actually happening as I was too young to know porn or stuff like that - I am guessing she wasn't. Anyways, after a while doing that, she then had me lay on my couch - again I am just following along and thinking that this is what you do. After I lay on the couch she grabs a blanket and throws it over my bottom half and asks me to take my pants off. Again I follow along. She then goes under the blanket and begins stroking my dick before giving me a bj. I was a bit weirded out by this and it did also feel wrong, but alas I let her continue. Don't remember what happened after this, but fast forward a couple of days and we are in my bedroom again. This time she says \"let's try something else\". She then jumps on my couch and pulls her pants down and tells me to do the same. I again follow along thinking that this is just what you do in a relationship. She then tells me to put my dick inside of her. All I can remember is that I try to do it in her ass, because I ain't even know that women had another hole at this point. Anyways, the next thing I can remember is me asking her if I should go down on her, since she did it to me (not exact wording of course). She says okay and pulls her pants down again (same day I think, but not 100% sure). I remember that there was a dust bunny (I think that is what it is called - english is not my first language) on her vagina and that put me off from doing it. Next I remember us being in her room and all we did there was kiss, this time just regular kisses. The last thing I remember is her showing me what porn was - which is actually where my addiction to that and masterbation started. Also I hadn't actually hit puberty at this point I don't think, so like my dick couldn't even get hard and I didn't actually have any \"extra\" feeling in it yet, from what I remember at least. Anyways, just wanted to write this down and sent it out to the world to tell someone I guess. Will also just say that I think these events have traumatised me a bit and I am actually really scared for when I am going to be with a girl. If anyones as any tips on how to actually deal with this I would greatly appreciate this. No one knows of this story, not my friends, my parents, no one.\n\nEdit: the reason I have told no one is because I am very embarrassed by all of this. I think because I feel that it is my ow fault, you know because I did ask her without really wanting to be with her",
    "score": 24,
    "created_utc": 1746066641.0,
    "subreddit": "offmychest",
    "id": "1kby780"
  },
  {
    "title": "I feel like a failure",
    "text": "I just turned 21 and I’m currently studying at a college in Australia.This is where I do a degree then transition onto second year at a university of my choice.  I chose to do this after I took a gap year to really look at all the different options and opportunities out there.\n\nCurrently, I feel as though i’m not as smart as I thought as I just received my results for quiz I thought I did well on but turns out I failed which really sucks becasue I put a lot of effort into preparing for it. So far this has happened 3 times as of now and If I fail 2 more assignments/ tests/ quizzes I will get kicked out of school due to poor performance.\n\nI feel as though I put so much effort into studying and learning about the content to cope with this but whenever I do a quiz in this specific class I do terrible even though I thought I did well. This honestly makes me feel so dumb and makes me feel like I won’t achieve any of my goals which in turn really makes me feel like a failure.\n\nAll my friends that I study with get such good grades which really makes me think about how dumb I am which really sucks because I always study with them to make sure i’m understanding the topic. But the main thing I’m worried about right now is getting kicked out of school. If I end up repeating this pattern then my career goals are over and I will end up being a failure.\n\nI have no idea what to do to improve and i’m in desperate need of help.",
    "score": 4,
    "created_utc": 1746101969.0,
    "subreddit": "offmychest",
    "id": "1kc7bu6"
  },
  {
    "title": "Everything always fall apart",
    "text": "And I am the instructor for my own class.\nA class of pain. \n\nWhy do I push him away? \nWhy does it hurt to be close to him? \nWhy does everything feel so hopeless? \nWhen will I finally say enough? \nWhen will I put my instruments down and rest? \n\nBeen thinking about my ex that I also pushed away. \nPushing my bf away currently and have been for months, citing that I can't get his (exes) face out of my head. I've never lied to him not once. \nAt what point is the pain too great? Both the kind inflicted on myself and on others unintentionally. \n\n\nThere is more way to torture someone, and I am the master of my own demise.\n\n",
    "score": 1,
    "created_utc": 1746128962.0,
    "subreddit": "offmychest",
    "id": "1kchu2h"
  },
  {
    "title": "I found messages showing my partner cheated on me",
    "text": "Sorry if this is long.\n\nMy partner and I have been dating for a year and a half, and the other day I decided to follow my gut instincts and check a chat he had whilst he was working. When I first saw the name of the person a few months ago, something felt off, but I decided to ignore it since I have mental health issues and do jump to conclusions easily. I, however, couldn't forget about it, so to ease my mind, I looked and found sexual texts between him and another woman starting from December last year to just a few weeks ago. Honestly, I was crushed. Before seeing this, I had no reason to believe it was something he was doing. He never hid his phone from me or guarded it at all, he let me use his pc whenever as well. \n\nWhen he got home, I tried subtly mentioning that I knew something in hopes he would realise and come clean, but he didn't. He didn't even seem fazed by what we were talking about. He said he had no secrets to hide from me and even joked that if there was anything, then he knew I would find it eventually. Nothing about how he was acting or talking seemed like he'd been caught or did anything wrong. \n\nI am choosing to stay with him even after finding this because I love him, I just don't know how to confront him about it. I want to find a way to talk to him about it without seeming hostile or too strong about it, as I just want to get the truth out of him. I've spoken to some friends and they say I'm making the wrong choice, which I may be, but it's what I want to do. I just need some unbiased opinions on the matter and some help on how to start the conversation. \n\nThanks for taking the time to read ",
    "score": 4,
    "created_utc": 1746097222.0,
    "subreddit": "offmychest",
    "id": "1kc5wxm"
  },
  {
    "title": "I have no clue what to do?!?",
    "text": "Hi so I (18M) and my gf (18F) are really happy together, she’s the most amazing person I have ever met. However, she gets very cut off whenever she’s under extreme stress and she is at the moment. This is just the way she is and I can sometimes get lonely when she goes into this mode, she tries her best to make an effort and stuff but I still sometimes feel a bit alone. I don’t really have any friends outside of her so I end up keeping to myself until she is able to reply. But recently I’ve been just scrolling on instagram and stuff and come across one of her long term friends and I go in their page. Seeing photos of my girlfriend super happy and out with her friends it just makes me super sad because she’s not feeling good at the moment, I also don’t know if it’s me being a bit jealous at the fact that she isn’t like that whenever we are hanging out at the moment?? I just want her to feel okay, she puts in so much work but she never feels it’s enough?! I hate seeing her upset like this. Sorry if this didn’t fully make sense, I kinda just yapped but long story short. My girlfriend is really stressed, sad and distant at the moment, she’s super autistic and it’s how she functions. It’s left me feeling sad and a little alone.\n\nThanks if you read all of this :) ",
    "score": 1,
    "created_utc": 1746128665.0,
    "subreddit": "offmychest",
    "id": "1kchpy7"
  },
  {
    "title": "Please i just wanna breathe",
    "text": "Im so annoyed and i wanna cry, i wish i vould just breathe like a normal person, i genuinely feel like im going to faint if theres not a CONSTANT airflow or if like something is slightly covering my face i get so dizzy and shit my legs give in\n\nCan i just function like a normal person without feeling like a pug?? Im stressed outta my mind bc even when im OUTSIDE IN THE WIND i cant breathe, its like im just not getting enough air and it freaks me out, its been like this for a while but its seriously getting problematic, not to mention its EMBARRASSING to be WHEEZING in public trying to breathe and you could like hear me from across the damn road \n\nLike\n\nWhat the fuck man",
    "score": 3,
    "created_utc": 1746107120.0,
    "subreddit": "offmychest",
    "id": "1kc93t4"
  },
  {
    "title": "How do people find love?",
    "text": "Do you decide with a friend you want to experience love?\n\nI don't know who to be friends with due to having alexythmia and autism.\n",
    "score": 0,
    "created_utc": 1746128444.0,
    "subreddit": "offmychest",
    "id": "1kchmv6"
  },
  {
    "title": "Tired, so tired",
    "text": "Hi all, I hope you are hanging in there. I'm sure several if not the majority of people can relate to this on some level.\n\nI'm so freaking tired. So overwhelmed. All the time. Always playing catch up on things to get done, always behind, always not able to get enough done. Life goes so fast and like everyone I just need a break. There's always something going on, even on the good days. Even when I would consider I'm having a good day, if I think about it, I feel like total shit and like I can't keep up. On bad days I'm drowning in things I can't get done and things I never have time for that I want to do but never feel good enough to do. I'm tired of being sick, tired of being tired, and tired of never having any time where I don't feel this way. \n\nI'm in graduate school, been trying to get through it, but I have several chronic health conditions that keep getting in the way. My autoimmune diseases seem like they are always flaring at the most inconvenient times, even my nuisance conditions that shouldn't cause problems too severe are making it hard to get done daily tasks like simply standing some days. I'm struggling on how to navigate professional life, and life in general when I'm always so fucking exhausted and everything is always going nonstop. Should probably add that I have ADHD too. So the brain fog is wild sometimes. Like if I could just function at even part of what I should be able to, if if my brain and body would cooperate even 10% more, I feel like it would be life changing. \n\nI've always been an optimist and a people pleaser and never really realize how awful I feel unless I let myself think about it. I go and go and then suddenly the world is falling apart because I pushed too hard and can't keep up. I've gotten better at that somewhat, but I realized today that part of the problem I think is that I never really tell people how I truly feel. I've spent at least half of my life telling people I'm doing okay when they ask, even when I'm not (unless it's at a doctors office). I've gotten to the point where I now say \"I'm hanging in\" or \"I'm here\" rather than saying I'm okay, but in reality, I need to tell someone that I'm not fucking okay. Not at all. \n\nDon't worry, mental health wise I'm actually okay. There is no risk I'm going to do anything dangerous, or stupid, or anything concerning. I just need to be honest with someone about how I feel without worrying how they will take it, if I'm unloading too much, or if its going to stress them out. \n\nPeople often ask how you are to be polite. It's a social convention, but most of the time, people don't really want to hear how you're doing. Then to make it worse, the ones who do want to hear how you are actually doing are the people who you don't want to upset and worry. The people you love and who care about you are the ones you try to put on a brave face for, and the strangers and acquaintances who don't care likely won't take well to you having a breakdown on them. Then there's the people you open up to, the ones who you thought can handle it, but sometimes it's too much for them and they pull away and that support is gone. You don't want to be too much, you don't want to be the person who complains about their life or how they feel, you don't want to overwhelm others or make them worry... so you say you're okay. You say you're hanging in there. When really you want to break down in tears and let yourself have the existential crisis that has been pushing on the back of your mind for months or years. \n\nI have a psychiatrist and psychologist. I adore them both. The psychiatrist can't do anything to help because I'm too scared to change my medication to see if it helps my brain work better as I don't want to loose how well my current meds work. My psychologist is the absolute sweetest and I've been with her for so long that now I worry about causing her stress (I know burnout in psych is a big thing, and I'm sure it must be difficult not to take work home with you). Plus, each of our appointments is just me updating her on the latest craziness and chaos, we never even get to do much therapy, it's 75-90% here's what has happened since our last visit. This realization I had is definitely something I'm going to bring up with her next visit though.\n\nThankfully I have my significant other who is there for me when I have meltdowns, and my parents and brother sometimes too. I just don't want to worry them. Especially when I know they already worry so much...\n\nI also feel like things could be so much worse, so it's really not that bad. I'll be struggling but think \"oh, this isn't as bad as that one time you...\". It can be hard to properly explain to people how awful you feel when you still feel so much better than you've felt previously. When you feel like you've been hit by a truck and have the flu, and every time you move you're muscles it burns like you've worked out for days, but at least you're not having to go to the ER, so you're doing better you guess. Like if people ask how you are in that context, what are you supposed to say? I'm doing better but I still feel like death warmed over? That's not a socially acceptable answer, and people won't know how to respond to that, and it will be awkward. So you say you're hanging in, better than you were, or you're managing. But that's not the full truth, and most people don't want to hear it or don't handle hearing it well.  \n\nI feel like if I told people about how I'm truly feeling though it would help with self awareness. I have difficulty knowing when I'm pushing it too hard, and when to ask for help. I'm starting to think it's because I've spent so long putting on a mask for other people that I forget to take it off and check in with myself. I don't know how to know when it's okay to be honest with people though, or who can handle it. I need to start journaling or something, but my ADHD brain never gets me past the first like two or three days. Plus I'm too exhausted and that would be one more thing on my list that adds the the weight. Maybe I just need to periodically come on Reddit and let the world know I'm a mess to get it off my chest 😅. \n\nAnyway, who else is fucking exhausted and overwhelmed and feels like it never ends?",
    "score": 2,
    "created_utc": 1746114731.0,
    "subreddit": "offmychest",
    "id": "1kcc475"
  },
  {
    "title": "I have to break my first loves heart tonight.",
    "text": "I will keep this as brief as possible, I am in the middle of work and dying from anxiety here. \n\nApologies for formatting and spelling, I’m on mobile!\n\n I (20f) dated my Ex (24m) for 2 years officially, but talked exclusively for about 2 years before that. (Yes I know illegal and wrong.) We lived together, had pets together and did everything together. We ended up breaking up last year and I moved away in October. Since then he has disrespected my wishes for no contact and continues to try and reach me. I still have love for him and want him to be happy. But I feel like I have realized I don’t want to go back. Even though we were happy overall, there were so many little betrayals that drove me crazy over the years. he is a good man, we have similar life goals and honestly were best friends. \n\nAfter a few weeks of going back and forth and no contact failing. I told him we would have a final phone call tonight. I just need to know that leaving him behind is okay. even though over all we could have worked. The way the little things made me feel, I need reassurance that it’s enough for me to move on with my life. I am carrying so much guilt and I just don’t know how to proceed. Any advice on how to explain this gently would also be appreciated. ",
    "score": 0,
    "created_utc": 1746128210.0,
    "subreddit": "offmychest",
    "id": "1kchjkp"
  },
  {
    "title": "Update: Reddit was by Right (Deleted Post)",
    "text": "Reddit was right 😐😐😐: An update from a deleted post from a different channel\n\nLast March/April I wrote a post about one of “friend’s” boyfriend saying the n-word in front of me. \n\nI deleted the post because of a few reasons (a lot of commenters were disparaging and undermining my blackness) BUT that thread was right about one thing: I should have dropped the friend.\n\nAfter the situation, I simply stopped talking to her and it lasted for three weeks. She managed to catch me heading to my dorm room (next door neighbors) and gave a half-ass apology and of course, was crying during the whole ordeal. She even said she’d get her bf to apologize, he never did.\n\nI thought I was being the bigger person but “accepting” the apology and simply just be an arms-distance from her in terms of friendship.\n\nFast forward to today, ANOTHER incident in my friend group led to her trying to state I was wrong in this situation.\n\nTL:DR I told a roommate of racist friend to leave a birthday party for my roommate (in a respectful way of course). This uninvited person has talked behind birthday girl’s back for months and thought she roofied people, hence why I uninvited her.\n\nY’all were right, she was weird and I should have stopped being friends with her.\n\nIf it makes anyone feel better, a very…public shading and videos about anti-racism implying her have been made. And many people that I know and even old friends from my HBCU are supporting me.\n\nI’m sad because people that I thought were my friends, weren’t. They were okay with hanging out with someone they didn’t like because they thought they were “keeping the peace.” \n\nLong story short: If a friend shows you a red flag, RUN!\n\nI can write a whole other post about the situation if needed.",
    "score": 2,
    "created_utc": 1746114600.0,
    "subreddit": "offmychest",
    "id": "1kcc2c0"
  },
  {
    "title": "My best friend (F27) is experiencing her first relationship while I (F27) am healing from heartbreak and still waiting",
    "text": "As you can see, we’re both late bloomers and never had any experiences with guys. While I have many platonic guy friends and generally meet new people more frequently than her, it has never worked out for me. I have pretty high standards and terribly bad luck so far. So the few times I have dated, it ended up with them choosing someone else over me or it was the right person but wrong time.\n\nActually, I am right now healing from the worst heartbreak of my life from a guy I really thought it would finally work out with. Only for him to casually mention his girlfriend after the 3 months we’ve been seeing each other.\n\nI know it sucks and life is unfair and I feel miserable right now as the wound is still fresh. At the same time, my best friend is getting into her first relationship and currently experiencing all her firsts. As much as I’d like to be happy for her, I just don’t have it in myself to not be jealous because it stings so much and of course instantly reminds me of my own misery. We are both very aware of that and it has just become a kind of taboo topic we don’t talk about, even though I’m sure she’d love to tell me about all these exciting things she is experiencing with him, as best friends would do.",
    "score": 1,
    "created_utc": 1746128126.0,
    "subreddit": "offmychest",
    "id": "1kchiek"
  },
  {
    "title": "I [21F] am in an unhealthy friendship with my [20F] friend",
    "text": "TW: severe mental health problems, depression, brief mentions of suicidal ideation and attempts. \n\nThis story is quite vague because people I know have Reddit. I also ask that if any YouTube channel sees this, please do not read it to your audience. \n\nSo I met this girl named Shayla when we were both in high school. We bonded over a shared interest in a pretty niche anime.\n\nBefore I start this post, I need to make you understand why I am friends with Shayla. She is funny, she listens to my petty drama and stupid issues, and when we met, we had shared hobbies. She is a sweet girl. \n\nThere is some other, harder to talk about context needed as well. It became pretty apparently early on in our friendship that due to terrible, abusive parents and other factors outside of her control, that Shayla is deeply depressed and suicidal. \n\nNow, for what I meant by unhealthy:\n\nWithin a few months of being friends, she started texting me at odd times of the day some really horrible things regarding her mental state. I, at the time, would spend basically one night a week talking her down from the edge. I know now that this is unhealthy for my mental health and should not be my responsibility. Even then I knew that, but I was afraid of what would happen if I didn’t do it. I used to be afraid that if I didn’t answer my phone in the night that I would wake up the next morning and find out that she is dead. \n\nI won’t go into much detail on this one, but the messages stopped about a year into our friendship. There was an incident that involved Shayla and the police that ended in my friend in the hospital and me sobbing hysterically in the hallway of my apartment building. After the incident, the depressive spirals to me over message stopped. She said that she felt remorseful for how she handled things and promised me that she would stop putting so much on me. I believed her and we moved on. \n\nAgain, I won’t go into much detail, to protect our privacy, but things have gotten better and so much worse for Shayla since then. Her behavior has changed to reflect that. Over the last few years, either due to the depression or her family, she hasn’t done much to help her mental health. She is not employed, she is not in college, she has a therapist, but she doesn’t trust her. Beyond that, she shows little effort towards doing something about this. \n\nShayla has started texting me in the middle of the night again, but this time it’s different. I’m becoming apathetic in a way that scares me. \nI found an article about empathy sickness not too long ago and I almost cried because it sounded so much like what I have become. I don’t want to be numb, but at this point I’m a little scared of what will happen to me if I’m not. \n\nAlso, maybe because of that apathy, I’m starting to realize other things about our friendship. I’ve also started to notice some behaviors when we are together that are very manipulative. \n\n1. She often uses threats of bad behavior to get her way. Usually it’s small, childish behavior, but sometimes it’s something bigger and related to her mental health. Think threatening not going to her therapy appointment if I don’t text her later. \n2. She uses guilt trips. Sometimes she will bring up her suicide attempts as a way to get me to tell her things or do something she wants.\n3. She love bombs me. She has told me repeatedly that I am the reason she is still alive. Her family has also pulled this one on me. \n4. She uses her previously ended friendships and trust issues against me. This goes with the love bombing in a way. She talks about how I am the only one she trusts won’t leave her. \n5. She expects me to take care of her in some ways. When we go out, there is an expectation that I am the one paying for things. She treats me like a surrogate mom in other ways. She once fully said “you know you’re basically my mom,” before I shut her down on that. \n6. Her abusive family members are starting to expect me to save her. They see me as a good influence. Her mom has called me to try to convince her of things before. Her dad tries to get me to side with him on an arguments. \n7. She hasn’t learned. She says she’ll stop but she’s begun to tell me things that she really should tell her therapist and not me again. I can’t help her. There is nothing I can do and it all leaves me feeling helpless because I want her to feel better but there is nothing I can do. \n8. I don’t see a good end to this. She isn’t seeking proper help anymore. I don’t know what I can do. \n\nSo I’ve realize that this isn’t healthy. I know that this is not good for my mental health, but now I don’t know what to do. The thing is, she has shown potential to change and it leaves me conflicted. I once brought up one of these issues to her and she has made progress towards stopping the behavior after some argument over it. But the thing is that she sometimes tries to weasel through loopholes to get around it and I am scared that this will be like the messages and that if I don’t strictly enforce it, the behavior will come back. \nOn top of that, I fully and truly believe (not because Shayla has told me this) that if I leave her she will try to kill herself again. I don’t know if she will stop if I point out her behavior. She’s not doing this on purpose, but also even if we get into a small argument she sulks and ends our friendship over text and then comes back not long after. I don’t want to suffer in silence anymore but I don’t know what to do. I just wish that I could make her happy. ",
    "score": 1,
    "created_utc": 1746127827.0,
    "subreddit": "offmychest",
    "id": "1kche7p"
  },
  {
    "title": "My best friend hates because of Tinder",
    "text": "Am I in the wrong?\n\nI've known my best friend for around 10 years, we met when we were a part of a dance studio. We've traveled together and we talk to each other everyday. I love her and she is my only girl friend. \n\nOver a year ago she got out of a 4 year relationship, I supported her from the get-go. The middle of last year she started using dating apps and started talking to men. She would confide in me and I would give her advice, literally always on her side. My best friend started dating this guy about 3 months ago after talking for around 2 months. She told me he would be moving away in October but she was okay with the idea of long-distance as she's working in healthcare and will be in nursing school. I've never met the boyfriend, I've only ever spoken a few sentences to him while she was on the phone with me. The boyfriend just took her on an out-of-state road trip vacation with his group of friends, I was happy for her. \n\nA part of the boyfriend's friend group is a high school bully of mine. I told my best friend about it and she kind of remembered some of my experiences, I told her not to mention me at all during her trip. My anxiety and paranoia was getting the best of me while she was on her trip, I pictured her having the time of her life with someone that made me feel miserable and invalidated my experiences. \n\nWhen my best friend got back, she made jokes about being friends with my bully and while she was showing me pictures of the trip there were so many of just my best friend and my high school bully. From then, I was somewhat upset with her, I tried not to show it. I know I can't be angry with her because she can be friends with whoever the hell she wants BUT it still hurts. \n\nAbout 4 days after her trip she tried to call me at work, I started texting her and she told me that they broke up. I said he was a douchebag for doing that. She responded by saying that it wasn't like that, I told her I'm at work and I don't really know what else to say, he was a douchebag for that. Later that night I texted her saying I was there for her. She never responded. 2 days go by and I texted her saying I wanted to talk about whatever is going on, she proceeded to send me 2 long texts saying that she doesn't want to talk and I'm insensitive, I'm not there for her, and I'm not being genuine. This really hurt, I texted her saying I don't want to text about it, I'd rather call. A week later she actually decided to answer my call and we talked on the phone, she was being extremely defensive for the first half of the call. I apologized to her and told her I know I didn't say the right thing. We started bickering a little bit until my boyfriend interjected and mediated it. The call ended by her saying that she will reach out and tell me what happened when she's ready, she told me that she is not ignoring me to hurt me.\n\nAt this point, she is. It's been a month. I have periodically texted her and have been trying checking in with her, she has been radio silent. She has been posting on Instagram with other friends and is actively on her phone. \n\nShe has never done this to me before, we've never really been in a fight. I'm 22 and I'm getting to the point where I don't want to play a cat-and-mouse childish game of ignoring each other. I'm really hurt by her and everyday I'm waiting for her to reply. I'm going through a weird stage of grief where I want to slap her but I also miss spending time with her. I'm not sure if I'm willing to be her friend anymore after this and I can't stop thinking about, it's basically killing me at this point.\n\nOnce again, am I in the wrong?",
    "score": 2,
    "created_utc": 1746114092.0,
    "subreddit": "offmychest",
    "id": "1kcbv3n"
  },
  {
    "title": "My adult son keeps making threats, and I’m at a loss",
    "text": "I'm not sure what I'm looking for, maybe support, maybe advice.\n\nMy adult son has a serious issue. He keeps making threats in writing. They're not things he ever intends to follow through on, but that doesn't make them any less serious. He's already been involved with the police and courts. He has had no-contact orders (and has violated them), has been on probation, and has spent time in lockup. He's managed to avoid actual jail time so far, though I don't know if that streak will last much longer.\n\nJust today, I got a call that he’s been picked up again for making a threat, apparently against someone he doesn’t even know. It may have been online, but I don’t have any details. Yes, I pay for his legal representation because I want him to have a fair chance in the system. But none of the seriousness is getting through to him.\n\nThe thing is, outside of this one huge and destructive issue, he’s actually a decent person. He lives at home, has always held a steady job, doesn’t do drugs, and doesn’t drink much. He’s had therapy and takes medication, although not always consistently. He’s been diagnosed with ADHD and depression. He was in special education growing up, but the only formal diagnoses were developmental delay and ADHD.\n\nIn many ways, he’s still like a child: immature, impulsive, and unable to fully grasp consequences (obviously!) But because he's an adult, I often don’t know what’s going on day to day until everything blows up. I try to stay out of his business unless he asks for help, but then the damage is already done.\n\nI feel helpless watching him self-destruct and worried sick that one day the legal system is going to finally lose patience. And even then, I don't think jail or more probation is going to fix what ever is broken in him.\n\nIf you’ve been through anything like this, I’d really appreciate hearing about your experience. Even if you haven’t, thanks for reading. It means something just to put this in wiring ",
    "score": 1,
    "created_utc": 1746127635.0,
    "subreddit": "offmychest",
    "id": "1kchbg4"
  },
  {
    "title": "I'm scared of my mom",
    "text": "(Before I get into anything this is my first post on Reddit and I don't post on any socials)\n\nSo this all started a few weeks ago where I was at my grams house and we for some reason were talking about trans people. At that time I knew that I was trans (I'm 15 and  mtf) and my mom was talking about how she hated that people were altering their bodies. (This isn't exactly what she said but it's close to what she said) Since she said that I've been scared of coming out to her and I'm scared to even be in my own home. Recently either yesterday or the day before me and my mom were talking about something unrelated and we eventually started talking about discord and she then asked why I had She/Her pronouns in my bio and I just started to freak out. I told her that it was just for online anonymity but she replied with \"but you're not!\" And then I just repeated myself and run upstairs to my room. I'm scared of my mom and I don't know how to come out to her without anything bad happening to me.",
    "score": 2,
    "created_utc": 1746114050.0,
    "subreddit": "offmychest",
    "id": "1kcbugf"
  },
  {
    "title": "My sister in law gave my daughter a camera that had a nude pic saved on it",
    "text": "X Post from another sub, just looking to see other people's thoughts. \n\n\nI do want to give a bit of background here first, because I think some of what I'm feeling is due to the fact that my sister-in-law (SiL) has already crossed a few boundaries with us in the past couple weeks. Heads up, this is gonna be long.\n\n\nLet me start by saying that my wife and I are fairly religious. I like to think that I'm not too big of a prude, and many of my friends have said that I'm not super judgmental of their life choices as long as they respect mine. My SiL (wife's younger sister) was raised in the same tradition, though she is atheist today (she says that she's experimenting with Wicca and uses tarot cards, crystals, and manifestation). I'm totally fine with this, to each your own, I just asked that when she's in our house she be respectful of our practices and be considerate how she discusses her beliefs vs ours in front of the kids etc.\n\n\nOne thing I will also add, over the last year or so, SiL and her husband (BiL) have decided to have an open relationship and are currently in a poly relationship with another married couple. Again, I'm not here to yuck her yum, they're all adults and can make their own choices. However, two weekends ago she came to visit with her husband the the female counterpart of their companion couple (I'll call her Stacy because it's not her name). We said that we will treat everyone respectfully, but we did ask that they avoid engaging in PDA with Stacy in front of our kids. My kids are aged 7, 5, and 2, and we would rather have those conversations with them when we feel ready to have those conversations with them and feel like they are ready to understand. Not that I want to completely shelter my kids, and I would ultimately prefer them to make their own informed choices regarding God and life, etc, but I do think that 7 and 5 is still a little young for certain conversations.\n\n\nAnyway, on Easter, when they were in town, my wife asked that they do not come over. We live in a state where recreational cannabis is legal, while they do not, so they had told us that on Easter (being 4/20) they were gonna be blazing the whole day. I don't really mind being around drink and high people generally, but my wife has had some really negative interactions with her sister while sister was high, and she doesn't like to see her in that condition. SiL agreed and said that she'll just come see us on Monday instead. Well, she ends up showing up unannounced to surprise us, but she was basically sober so w/e. Couple hours later tho, and BiL and Stacy show up (also completely unannounced) and walk right in, with his arm around Stacy's waist and they're both completely wasted. They didn't stick around long, but my wife still felt pretty betrayed. Two days later, we had all three over for dinner. They were much more respectful regarding PDA, BUT they kept calling each other babe and honey etc. throughout the meal. In both of these situations, it's like a boundary was clearly set, and while it wasn't technically crossed, it was definitely pushed.\n\n\nSo that's the background (I can definitely add more details/history if requested, but that should give you a rough idea).\n\n\nOn Christmas, SiL gave my 5 y.o. daughter a kid camera. It's a cute device that prints a little B/W copy of the pic and saves a digital copy you can download later, plus it's got a couple games. It's on Amazon for like 30 bucks. So today, my wife is driving the kids to the post office after work, and she hears in the back seat, \"[Older sister], I don't really like this boobs picture.\" My wife takes the camera, and, lo and behold, there's a selfie of SiL and Stacy, naked, boobs touching, full boob including nips clearly visible. I poke around the device's memory, and it seems that they took that and a few other photos prior to wrapping it up for Christmas. It just feels like she doesn't care. I mean, I know it was an accident, but why wouldn't you double check to delete it before giving it to a child? It all just feels so inward focused and self countered without thinking of how her actions affect others. \n\n\nAnyway, my wife was ticked. We had a long conversation with my daughter about not letting people take pictures of you naked and not letting people show you pictures of themselves naked etc. My wife wanted to call SiL right then, and I encouraged her to calm down first. Eventually, my wife sent her a text saying, hey, this happened, please be careful what you give to my kids in the future. SiL responded: \"Oh my gosh I am so sorry, I didn't realize it had digital storage!!! That is so unacceptable I'm sorry this was a really bad accident, I will make sure it doesn't happen again\" This is frankly hard to believe, as she SHOWED us the features of the camera (including the digital storage) when my daughter opened it. Either way, we're both still upset.\n\n\nI don't really know what I'm looking for posting this. It's like somewhere between a rant, an \"am I the jerk,\" and a little bit just seeking validation and vindication on my feelings and response here. I guess the biggest thing is probably just wanting an anonymous platform to air my frustration, so if nothing else, ty for listening to my rant.\n\n\nEither way, I'm curious to hear other people's thoughts and responses to this situation. Sorry it got so wordy.",
    "score": 0,
    "created_utc": 1746127419.0,
    "subreddit": "offmychest",
    "id": "1kch8fq"
  },
  {
    "title": "I hate my self",
    "text": "Any time I make a mistake I overanalyze it and always end up punishing my self im socially inept and I cant really figure stuff out. All these mistakes I make I can never just let go. It can be a small mistake and I just think im the biggest fuck up.",
    "score": 1,
    "created_utc": 1746127300.0,
    "subreddit": "offmychest",
    "id": "1kch6rx"
  },
  {
    "title": "I am girl (19) and my boyfriend (24) doesn't appreciate or care about my jokes",
    "text": "We have been together for about 2 months now and I have had it. I am done telling banger-level jokes to this man only for him to blink at me like I just farted in Latin. I’m 19. He’s 24. Which means he’s had FIVE extra years on this Earth to develop a sense of humor and yet somehow he managed to dodge all the jokes, memes, joy, and serotonin life had to offer. Evolution really dropped the ball with him.\n\nI could say, “Hey babe, what do you call cheese that isn’t yours?” and this man would stare at me like I just declared war on dairy. Not a chuckle. Not even a pity smirk. One time I made a perfectly timed sarcastic remark and he LITERALLY went, “Huh?” and checked his phone. Bro. I just delivered Oscar-worthy wit and you’re scrolling *LinkedIn*??\n\nHe’ll watch a guy get hit in the nuts with a shovel on YouTube and laugh like he just heard George Carlin reincarnated, but if *I* make a clever pun, he looks at me like I committed a crime against comedy. I’m not asking for a standing ovation — just *react*, dude. Pretend you have a pulse.\n\nThe worst part? I’m hilarious. My friends, my mother, my gay brother and his even-more-gay boyfriend seem to think I am funny. But him? I could dress up as a clown, juggle flaming chainsaws, and recite a Shakespearean roast of Elon Musk, and he’d just blink twice and say, “You done?”\n\nSo yeah. Maybe I should start charging this man for my daily performances. Or just date someone who thinks humor is sexy and not some evolutionary defect to be squashed out of existence.\n\nAnyway. Thanks for listening. Hope *you* laughed, unlike my boyfriend, whose soul was apparently forged in a humorless void.\n\n**TL;DR:** My boyfriend never laughs at my jokes or even acknowledges them, and it's making me feel like I'm slowly dying inside while doing stand-up comedy to a ghost. I don’t know if this is just a personality mismatch or if he’s emotionally unavailable with a side of zero humor. Either way, it's draining.",
    "score": 0,
    "created_utc": 1746127277.0,
    "subreddit": "offmychest",
    "id": "1kch6fs"
  },
  {
    "title": "Lost friend of 20 years",
    "text": "So I have just lost a friend of 20 years. To explain we were at a after party of a baby shower and there had been some drinking when my friend's spouse's uncle who lives with them started to try to touch my girlfriend inappropriately my gf kept telling him no and she had to go hid in the conner for a minute so i could stop him. I told him to stop but he kept trying finally after a tense standoff and my friend's wife intervening, He left the party. The next day I told my girlfriend that I need to talk to my friend about what happened, my gf was talking to one of her friends that had already knew about what happened and her friend texted our friend circle saying she was starting drama. After this my Friend texted her and told her we are not welcome at their home along with some other nasty things and defended the uncle. It really hurts because I have known this friend my whole life and can't believe he would do this and stand up for this creep. Even if he apologized, I don't think I can forgive him nor trust him again. Part of me feels like I'm being over dramatic but I know that cutting him out of my life is the right thing to do.",
    "score": 3,
    "created_utc": 1746105649.0,
    "subreddit": "offmychest",
    "id": "1kc8kht"
  },
  {
    "title": "Odd things happening around my neighborhood...",
    "text": "Hello everyone, my family has been experiencing weird events during this week and I wanted to share to see if anyone is experiencing the same things. On Monday, in the early hours of the morning my father was about to go to work when he saw a drone flying over head. Then on Tuesday, some Mormon folks came by and my father told them to go away, now yesterday those same Mormon folks came by again when no one was home besides my grandmother when there was no vehicles, and she answered and since she can't speak English very well she still managed to get them to go away. Now today nothing has happened so far but my family has been on edge. Has anyone had an experience like this recently or are we just hitting random coincidences?",
    "score": 2,
    "created_utc": 1746113148.0,
    "subreddit": "offmychest",
    "id": "1kcbh4y"
  },
  {
    "title": "Im not sure what to think.",
    "text": "I am 20 f and my boyfriend is 19 m. We have been dating for about 5 months now and we are pretty serious. There are only a few issues that seem to be making me have doubts recently. At the beginning of our relationship he messaged his ex it wasn’t anything flirty or anything like that. However he had told me previously how much he hated her because of what she had done to him. So it threw me off when i found out that he had done that. I have a difficult time trusting people due to my past (which i won’t get into) so him doing that really made me a lot more aware of how he was acting and what he was doing. He hasn’t done anything wrong in our relationship other than that and lying to me a couple of times. One day i went on his phone and seen 15 odd messages between him and his friend calling me controlling and manipulative? when i asked him about it he just said he was spiralling and it was because he’s been hurt before and that none of it was true. I don’t really know what to think? as that really hurt me but also i might be hurting him without even being aware of it. I don’t want to be that type of person i really really do love him. \nIts also hard right now to bring anything up to him as he recently tried to kill himself after an argument that we had. I had to drive to the bridge and get him to get down which was really traumatic but again i don’t feel like i can bring this up to him as im scared he will feel bad about it. And do it again. \n\n(i really love him i just don’t know how to stop myself overthinking so much) ",
    "score": 2,
    "created_utc": 1746113131.0,
    "subreddit": "offmychest",
    "id": "1kcbgwc"
  },
  {
    "title": "Feeling stuck between loneliness and disillusionment with modern relationships",
    "text": "I’ve been sitting with a lot of feelings lately about being single, and I’m realizing it’s more complicated than just wanting a relationship. I’m chronically single, and despite a lot of effort, nothing has really stuck. I do want a relationship—but not just any one. I’m holding out for a healthy, aligned connection. And that’s where things get frustrating.\n\nIn the past, I used to feel left behind or even resentful when friends got into relationships or got married while I stayed stalled in singleness. But lately, I’ve noticed a shift. I’m no longer envious—if anything, I find myself disturbed by the kinds of relationships many people around me are in.\n\nSome of my friends are dating or married to men I frankly dislike. In some cases, I’d even call the relationships emotionally or mentally abusive. There’s also this other side of things where I’ve had to let go of friendships because of how relationship-centered they’ve become. And I don’t mean “they value their partner”—I mean things like:\n\n- Inviting me out under the impression it’s a one-on-one hang and then their partner shows up.\n\n-Canceling plans because they got a last-minute date.\n\n-Vanishing into their relationship and only resurfacing when their partner isn’t available.\n\n-going on and on about how they’re really only interested in making/engaging with “couple friends” now.\n\n\nI had a friend who stayed in a situationship with a man who explicitly said he didn’t want to be in a monogamous relationship with her. She still acted like they were together. When he finally broke things off, she spiraled to the point that I was afraid for her safety—and I stayed with her, nurtured her, tried to help. Weeks later she suddenly had a new boyfriend. I didn’t find out until they were engaged (7 months later), and she told me she hadn’t said anything because she thought I was “jealous” of her past relationships—when all I did was express concern over how she was being treated. \n\nAnd that’s the thing—so many of the relationships I’ve witnessed come with really heavy dynamics. Things left unspoken, emotional manipulation, unhealthy dependency. It’s not just that I don’t envy them—I actively feel relieved not to be caught in some of those patterns.\n\nSo here I am: craving deep romantic connection, but also not seeing any relationship around me that I’d want to trade places with. I don’t envy them. I don’t want to settle for emotional immaturity, abuse, or being someone’s rehab center.\n\nAnd lately I’ve been wondering—do I even want romance, or do I just want the kind of emotional intimacy and care that our society only seems to make room for inside romantic relationships? If friendship were truly valued and emotionally rich, would I still feel this ache?",
    "score": 2,
    "created_utc": 1746112718.0,
    "subreddit": "offmychest",
    "id": "1kcbauv"
  },
  {
    "title": "My pregnant friend is getting cheated on and I can't tell her",
    "text": "More than I can't tell her it's I have weighted out the options back when I first found out and I realised I was in no position to tell her.\n\nA little bit of context:\nI was friends with this girl in my childhood, we were neighbours and would spend many days playing together. She's a sweet girl who tries to appear confident and badass but deep down she has a golden heart.\n\nI moved countries over 10 years ago so I haven't been in contact with her for ages and we obviously lost our friendship.\n\nSome months ago a younger friend of mine told me that my friend's boyfriend was at one of her friend's party and he was making out with 15 year olds. \nHe also slept with a 15 year old all night and even had breakfast in the morning a few days before my friend posted a cute New Year's couple's picture.\nHe also has two phones.\n\nI weighted my options and thought about telling her but I first asked my family and my other friends for their opinion on this. I didn't want to make a rushed decision without thinking about it logically. I was going to write her anonymously. So what stopped me? \n\n1. He's highly dangerous, he's associated with this gang that has money and power in that village. On top of these connections he is also aggressive and violent with others. He's someone that wouldn't care about the consequences if you wrong him.\nI couldn't risk him finding out that my friend told me and I told his gf. I would be first of all putting my friend in danger since she lives in the same village as them.\n\n2. How do I know he would find out? All his boys know about it but nobody would snitch on him as they haven't done in all these years.\nShe has beef with one of his friends and would have a reasonable motive to tell on him.\n\n3. She might not believe me. He is a very good liar and manipulator so I'm 100% certain he'd twist this and make it seem as if someone out there is jealous and lying and that he only maybe kissed the girl because he was drunk etc.\n I would basically make them have a temporary crisis then all will be back to normal.\n\n4. Number 3 is reinforced by the fact that they were about to get marrier in two months and she might have let him slide because they had already spent money and resources into that wedding.\n\n5. I met her in the shop and made a sad and weird face when she told me she was about to get married. I don't think she got the hint since she might have just thought I was jealous. My face had clear concern on it but it wasn't even my intention to go further than that since she was accompanied by someone else.\n\nNow she's pregnant and I'm 100% sure he'll keep cheating on her and she'll end up miserable and divorced. \n\nThe whole village must know about this affair but everyone is too scared to snitch on him.\n\nIt's a pretty shitty situation and yes I do feel crap for not telling her. I wish it wasn't this complicated and I could just tell her.\n\nIt's too late now, she'll eventually find out and I can only wish her the best and to find a respectful guy that truly loves and deserves her.",
    "score": 1,
    "created_utc": 1746126094.0,
    "subreddit": "offmychest",
    "id": "1kcgpqr"
  }
]